Repository: yurchor/uk-man-firewalld
Catalog: *.po
Languages: uk

source: [B<--permanent>] B<--direct> B<--add-rule> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain> I<priority> I<args>
uk: [B<--permanent>] B<--direct> B<--add-rule> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок> I<пріоритетність> I<аргументи>

source: Add a rule with the arguments I<args> to chain I<chain> in table I<table> with priority I<priority>\&.
uk: Додати правило із аргументами I<аргументи> до ланцюжка I<ланцюжок> у таблиці I<таблиця> із пріоритетністю I<пріоритетність>\&.

source: The I<priority> is used to order rules\&. Priority 0 means add rule on top of the chain, with a higher priority the rule will be added further down\&. Rules with the same priority are on the same level and the order of these rules is not fixed and may change\&. If you want to make sure that a rule will be added after another one, use a low priority for the first and a higher for the following\&.
uk: I<Пріоритетність> буде використано для упорядковування правил\&. Пріоритетність 0 означає додавання правила на початку ланцюжка, а правила з вищою пріоритетністю буде додано далі за списком\&. Правила із однаковою пріоритетністю перебувають на одному рівні, порядок цих правил не є фіксованим і може змінюватися\&. Якщо ви хочете забезпечення додавання правила після іншого правила, скористайтеся меншою пріоритетністю для першого і вищою пріоритетністю для наступних\&.

source: [B<--permanent>] B<--direct> B<--remove-rule> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain> I<priority> I<args>
uk: [B<--permanent>] B<--direct> B<--remove-rule> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок> I<пріоритетність> I<аргументи>

source: Remove a rule with I<priority> and the arguments I<args> from chain I<chain> in table I<table>\&. Only rules previously added with B<--direct --add-rule> can be removed this way\&.
uk: Вилучити правило з пріоритетністю I<пріоритетність> і аргументами I<аргументи> з ланцюжка I<ланцюжок> у таблиці I<таблиця>\&. У цей спосіб можна вилучити лише ланцюжки, які раніше було додано за допомогою B<--direct --add-rule>\&.

source: [B<--permanent>] B<--direct> B<--remove-rules> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain>
uk: [B<--permanent>] B<--direct> B<--remove-rules> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок>

source: Remove all rules in the chain with name I<chain> exists in table I<table>\&. This option concerns only rules previously added with B<--direct --add-rule> in this chain\&.
uk: Вилучити усі правила у ланцюжку із назвою I<ланцюжок> у таблиці I<таблиця>\&. Цей параметр стосується лише правил, які раніше було додано у цьому ланцюжку за допомогою параметра B<--direct --add-rule>\&.

source: [B<--permanent>] B<--direct> B<--query-rule> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain> I<priority> I<args>
uk: [B<--permanent>] B<--direct> B<--query-rule> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок> I<пріоритетність> I<аргументи>

source: Return whether a rule with I<priority> and the arguments I<args> exists in chain I<chain> in table I<table>\&. Returns 0 if true, 1 otherwise\&. This option concerns only rules previously added with B<--direct --add-rule>\&.
uk: Повернути, чи існує правило із пріоритетністю I<пріоритетність> і аргументами I<аргументи> у ланцюжку I<ланцюжок> у таблиці I<таблиця>\&. Повертає 0, якщо існує; 1, якщо не існує\&. Цей параметр стосується лише правил, які раніше було додано за допомогою параметра B<--direct --add-rule>\&.

source: B<--direct> B<--passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<args>
uk: B<--direct> B<--passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<аргументи>

source: Pass a command through to the firewall\&. I<args> can be all B<iptables>, B<ip6tables> and B<ebtables> command line arguments\&. This command is untracked, which means that firewalld is not able to provide information about this command later on, also not a listing of the untracked passthoughs\&.
uk: Передати команду до брандмауера\&. Значенням I<аргументи> можуть бути будь-які аргументи командного рядка B<iptables>, B<ip6tables> та B<ebtables>\&. Стеження за цією командою не відбуватиметься, тобто firewalld не зможе надати відомості щодо цієї команди, а також список невідстежуваних передавань даних\&.

source: Get all passthrough rules as a newline separated list of the ipv value and arguments\&.
uk: Отримати усі правила передавання у форматі списку відокремлених символами нового рядка значень ipv та аргументів\&.

source: Get all passthrough rules for the ipv value as a newline separated list of the priority and arguments\&.
uk: Отримати усі правила передавання для значення ipv у форматі списку відокремлених символами розривів рядків пріоритетностей та аргументів\&.

source: [B<--permanent>] B<--direct> B<--add-passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<args>
uk: [B<--permanent>] B<--direct> B<--add-passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<аргументи>

source: Add a passthrough rule with the arguments I<args> for the ipv value\&.
uk: Додати правило передавання з аргументами I<аргументи> для значення ipv\&.

source: [B<--permanent>] B<--direct> B<--remove-passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<args>
uk: [B<--permanent>] B<--direct> B<--remove-passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<аргументи>

source: Remove a passthrough rule with the arguments I<args> for the ipv value\&.
uk: Вилучити правило передавання з аргументами I<аргументи> для значення ipv\&.

source: [B<--permanent>] B<--direct> B<--query-passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<args>
uk: [B<--permanent>] B<--direct> B<--query-passthrough> { I<ipv4> | I<ipv6> | I<eb> } I<аргументи>

source: Return whether a passthrough rule with the arguments I<args> exists for the ipv value\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи існує правило передавання з аргументами I<аргументи> для значення ipv\&. Повертає 0, якщо існує; 1, якщо не існує\&.

source: Lockdown Options
uk: Параметри блокування

source: Local applications or services are able to change the firewall configuration if they are running as root (example: libvirt) or are authenticated using PolicyKit\&. With this feature administrators can lock the firewall configuration so that only applications on lockdown whitelist are able to request firewall changes\&.
uk: Локальні програми або служби можуть змінювати налаштування брандмауера, якщо їх запущено від імені користувача root (приклад: libvirt) або їм надано відповідні привілеї шляхом розпізнавання за допомогою PolicyKit\&. За допомогою цієї можливості адміністратори можуть заблокувати налаштування брандмауера, щоб запити щодо змін у брандмауері могли надсилати лише програми із «білого» списку блокування\&.

source: The lockdown access check limits D-Bus methods that are changing firewall rules\&. Query, list and get methods are not limited\&.
uk: Перевірка блокування доступу обмежує методи D-Bus, які можна використовувати для зміни правил\&. Методи опитування, виведення списку та отримання даних обмеженням не підлягають\&.

source: The lockdown feature is a very light version of user and application policies for firewalld and is turned off by default\&.
uk: Можливість блокування є дуже простою версією правил для користувачів і програм для firewalld\&. Типово, її вимкнено\&.

source: Enable lockdown\&. Be careful - if firewall-cmd is not on lockdown whitelist when you enable lockdown you won\*(Aqt be able to disable it again with firewall-cmd, you would need to edit firewalld\&.conf\&.
uk: Увімкнути блокування\&. Будьте обережні: якщо firewall-cmd не буде у «білому» списку блокування, коли ви увімкнете блокування, ви не зможете знову його вимкнути за допомогою firewall-cmd — вам доведеться редагувати firewalld\&.conf\&.

source: Disable lockdown\&.
uk: Вимкнути блокування\&.

source: Query whether lockdown is enabled\&. Returns 0 if lockdown is enabled, 1 otherwise\&.
uk: Надіслати запит щодо того, чи увімкнено блокування\&. Повертає 0, якщо блокування увімкнено; 1, якщо вимкнено\&.

source: Lockdown Whitelist Options
uk: Параметри «білого» списку блокування

source: The lockdown whitelist can contain I<commands>, I<contexts>, I<users> and I<user ids>\&.
uk: У «білому» списку блокування можуть міститися I<команди>, I<контексти>, I<користувачі> і I<ідентифікатори користувачів>\&.

source: If a command entry on the whitelist ends with an asterisk \*(Aq*\*(Aq, then all command lines starting with the command will match\&. If the \*(Aq*\*(Aq is not there the absolute command inclusive arguments must match\&.
uk: Якщо запис команди у «білому» списку завершується зірочкою, \*(Aq*\*(Aq, відповідними вважатимуться усі рядки команд, які починаються із вказаної команди\&. Якщо у записі немає \*(Aq*\*(Aq, відповідність буде встановлено, лише якщо команда, разом із аргументами, точно збігається із вказаним записом\&.

source: Command paths for users are not always the same and depends on the users PATH\&. Some distributions symlink B</bin> to B</usr/bin> in which case it depends on the order they appear in the PATH environment variable\&.
uk: Шляхи до команд для різних користувачів можуть бути різними: вони залежать від значення змінної PATH користувача\&. У деяких дистрибутивах B</bin> є символічним посиланням на B</usr/bin>\&. У таких випадках усе залежатиме від порядку, у якому ці каталоги вказано у змінній середовища PATH\&.

source: The context is the security (SELinux) context of a running application or service\&. To get the context of a running application use B<ps -e --context>\&.
uk: Контекстом є контекст захисту (SELinux) запущеної програми або служби\&. Для отримання контексту запущеної програми скористайтеся командою B<ps -e --context>\&.

source: B<Warning:> If the context is unconfined, then this will open access for more than the desired application\&.
uk: B<Попередження:> якщо контекст є необмеженим (unconfined), це може відкрити доступ до ресурсів, які перевищують лише саму бажану програму\&.

source: The lockdown whitelist entries are checked in the following order:
uk: Записи «білого» списку блокування буде оброблено у такому порядку:

source: 1\&. I<context>
uk: 1\&. I<контекст>

source: 3\&. I<user>
uk: 3\&. I<користувач>

source: 4\&. I<command>
uk: 4\&. I<команда>

source: List all command lines that are on the whitelist\&.
uk: Вивести список усіх рядків команд, які перебувають у «білому» списку\&.

source: [B<--permanent>] B<--add-lockdown-whitelist-command>=I<command>
uk: [B<--permanent>] B<--add-lockdown-whitelist-command>=I<команда>

source: Add the I<command> to the whitelist\&.
uk: Додати команду I<команда> до «білого» списку\&.

source: [B<--permanent>] B<--remove-lockdown-whitelist-command>=I<command>
uk: [B<--permanent>] B<--remove-lockdown-whitelist-command>=I<команда>

source: Remove the I<command> from the whitelist\&.
uk: Вилучити команду I<команда> з «білого» списку\&.

source: [B<--permanent>] B<--query-lockdown-whitelist-command>=I<command>
uk: [B<--permanent>] B<--query-lockdown-whitelist-command>=I<команда>

source: Query whether the I<command> is on the whitelist\&. Returns 0 if true, 1 otherwise\&.
uk: Визначити, чи є I<команда> у «білому» списку\&. Повертає 0, якщо є; 1, якщо немає\&.

source: List all contexts that are on the whitelist\&.
uk: Вивести список усіх контекстів, які перебувають у «білому» списку\&.

source: [B<--permanent>] B<--add-lockdown-whitelist-context>=I<context>
uk: [B<--permanent>] B<--add-lockdown-whitelist-context>=I<контекст>

source: Add the context I<context> to the whitelist\&.
uk: Додати контекст I<контекст> до «білого» списку\&.

source: [B<--permanent>] B<--remove-lockdown-whitelist-context>=I<context>
uk: [B<--permanent>] B<--remove-lockdown-whitelist-context>=I<контекст>

source: Remove the I<context> from the whitelist\&.
uk: Вилучити контекст I<контекст> з «білого» списку\&.

source: [B<--permanent>] B<--query-lockdown-whitelist-context>=I<context>
uk: [B<--permanent>] B<--query-lockdown-whitelist-context>=I<контекст>

source: Query whether the I<context> is on the whitelist\&. Returns 0 if true, 1 otherwise\&.
uk: Визначити, чи є I<контекст> у «білому» списку\&. Повертає 0, якщо є; 1, якщо немає\&.

source: List all user ids that are on the whitelist\&.
uk: Вивести список усіх ідентифікаторів користувачів, які перебувають у «білому» списку\&.

source: Add the user id I<uid> to the whitelist\&.
uk: Додати ідентифікатор користувача I<uid> до «білого» списку\&.

source: Remove the user id I<uid> from the whitelist\&.
uk: Вилучити ідентифікатор користувача I<uid> з «білого» списку\&.

source: Query whether the user id I<uid> is on the whitelist\&. Returns 0 if true, 1 otherwise\&.
uk: Визначити, чи є ідентифікатор користувача I<uid> у «білому» списку\&. Повертає 0, якщо є; 1, якщо немає\&.

source: List all user names that are on the whitelist\&.
uk: Вивести список усіх імена користувачів, які перебувають у «білому» списку\&.

source: [B<--permanent>] B<--add-lockdown-whitelist-user>=I<user>
uk: [B<--permanent>] B<--add-lockdown-whitelist-user>=I<користувач>

source: Add the user name I<user> to the whitelist\&.
uk: Додати ім'я користувача I<користувач> до «білого» списку\&.

source: [B<--permanent>] B<--remove-lockdown-whitelist-user>=I<user>
uk: [B<--permanent>] B<--remove-lockdown-whitelist-user>=I<користувач>

source: Remove the user name I<user> from the whitelist\&.
uk: Вилучити ім'я користувача I<користувач> з «білого» списку\&.

source: [B<--permanent>] B<--query-lockdown-whitelist-user>=I<user>
uk: [B<--permanent>] B<--query-lockdown-whitelist-user>=I<користувач>

source: Query whether the user name I<user> is on the whitelist\&. Returns 0 if true, 1 otherwise\&.
uk: Визначити, чи є ім'я користувача I<користувач> у «білому» списку\&. Повертає 0, якщо є; 1, якщо немає\&.

source: Panic Options
uk: Параметри паніки

source: Enable panic mode\&. All incoming and outgoing packets are dropped, active connections will expire\&. Enable this only if there are serious problems with your network environment\&. For example if the machine is getting hacked in\&.
uk: Увімкнути режим паніки\&. Усі вхідні і вихідні пакети буде відкинуто, строк дії активних з'єднань завершено\&. Вмикайте, лише якщо у вашому середовищі мережі є серйозні проблеми\&. Наприклад, якщо відбувся злам комп'ютера\&.

source: This is a runtime only change\&.
uk: Цю зміну буде внесено лише до динамічних налаштувань\&.

source: Disable panic mode\&. After disabling panic mode established connections might work again, if panic mode was enabled for a short period of time\&.
uk: Вимкнути режим паніки\&. Після вимикання режиму паніки можуть запрацювати встановлені з'єднання, якщо режим паніки було увімкнено протягом короткого періоду часу\&.

source: Returns 0 if panic mode is enabled, 1 otherwise\&.
uk: Повертає 0, якщо увімкнено режим паніки, і 1, якщо ні\&.

source: EXAMPLES
uk: ПРИКЛАДИ

source: For more examples see \m[blue]B<\%http://fedoraproject.org/wiki/FirewallD>\m[]
uk: Інші приклад можна знайти на сторінці \m[blue]B<\%http://fedoraproject.org/wiki/FirewallD>\m[]

source: Example 1
uk: Приклад 1

source: Enable http service in default zone\&. This is runtime only change, i\&.e\&. effective until restart\&.
uk: Увімкнути службу http у типовій зоні\&. Це зміна лише у динамічних налаштуваннях, тобто вона працюватиме лише до перезапуску\&.

source: Example 2
uk: Приклад 2

source: Enable port 443/tcp immediately and permanently in default zone\&. To make the change effective immediately and also after restart we need two commands\&. The first command makes the change in runtime configuration, i\&.e\&. makes it effective immediately, until restart\&. The second command makes the change in permanent configuration, i\&.e\&. makes it effective after restart\&.
uk: Увімкнути порт 443/tcp негайно і постійно у типовій зоні\&. Щоб зміна набула чинності негайно, а також після перезапуску, вам потрібні будуть дві команди\&. Перша команда внесе зміни до динамічних налаштувань, тобто змінить поведінку негайно, аж до перезапуску\&. Друга команда внесе зміни до постійних налаштувань, тобто зробить зміни чинними після перезапуску\&.

source: EXIT CODES
uk: КОДИ ЗАВЕРШЕННЯ

source: On success 0 is returned\&. On failure the output is red colored and exit code is either 2 in case of wrong command-line option usage or one of the following error codes in other cases:
uk: Якщо дію буде виконано успішно, програма поверне код 0\&. Якщо станеться помилка, виведені дані буде розфарбовано у червоний колір, а станом виходу буде 2, якщо буде виявлено помилки у рядку команди, або один із вказаних нижче кодів помилок в інших випадках:

source: String
uk: Рядок

source: Code
uk: Код

source: Note that return codes of B<--query-*> options are special: Successful queries return 0, unsuccessful ones return 1 unless an error occurred in which case the table above applies\&.
uk: Зауважте, що коди повернення параметрів B<--query-*> є особливими: успішне виконання запитів даватиме код 0, неуспішне — код 1\&. Якщо станеться помилка, буде повернуто код за наведеною вище таблицею\&.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: NOTES
uk: ПРИМІТКИ

source: firewalld home page:
uk: Домашня сторінка firewalld:

source: More documentation with examples:
uk: Додаткова документація з прикладами:

source: AUTHORS
uk: АВТОРИ

source: Developer
uk: Розробник

source: firewalld - Dynamic Firewall Manager
uk: firewalld — динамічний засіб керування брандмауером

source: B<firewalld >B<[OPTIONS...]>
uk: B<firewalld >B<[ПАРАМЕТРИ...]>

source: firewalld provides a dynamically managed firewall with support for network/firewall zones to define the trust level of network connections or interfaces\&. It has support for IPv4, IPv6 firewall settings and for ethernet bridges and has a separation of runtime and permanent configuration options\&. It also supports an interface for services or applications to add firewall rules directly\&.
uk: firewalld забезпечує роботу динамічно керованого брандмауера із підтримкою зон мережі/брандмауера для визначення рівня довіри до мережевих з'єднань або інтерфейсів\&. Передбачено підтримку параметрів брандмауера для IPv4, IPv6 і містків ethernet, а також поділ параметрів налаштувань на динамічні і постійні\&. Також передбачено підтримку інтерфейсу для служб або програм для безпосереднього додавання правил брандмауера\&.

source: These are the command line options of firewalld:
uk: Ось параметри командного рядка firewalld:

source: Path to firewalld default configuration\&. This usually defaults to I</usr/lib/firewalld>\&.
uk: Шлях до типових налаштувань\&. Зазвичай, типовим є I</usr/lib/firewalld>\&.

source: B<--debug>[=I<level>]
uk: B<--debug>[=I<рівень>]

source: Set the debug level for firewalld to I<level>\&. The range of the debug level is 1 (lowest level) to 10 (highest level)\&. The debug output will be written to the firewalld log file I</var/log/firewalld>\&.
uk: Встановити для рівня діагностики firewalld значення I<рівень>\&. Діапазоном рівня діагностики є значення від 1 (найнижчий рівень) до 10 (найвищий рівень)\&. Діагностичні дані буде записано до файла журналу firewalld I</var/log/firewalld>\&.

source: Print garbage collector leak information\&. The collector runs every 10 seconds and if there are leaks, it prints information about the leaks\&.
uk: Вивести відомості щодо витоків у засобі збирання сміття\&. Засіб збирання сміття запускається кожні 10 секунді, і якщо було виявлено витоки, вивести відомості щодо витоків\&.

source: Turn off daemon forking\&. Force firewalld to run as a foreground process instead of as a daemon in the background\&.
uk: Вимкнути відгалуження фонової служби\&. Примусити firewalld до запуску як основного процесу, замість фонової служби у тлі\&.

source: Disable writing pid file\&. By default the program will write a pid file\&. If the program is invoked with this option it will not check for an existing server process\&.
uk: Вимкнути запис файла pid\&. Типово, програма записує файл pid\&. Якщо програму викликано з цим параметром, вона не перевірятиме наявність процесу сервера\&.

source: Path to firewalld system (user) configuration\&. This usually defaults to I</etc/firewalld>\&.
uk: Шлях до загальносистемних (користувача) налаштувань firewalld\&. Зазвичай, типовим значенням є I</etc/firewalld>\&.

source: CONCEPTS
uk: ЗАГАЛЬНІ ПОНЯТТЯ

source: firewalld has a D-Bus interface for firewall configuration of services and applications\&. It also has a command line client for the user\&. Services or applications already using D-Bus can request changes to the firewall with the D-Bus interface directly\&. For more information on the firewalld D-Bus interface, please have a look at B<firewalld.dbus>(5)\&.
uk: firewalld має інтерфейс D-Bus для налаштувань служб і програм брандмауера\&. У комплекті є клієнт командного рядка для користувача\&. Служби і програми, які вже використовують D-Bus, можуть надсилати безпосередні запити щодо змін у брандмауері за допомогою інтерфейсу D-Bus\&. Щоб дізнатися більше про інтерфейс D-Bus firewalld, будь ласка, ознайомтеся із підручником щодо B<firewalld.dbus>(5)\&.

source: firewalld provides support for zones, predefined services and ICMP types and has a separation of runtime and permanent configuration options\&. Permanent configuration is loaded from XML files in I</usr/lib/firewalld> (B<--default-config>) or I</etc/firewalld> (B<--system-config>) (see the section called \(lqDIRECTORIES\(rq)\&.
uk: У firewalld передбачено підтримку зон, попередньо визначених служб та типів ICMP, а також відокремлення динамічних і постійних параметрів налаштувань\&. Постійні налаштування буде завантажено з файлів XML у I</usr/lib/firewalld> (B<--default-config>) або I</etc/firewalld> (B<--system-config>) (див. розділ із назвою \(lqКАТАЛОГИ\(rq)\&.

source: If NetworkManager is not in use and firewalld gets started after the network is already up, the connections and manually created interfaces are not bound to the zone specified in the ifcfg file\&. The interfaces will automatically be handled by the default zone\&. firewalld will also not get notified about network device renames\&. All this also applies to interfaces that are not controlled by NetworkManager if I<NM_CONTROLLED=no> is set\&.
uk: Якщо у системі не використовується NetworkManager, а firewalld запускається після забезпечення працездатності мережі, з'єднання та створені вручну інтерфейси є обмежено зоною, яке вказано у файлі ifcfg\&. Обробка інтерфейсів виконуватиметься автоматично типовою зоною\&. Крім того, firewalld не отримуватиме сповіщень щодо перейменувань пристроїв мережі\&. Усе це також стосується інтерфейсів, якими не керує NetworkManager, якщо встановлено I<NM_CONTROLLED=no>\&.

source: You can add these interfaces to a zone with B<firewall-cmd [--permanent] --zone=>I<zone>B< --add-interface=>I<interface>\&. If there is a /etc/sysconfig/network-scripts/ifcfg-I<interface> file, firewalld tries to change the ZONE=I<zone> setting in this file\&.
uk: Ви можете додати ці інтерфейси до зони за допомогою команди B<firewall-cmd [--permanent] --zone=>I<зона>B< --add-interface=>I<інтерфейс>\&. Якщо існує файл /etc/sysconfig/network-scripts/ifcfg-I<інтерфейс>, firewalld намагатиметься змінити параметр ZONE=I<зона> у цьому файлі\&.

source: If firewalld gets reloaded, it will restore the interface bindings that were in place before reloading to keep interface bindings stable in the case of NetworkManager uncontrolled interfaces\&. This mechanism is not possible in the case of a firewalld service restart\&.
uk: При перезавантаженні firewalld відновлюватиме прив'язки інтерфейсів, які було використано до перезавантаження, для збереження стабільної прив'язки до інтерфейсів у випадку некерованих NetworkManager інтерфейсів\&. Цей механізм неможливий у випадку перезапуску служби firewalld\&.
