Repository: yurchor/uk-man-firewalld
Catalog: *.po
Languages: uk

source: It is essential to keep the ZONE= setting in the ifcfg file consistent to the binding in firewalld in the case of NetworkManager uncontrolled interfaces\&.
uk: Критично важливо підтримувати узгодженість параметра ZONE= у файлі ifcfg із прив'язкою у firewalld у випадку неконтрольованих NetworkManager інтерфейсів\&.

source: Zones
uk: Зони

source: A network or firewall zone defines the trust level of the interface used for a connection\&. There are several pre-defined zones provided by firewalld\&. Zone configuration options and generic information about zones are described in B<firewalld.zone>(5)
uk: Зона мережі або брандмауера визначає рівень довіри до інтерфейсу, який буде використано для з'єднання\&. У firewalld передбачено декілька попередньо визначених зон\&. Параметри налаштування зон та загальні відомості щодо зон описано на сторінці підручника B<firewalld.zone>(5)

source: Services
uk: Служби

source: A service can be a list of local ports, protocols and destinations and additionally also a list of firewall helper modules automatically loaded if a service is enabled\&. Service configuration options and generic information about services are described in B<firewalld.service>(5)\&. The use of predefined services makes it easier for the user to enable and disable access to a service\&.
uk: Службою може бути список локальних портів, протоколів та призначено, а також список модулів допоміжних засобів брандмауера, які автоматично завантажуються, якщо службу увімкнено\&. Параметри налаштувань служб та загальні відомості про служби наведено на сторінці підручника B<firewalld.service>(5)\&. Використання попередньо визначених служб спрощує для користувача доступ до вмикання і вимикання служби\&.

source: ICMP types
uk: Типи ICMP

source: The Internet Control Message Protocol (ICMP) is used to exchange information and also error messages in the Internet Protocol (IP)\&. ICMP types can be used in firewalld to limit the exchange of these messages\&. For more information, please have a look at B<firewalld.icmptype>(5)\&.
uk: Протокол керування повідомленнями інтернету (Internet Control Message Protocol або ICMP) використовують для обміну відомостями, а також повідомленням про помилки у протоколі інтернету (Internet Protocol або IP)\&. Типами ICMP можна скористатися у firewalld для обмеження обміну цими повідомленнями\&. Щоб дізнатися більше, будь ласка, зверніться до сторінки підручника B<firewalld.icmptype>(5)\&.

source: Runtime configuration
uk: Динамічні налаштування

source: Runtime configuration is the actual active configuration and is not permanent\&. After reload/restart of the service or a system reboot, runtime settings will be gone if they haven\*(Aqt been also in permanent configuration\&.
uk: Динамічні налаштування — справжні активні налаштування, які не є постійними\&. Після перезавантаження або перезапуску служби або перезавантаження системи динамічні параметри буде втрачено, якщо їх немає також у постійних налаштуваннях\&.

source: Permanent configuration
uk: Постійні налаштування

source: The permanent configuration is stored in config files and will be loaded and become new runtime configuration with every machine boot or service reload/restart\&.
uk: Постійні налаштування зберігаються у файлах налаштувань. Їх буде завантажено, і вони стануть динамічними налаштуваннями під час кожного завантаження системи або перезавантаження/перезапуску служби\&.

source: Direct interface
uk: Безпосередній інтерфейс

source: The direct interface is mainly used by services or applications to add specific firewall rules\&. It requires basic knowledge of ip(6)tables concepts (tables, chains, commands, parameters, targets)\&.
uk: Безпосередній інтерфейс, в основному, використовують служби або програми для додавання специфічних правил брандмауера\&. Щоб скористатися ними потрібні базові знання щодо понять ip(6)tables (таблиць, ланцюжків, команд, параметрів, призначень)\&.

source: DIRECTORIES
uk: КАТАЛОГИ

source: firewalld supports two configuration directories:
uk: У firewalld передбачено підтримку двох каталогів налаштувань:

source: Default/Fallback configuration in I</usr/lib/firewalld>R< (--default-config)>
uk: Типові/Резервні налаштування у I</usr/lib/firewalld>R< (--default-config)>

source: This directory contains the default and fallback configuration provided by firewalld for icmptypes, services and zones\&. The files provided with the firewalld package should not get changed and the changes are gone with an update of the firewalld package\&. Additional B<icmptypes>, B<services> and B<zones> can be provided with packages or by creating files\&.
uk: У цьому каталозі зберігаються типові та резервні налаштування, які надаються firewalld для типів ICMP, служб і зон\&. До файлів, які є частиною пакунка firewalld, не варто вносити зміни, оскільки внесені зміни буде втрачено під час оновлення пакунка firewalld\&. Додаткові B<типи ICMP>, B<служби> і B<зони> додають окремими пакунками або створенням відповідних файлів\&.

source: System configuration settings in I</etc/firewalld>R< (--system-config)>
uk: Загальносистемні параметри налаштувань в I</etc/firewalld>R< (--system-config)>

source: The system or user configuration stored here is either created by the system administrator or by customization with the configuration interface of firewalld or by hand\&. The files will overload the default configuration files\&.
uk: Загальносистемні налаштування або налаштування користувача, які зберігаються у цих каталогах, має бути або створено адміністратором системи, налаштовано за допомогою інтерфейсу налаштовування firewalld або створено вручну\&. Ці файли мають вищий пріоритет за файли типових налаштувань\&.

source: To manually change settings of pre-defined icmptypes, zones or services, copy the file from the default configuration directory to the corresponding directory in the system configuration directory and change it accordingly\&.
uk: Щоб змінити параметри попередньо визначених типів ICMP, зон або служб, скопіюйте файл з каталогу типових налаштувань до відповідного каталогу загальносистемних налаштувань і внесіть до нього бажані зміни\&.

source: For more information on icmptypes, please have a look at the B<firewalld.icmptype>(5) man page, for services at B<firewalld.service>(5) and for zones at B<firewalld.zone>(5)\&.
uk: Щоб дізнатися більше про типи ICMP, будь ласка, зазирніть на сторінку підручника B<firewalld.icmptype>(5). Докладніші відомості щодо служб можна знайти на сторінці B<firewalld.service>(5), а щодо зон — на сторінці B<firewalld.zone>(5)\&.

source: SIGNALS
uk: СИГНАЛИ

source: Currently only SIGHUP is supported\&.
uk: У поточній версії передбачено підтримку лише SIGHUP\&.

source: Reloads the complete firewall configuration\&. You can also use B<firewall-cmd --reload>\&. All runtime configuration settings will be restored\&. Permanent configuration will change according to options defined in the configuration files\&.
uk: Перезавантажує налаштування брандмауера повністю\&. Ви також можете скористатися B<firewall-cmd --reload>\&. Усі динамічні параметри налаштувань буде відновлено\&. Постійні налаштування буде змінено відповідно до параметрів, які визначено у файлах налаштувань\&.

source: ACL File Utilities
uk: Програми для роботи з файлами ACL

source: May 2000
uk: травень 2000 року

source: Access Control Lists
uk: Списки керування доступом

source: getfacl - get file access control lists
uk: getfacl — отримання списків керування доступом

source: B<getfacl> [-aceEsRLPtpndvh] file ...
uk: B<getfacl> [-aceEsRLPtpndvh] файл ...

source: For each file, getfacl displays the file name, owner, the group, and the Access Control List (ACL). If a directory has a default ACL, getfacl also displays the default ACL. Non-directories cannot have default ACLs.
uk: Для кожного файла getfacl виводить назву файла, власника, групу та список керування доступом (ACL). Якщо у каталогу є типовий ACL, getfacl також виводити типовий ACL. Об'єкти, які не є каталогами, не можуть мати типових ACL.

source: If getfacl is used on a file system that does not support ACLs, getfacl displays the access permissions defined by the traditional file mode permission bits.
uk: Якщо getfacl використано у файловій системі, у якій не передбачено підтримки ACL, getfacl виведе права доступу, які визначено традиційними бітами режиму доступу до файлів.

source: The output format of getfacl is as follows:
uk: Формат виведення даних getfacl є таким:

source: Lines 1--3 indicate the file name, owner, and owning group.
uk: Рядки 1--3 показують назву файла, власника та групу-власника.

source: Line 4 indicates the setuid (s), setgid (s), and sticky (t) bits: either the letter representing the bit, or else a dash (-). This line is included if any of those bits is set and left out otherwise, so it will not be shown for most files. (See CONFORMANCE TO POSIX 1003.1e DRAFT STANDARD\~17 below.)
uk: Рядок 4 показує біти setuid (s), setgid (s) та липкі біти (t): або літерою, яка представляє біт, або дефісом (-). Цей рядок буде включено, якщо встановлено якийсь з цих бітів. Його не буде показано, якщо це не так, тому його не буде показано для більшості файлів. (Див. «СУМІСНІСТЬ ІЗ ЧЕРНЕТКОЮ СТАНДАРТУ POSIX 1003.1e \~17» нижче.)

source: Lines 5, 7 and 10 correspond to the user, group and other fields of the file mode permission bits. These three are called the base ACL entries. Lines 6 and 8 are named user and named group entries. Line 9 is the effective rights mask. This entry limits the effective rights granted to all groups and to named users. (The file owner and others permissions are not affected by the effective rights mask; all other entries are.) Lines 11--15 display the default ACL associated with this directory. Directories may have a default ACL. Regular files never have a default ACL.
uk: Рядки 5, 7 і 10 є записами користувача, групи та інших полів бітів режиму доступу до файлів. Ці три записи називають базовими записами ACL. Рядки 6 і 8 називають записами іменованого користувача та іменованої групи. У рядку 9 буде показано ефективну маску прав. Це запис обмежує ефективні права, які надано усім групам та іменованим користувачам. (На власника файла та інші права доступу не впливає ефективна маска прав; але вона впливає на усі інші записи.) У рядках 11--15 буде показано типовий ACL, який пов'язано із цим каталогом. Каталоги можуть мати типовий ACL. Звичайні файли ніколи не мають типового ACL.

source: The default behavior for getfacl is to display both the ACL and the default ACL, and to include an effective rights comment for lines where the rights of the entry differ from the effective rights.
uk: Типовою поведінкою getfacl є показ ACL і типового ACL, а також включення коментаря щодо ефективних прав доступу для рядків, де права доступу запису відрізняються від ефективних прав доступу.

source: If output is to a terminal, the effective rights comment is aligned to column 40. Otherwise, a single tab character separates the ACL entry and the effective rights comment.
uk: Якщо виведення даних відбувається до термінала, коментар щодо ефективних прав доступу буде вирівняно за позицією 40. В інших випадках запис ACL і коментар щодо ефективних прав доступу буде відокремлено символом табуляції.

source: The ACL listings of multiple files are separated by blank lines. The output of getfacl can also be used as input to setfacl.
uk: Записи у списках ACL для декількох файлів буде відокремлено порожніми рядками. Дані, які виведено getfacl можна використовувати як вхідні дані setfacl.

source: PERMISSIONS
uk: ПРАВА ДОСТУПУ

source: Process with search access to a file (i.e., processes with read access to the containing directory of a file) are also granted read access to the file's ACLs. This is analogous to the permissions required for accessing the file mode.
uk: Процесам із доступом до пошуку файла (тобто процесам, які мають доступ до читання вмісту каталогу, у якому зберігається файл) також буде надано доступ до читання ACL файла. Це аналог прав доступу, які потрібні для визначення режиму доступу до файла.

source: Display the file access control list.
uk: Вивести список керування доступом до файлів.

source: Display the default access control list.
uk: Вивести типовий список керування доступом.

source: Do not display the comment header (the first three lines of each file's output).
uk: Не показувати заголовок-коментар (перші три рядки виведених даних для кожного з файлів).

source: Print all effective rights comments, even if identical to the rights defined by the ACL entry.
uk: Вивести усі коментарі щодо ефективних прав доступу, навіть якщо ці права доступу збігаються із правами доступу, які визначено записом ACL.

source: Do not print effective rights comments.
uk: Не виводити коментарів щодо реальних прав.

source: Skip files that only have the base ACL entries (owner, group, others).
uk: Пропустити файли, які мають лише базові записи ACL (власник, група, інші).

source: List the ACLs of all files and directories recursively.
uk: Вивести список ACL для усіх файлів і каталогів рекурсивно.

source: Logical walk, follow symbolic links to directories. The default behavior is to follow symbolic link arguments, and skip symbolic links encountered in subdirectories. Only effective in combination with -R.
uk: Логічний обхід з переходом за символічними посиланнями на каталоги. Типовою поведінкою є перехід за аргументами символічних посилань і пропускання символічних посилань у підкаталогах. Працює лише у поєднанні з -R.

source: Physical walk, do not follow symbolic links to directories. This also skips symbolic link arguments. Only effective in combination with -R.
uk: Фізичний обхід без переходу за символічними посиланнями на каталоги. У результаті також буде пропущено аргументи символічних посилань. Працює лише у поєднанні з -R.

source: Use an alternative tabular output format. The ACL and the default ACL are displayed side by side. Permissions that are ineffective due to the ACL mask entry are displayed capitalized. The entry tag names for the ACL_USER_OBJ and ACL_GROUP_OBJ entries are also displayed in capital letters, which helps in spotting those entries.
uk: Використати альтернативний табличний формат виведення даних. ACL і типовий ACL буде показано поруч. Права доступу, які не діють через запис маски ACL, буде показано великими літерами. Назви міток запису для записів ACL_USER_OBJ і ACL_GROUP_OBJ також буде показано великими літерами. Це допоможе у виявленні цих записів.

source: Do not strip leading slash characters (`/'). The default behavior is to strip leading slash characters.
uk: Не вилучати початкові символи похилої риски («/»). Типовою поведінкою є вилучення початкових символів похилої риски.

source: List numeric user and group IDs
uk: Вивести список числових ідентифікаторів користувачів і груп.

source: Print the version of getfacl and exit.
uk: Вивести дані щодо версії getfacl і вийти.

source: Print help explaining the command line options.
uk: Вивести довідку із поясненням щодо параметрів командного рядка.

source: End of command line options. All remaining parameters are interpreted as file names, even if they start with a dash character.
uk: Кінець параметрів командного рядка. Решта параметрів вважатиметься назвами файлів, навіть якщо вони починаються із символу дефіса.

source: If the file name parameter is a single dash character, getfacl reads a list of files from standard input.
uk: Якщо параметр назви файла є одинарним символом дефіса, getfacl читає список файлів зі стандартного джерела вхідних даних.

source: CONFORMANCE TO POSIX 1003.1e DRAFT STANDARD 17
uk: СУМІСНІСТЬ ІЗ ЧЕРНЕТКОЮ СТАНДАРТУ POSIX 1003.1e 17

source: If the environment variable POSIXLY_CORRECT is defined, the default behavior of getfacl changes in the following ways: Unless otherwise specified, only the ACL is printed. The default ACL is only printed if the I<-d> option is given. If no command line parameter is given, I<getfacl> behaves as if it was invoked as ``getfacl -''. No flags comments indicating the setuid, setgit, and sticky bits are generated.
uk: Якщо визначено змінну середовища POSIXLY_CORRECT, типову поведінку getfacl буде змінено таким чином: якщо не вказано інакше, буде виведено лише дані ACL. Типовий ACL буде виведено, лише якщо вказано параметр I<-d>. Якщо параметрів командного рядка не вказано, I<getfacl> поводитиметься так, наче програму викликано як ``getfacl -''. Коментарів із прапорцями із даними щодо бітів setuid, setgit та липкого біта виведено не буде.

source: AUTHOR
uk: АВТОР

source: Please send your bug reports and comments to the above address.
uk: Будь ласка, надсилайте ваші звіти про вади та коментарі на вказану вище адресу.

source: setfacl - set file access control lists
uk: setfacl — встановлення списків керування доступом до файлів

source: B<setfacl> [-bkndRLPvh] [{-m|-x} acl_spec] [{-M|-X} acl_file] file ...
uk: B<setfacl> [-bkndRLPvh] [{-m|-x} специфікація_acl] [{-M|-X} файл_acl] файл ...

source: B<setfacl> --restore=file
uk: B<setfacl> --restore=файл

source: This utility sets Access Control Lists (ACLs) of files and directories. On the command line, a sequence of commands is followed by a sequence of files (which in turn can be followed by another sequence of commands, ...).
uk: Ця допоміжна програма встановлює списки керування доступом (Access Control Lists або ACL) для файлів і каталогів. У рядку команди за послідовністю команд має бути вказано послідовність файлів (за якою можна також вказати ще одну послідовність команд тощо).

source: The I<-m> and I<-x> options expect an ACL on the command line. Multiple ACL entries are separated by comma characters (`,'). The I<-M> and I<-X> options read an ACL from a file or from standard input. The ACL entry format is described in Section ACL ENTRIES.
uk: Параметрам I<-m> і I<-x> слід передати ACL у рядку команди. Якщо вказано декілька ACL, записи слід відокремлювати комами («,»). Використання параметрів I<-M> і I<-X> призведе до читання ACL з файла або стандартного джерела вхідних даних. Формат запису ACL описано у розділі «ЗАПИСИ ACL».

source: The I<--set> and I<--set-file> options set the ACL of a file or a directory. The previous ACL is replaced. ACL entries for this operation must include permissions.
uk: Параметри I<--set> і I<--set-file> встановлюють ACL файла або каталогу. Попередній ACL буде замінено. Записи ACL для цієї дії мають включати права доступу.

source: The I<-m (--modify)> and I<-M (--modify-file)> options modify the ACL of a file or directory. ACL entries for this operation must include permissions.
uk: Параметри I<-m (--modify)> і I<-M (--modify-file)> вносять зміни до ACL файла або каталогу. Записи ACL для цієї дії мають включати права доступу.

source: The I<-x (--remove)> and I<-X (--remove-file)> options remove ACL entries. It is not an error to remove an entry which does not exist. Only ACL entries without the I<perms> field are accepted as parameters, unless POSIXLY_CORRECT is defined.
uk: Використання параметрів I<-x (--remove)> і I<-X (--remove-file)> призведе до вилучення записів ACL. Вилучення запису, якого не існує, не вважається помилкою. Як параметри, приймаються лише записи ACL без поля I<права_доступу>, якщо не визначено POSIXLY_CORRECT.

source: When reading from files using the I<-M> and I<-X> options, setfacl accepts the output getfacl produces. There is at most one ACL entry per line. After a Pound sign (`#'), everything up to the end of the line is treated as a comment.
uk: При читанні даних з файлів, якщо використано параметри I<-M> і I<-X>, setfacl приймає дані, які виведено програмою getfacl. Кількість записів ACL у одному рядку має не перевищувати одного. Усі дані після символу решітки («#»), аж до кінця рядка, вважатимуться коментарем.

source: If setfacl is used on a file system which does not support ACLs, setfacl operates on the file mode permission bits. If the ACL does not fit completely in the permission bits, setfacl modifies the file mode permission bits to reflect the ACL as closely as possible, writes an error message to standard error, and returns with an exit status greater than 0.
uk: Якщо setfacl буде використано для файлової системи, у якій не передбачено підтримки ACL, setfacl працюватиме з бітами режиму доступу до файлів. Якщо повної відповідності ACL бітам прав доступу не вдасться встановити, setfacl видозмінить біти режиму доступу до файлів так, щоб відтворити ACL якомога точніше, запише повідомлення про помилку до стандартного виведення помилок і поверне код виходу, який перевищуватиме 0.

source: The file owner and processes capable of CAP_FOWNER are granted the right to modify ACLs of a file. This is analogous to the permissions required for accessing the file mode. (On current Linux systems, root is the only user with the CAP_FOWNER capability.)
uk: Власнику файла і процесам із можливістю CAP_FOWNER буде надано права для внесення змін до ACL файла. Це аналогічно до прав доступу, які потрібні для доступу до даних щодо режиму доступу до файла. (У поточних системах Linux єдиним користувачем, який має доступ до можливості CAP_FOWNER, є root.)

source: Remove all extended ACL entries. The base ACL entries of the owner, group and others are retained.
uk: Вилучити усі розширені записи ACL. Лишаться лише базові записи ACL щодо власника, груп та інших користувачів.

source: Remove the Default ACL. If no Default ACL exists, no warnings are issued.
uk: Вилучити типовий ACL. Якщо типового ACL не існує, програма не виводитиме попереджень.

source: Do not recalculate the effective rights mask. The default behavior of setfacl is to recalculate the ACL mask entry, unless a mask entry was explicitly given. The mask entry is set to the union of all permissions of the owning group, and all named user and group entries. (These are exactly the entries affected by the mask entry).
uk: Не переобчислювати маску ефективних прав. Типовою поведінкою setfacl є переобчислення запису маски ACL, якщо не вказано явним чином запис маски. Запис маски буде встановлено як об'єднання усіх прав доступу групи-власника і усіх іменованих записів користувачів і груп. (Це саме ті записи, на які впливає запис маски).

source: Do recalculate the effective rights mask, even if an ACL mask entry was explicitly given. (See the I<-n >option.)
uk: Переобчислити маску ефективних прав доступу, навіть якщо запис маски ACL було задано явно. (Див. параметр I<-n>.)

source: All operations apply to the Default ACL. Regular ACL entries in the input set are promoted to Default ACL entries. Default ACL entries in the input set are discarded. (A warning is issued if that happens).
uk: Усі дії буде застосовано до типового ACL. Звичайні записи ACL у вхідному наборі даних буде розширено до типових записів ACL. Записи типових ACL у вхідному наборі даних буде відкинуто. (Якщо таке трапиться, буде виведено попередження.)

source: I<--restore=file>
uk: I<--restore=файл>
