Repository: yurchor/uk-man-firewalld
Catalog: *.po
Languages: uk

source: [B<--permanent>] B<--policy>=I<policy> B<--add-ingress-zone>=I<zone>
uk: [B<--permanent>] B<--policy>=I<правило> B<--add-ingress-zone>=I<зона>

source: Add an ingress zone\&. This option can be specified multiple times\&.
uk: Додати вхідну зону\&. Цей параметр можна вказувати декілька разів у одній команді\&.

source: The ingress zone is one of the firewalld provided zones or one of the pseudo-zones: HOST, ANY\&.
uk: Вхідною зоною є одна із зон, які надає firewalld, або одна з таких псевдозон: HOST, ANY\&.

source: HOST is used for traffic originating from the host machine, i\&.e\&. the host running firewalld\&.
uk: HOST використовують для даних, які походять з основного комп'ютера, тобто комп'ютера, на якому запущено firewalld\&.

source: ANY is used for traffic originating from any zone\&. This can be thought of as a wild card for zones\&. However it does not include traffic originating from the host machine - use HOST for that\&.
uk: ANY використовують для даних з будь-якої зони\&. Це універсальний замінник для зон\&. Втім, сюди не включено дані, що походять з основного комп'ютера — для цих даних слід використовувати HOST\&.

source: [B<--permanent>] B<--policy>=I<policy> B<--remove-ingress-zone>=I<zone>
uk: [B<--permanent>] B<--policy>=I<правило> B<--remove-ingress-zone>=I<зона>

source: Remove an ingress zone\&. This option can be specified multiple times\&.
uk: Вилучити вхідну зону\&. Цей параметр можна вказувати декілька разів у одній команді\&.

source: [B<--permanent>] B<--policy>=I<policy> B<--query-ingress-zone>=I<zone>
uk: [B<--permanent>] B<--policy>=I<правило> B<--query-ingress-zone>=I<зона>

source: Return whether I<zone> has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано зону I<зона>\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] B<--policy>=I<policy> B<--list-egress-zones>
uk: [B<--permanent>] B<--policy>=I<правило> B<--list-egress-zones>

source: List egress zones added as a space separated list\&.
uk: Вивести список доданих вихідних зон як список відокремлених пробілами значень\&.

source: [B<--permanent>] B<--policy>=I<policy> B<--add-egress-zone>=I<zone>
uk: [B<--permanent>] B<--policy>=I<правило> B<--add-egress-zone>=I<зона>

source: Add an egress zone\&. This option can be specified multiple times\&.
uk: Додати вихідну зону\&. Цей параметр можна вказувати декілька разів у одній команді\&.

source: The egress zone is one of the firewalld provided zones or one of the pseudo-zones: HOST, ANY\&.
uk: Вихідною зоною є одна із зон, які надає firewalld, або одна з таких псевдозон: HOST, ANY\&.

source: For clarification on HOST and ANY see option B<--add-ingress-zone>\&.
uk: Пояснення щодо HOST та ANY наведено в описів параметра B<--add-ingress-zone>\&.

source: [B<--permanent>] B<--policy>=I<policy> B<--remove-egress-zone>=I<zone>
uk: [B<--permanent>] B<--policy>=I<правило> B<--remove-egress-zone>=I<зона>

source: Remove an egress zone\&. This option can be specified multiple times\&.
uk: Вилучити вихідну зону\&. Цей параметр можна вказувати декілька разів у одній команді\&.

source: [B<--permanent>] B<--policy>=I<policy> B<--query-egress-zone>=I<zone>
uk: [B<--permanent>] B<--policy>=I<правило> B<--query-egress-zone>=I<зона>

source: Options to Handle Bindings of Interfaces
uk: Параметри обробки прив'язки інтерфейсів

source: Binding an interface to a zone means that this zone settings are used to restrict traffic via the interface\&.
uk: Прив'язка інтерфейсу до зони означає, що параметри цієї зони буде використано для обмеження обміну даними через інтерфейс\&.

source: Options in this section affect only one particular zone\&. If used with B<--zone>=I<zone> option, they affect the zone I<zone>\&. If the option is omitted, they affect default zone (see B<--get-default-zone>)\&.
uk: Параметри з цього розділу стосуються лише одної певної зони\& Якщо їх використано разом із параметром B<--zone>=I<зона>, вони стосуватимуться вказаної зони I<зона>\&. Якщо параметр не вказано, воно стосуватиметься типової зони (див. B<--get-default-zone>)\&.

source: For a list of predefined zones use B<firewall-cmd --get-zones>\&.
uk: Щоб отримати список попередньо визначених зон, скористайтеся командою B<firewall-cmd --get-zones>\&.

source: An interface name is a string up to 16 characters long, that may not contain B<\*(Aq \*(Aq>, B<\*(Aq/\*(Aq>, B<\*(Aq!\*(Aq> and B<\*(Aq*\*(Aq>\&.
uk: Назвою інтерфейсу є рядок до 16 символів у довжину, який не може містити символів B<\*(Aq \*(Aq>, B<\*(Aq/\*(Aq>, B<\*(Aq!\*(Aq> і B<\*(Aq*\*(Aq>\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--list-interfaces>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--list-interfaces>

source: List interfaces that are bound to zone I<zone> as a space separated list\&. If zone is omitted, default zone will be used\&.
uk: Вивести список інтерфейсів, які прив'язано до зони I<зона>, у форматі списку відокремлених пробілами значень\&. Якщо зону пропущено, буде використано типову зону\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--add-interface>=I<interface>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--add-interface>=I<інтерфейс>

source: Bind interface I<interface> to zone I<zone>\&. If zone is omitted, default zone will be used\&.
uk: Прив'язати інтерфейс I<інтерфейс> до зони I<зона>\&. Якщо зону не вказано, буде використано типову зону\&.

source: If the interface is under control of NetworkManager, it is at first connected to change the zone for the connection that is using the interface\&. If this fails, the zone binding is created in firewalld and the limitations below apply\&. For interfaces that are not under control of NetworkManager, firewalld tries to change the ZONE setting in the ifcfg file, if the file exists\&.
uk: Якщо інтерфейсом керує NetworkManager, з ним спочатку буде встановлено зв'язок для зміни зони для з'єднання, яке використовує інтерфейс\&. Якщо встановити зв'язок не вдасться, буде створено прив'язку зони у firewalld і матимуть місце описані нижче обмеження\&. Для інтерфейсів, якими не керує NetworkManager, firewalld спробує змінити параметр ZONE у файлі ifcfg, якщо такий файл існує\&.

source: As a end user you don\*(Aqt need this in most cases, because NetworkManager (or legacy network service) adds interfaces into zones automatically (according to B<ZONE=> option from ifcfg-I<interface> file) if I<NM_CONTROLLED=no> is not set\&. You should do it only if there\*(Aqs no /etc/sysconfig/network-scripts/ifcfg-I<interface> file\&. If there is such file and you add interface to zone with this B<--add-interface> option, make sure the zone is the same in both cases, otherwise the behaviour would be undefined\&. Please also have a look at the B<firewalld>(1) man page in the I<Concepts> section\&. For permanent association of interface with a zone, see also \*(AqHow to set or change a zone for a connection?\*(Aq in B<firewalld.zones>(5)\&.
uk: Вам, як кінцевому користувачеві, у більшості випадків це усе не знадобиться, оскільки NetworkManager (або застаріла служба мережі) додає інтерфейси до зон автоматично (відповідно до параметра B<ZONE=> з файла ifcfg-I<інтерфейс>), якщо не встановлено I<NM_CONTROLLED=no>\&. Вносити зміни слід, лише якщо не існує файла /etc/sysconfig/network-scripts/ifcfg-I<інтерфейс>\&. Якщо такий файл існує і ви додаєте інтерфейс до зони за допомогою цього параметра B<--add-interface>, переконайтеся, що зона є однаковою в обох випадках, щоб забезпечити стійку поведінку системи\&. Будь ласка, також ознайомтеся зі сторінкою підручника щодо B<firewalld>(1), зокрема розділом I<Основні поняття>\&. Щоб постійно прив'язати інтерфейс до зони, також ознайомтеся із розділом \*(AqЯк встановити або змінити зону для з'єднання?\*(Aq на сторінці підручника B<firewalld.zones>(5)\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--change-interface>=I<interface>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--change-interface>=I<інтерфейс>

source: Change zone the interface I<interface> is bound to to zone I<zone>\&. It\*(Aqs basically B<--remove-interface> followed by B<--add-interface>\&. If the interface has not been bound to a zone before, it behaves like B<--add-interface>\&. If zone is omitted, default zone will be used\&.
uk: Змінити зону, до якої прив'язано інтерфейс I<інтерфейс>, на зону I<зона>\&. Це, насправді, B<--remove-interface> з наступним B<--add-interface>\&. Якщо інтерфейс ще не було прив'язано до зони, команда поводиться як B<--add-interface>\&. Якщо не буде вказано зону, програма використає типову зону\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--query-interface>=I<interface>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--query-interface>=I<інтерфейс>

source: Query whether interface I<interface> is bound to zone I<zone>\&. Returns 0 if true, 1 otherwise\&.
uk: Опитати, чи прив'язано інтерфейс I<інтерфейс> до зони I<зона>\&. Повертає 0, якщо прив'язано; 1, якщо не прив'язано\&.

source: [B<--permanent>] B<--remove-interface>=I<interface>
uk: [B<--permanent>] B<--remove-interface>=I<інтерфейс>

source: If the interface is under control of NetworkManager, it is at first connected to change the zone for the connection that is using the interface\&. If this fails, the zone binding is created in firewalld and the limitations below apply\&.
uk: Якщо інтерфейсом керує NetworkManager, програма спочатку встановить з ним зв'язок для зміни зони з'єднання, яке використовує інтерфейс\&. Якщо це не вдасться зробити, буде створено прив'язку до зони у firewalld і матимуть місце вказані нижче обмеження\&.

source: For the addition or change of interfaces that are not under control of NetworkManager: firewalld tries to change the ZONE setting in the ifcfg file, if an ifcfg file exists that is using the interface\&.
uk: Для додавання інтерфейсів або внесення змін до інтерфейсів, якими не керує NetworkManager, буде виконано таку дію: firewalld спробує змінити параметр ZONE у файлі ifcfg, якщо існує файл ifcfg, який використовує інтерфейс\&.

source: Only for the removal of interfaces that are not under control of NetworkManager: firewalld is not trying to change the ZONE setting in the ifcfg file\&. This is needed to make sure that an ifdown of the interface will not result in a reset of the zone setting to the default zone\&. Only the zone binding is then removed in firewalld then\&.
uk: Лише для вилучення інтерфейсів, якими не керує NetworkManager: firewalld не намагатиметься змінити параметр ZONE у файлі ifcfg\&. Так слід вчинити, щоб ifdown для інтерфейсу не привів до скидання параметра зони до типового\&. У цьому випадку буде лише вилучено прив'язку зони у firewalld\&.

source: Remove binding of interface I<interface> from zone it was previously added to\&.
uk: Вилучити прив'язку інтерфейсу I<інтерфейс> з зони, коди її було раніше додано\&.

source: Options to Handle Bindings of Sources
uk: Параметри для обробки прив'язки джерел

source: Binding a source to a zone means that this zone settings will be used to restrict traffic from this source\&.
uk: Прив'язка походження до зони означає, що параметри цієї зони буде використано для обмеження обміну даними з цього походження\&.

source: A source address or address range is either an IP address or a network IP address with a mask for IPv4 or IPv6 or a MAC address or an ipset with the ipset: prefix\&. For IPv4, the mask can be a network mask or a plain number\&. For IPv6 the mask is a plain number\&. The use of host names is not supported\&.
uk: Адресою походження або діапазоном адрес походження є IP-адреса або IP-адреса мережі із маскою для IPv4 або IPv6 чи MAC-адреса або набір ipset з префіксом «ipset:»\&. Для IPv4 мскою може бути маска мережі або просте число\&. Для IPv6 маскою є просте число\&. Підтримки назв вузлів не передбачено\&.

source: For a list of predefined zones use B<firewall-cmd >B<[--permanent>]B< --get-zones>\&.
uk: Щоб отримати список попередньо визначених зон, скористайтеся командою B<firewall-cmd >B<[--permanent>]B< --get-zones>\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--list-sources>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--list-sources>

source: List sources that are bound to zone I<zone> as a space separated list\&. If zone is omitted, default zone will be used\&.
uk: Вивести список походжень, які прив'язано до зони I<зона>, у форматі списку відокремлених пробілами значень\&. Якщо зону пропущено, буде використано типову зону\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--add-source>=I<source>[/I<mask>]|I<MAC>|ipset:I<ipset>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--add-source>=I<джерело>[/I<маска>]|I<MAC>|ipset:I<набір_ip>

source: Bind the source to zone I<zone>\&. If zone is omitted, default zone will be used\&.
uk: Прив'язати походження до зони I<зона>\&. Якщо зону не вказано, буде використано типову зону\&.

source: [B<--zone>=I<zone>] B<--change-source>=I<source>[/I<mask>]|I<MAC>|ipset:I<ipset>
uk: [B<--zone>=I<зона>] B<--change-source>=I<джерело>[/I<маска>]|I<MAC>|ipset:I<набір_ip>

source: Change zone the source is bound to to zone I<zone>\&. It\*(Aqs basically B<--remove-source> followed by B<--add-source>\&. If the source has not been bound to a zone before, it behaves like B<--add-source>\&. If zone is omitted, default zone will be used\&.
uk: Змінити зону, до якої прив'язано походження, на зону I<зона>\&. Це, насправді, B<--remove-source> з наступним B<--add-source>\&. Якщо походження ще не було прив'язано до зони, команда поводиться як B<--add-source>\&. Якщо не буде вказано зону, програма використає типову зону\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--query-source>=I<source>[/I<mask>]|I<MAC>|ipset:I<ipset>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--query-source>=I<джерело>[/I<маска>]|I<MAC>|ipset:I<набір_ip>

source: Query whether the source is bound to the zone I<zone>\&. Returns 0 if true, 1 otherwise\&.
uk: Опитати, чи прив'язано походження до зони I<зона>\&. Повертає 0, якщо прив'язано; 1, якщо не прив'язано\&.

source: [B<--permanent>] B<--remove-source>=I<source>[/I<mask>]|I<MAC>|ipset:I<ipset>
uk: [B<--permanent>] B<--remove-source>=I<джерело>[/I<маска>]|I<MAC>|ipset:I<набір_ip>

source: Remove binding of the source from zone it was previously added to\&.
uk: Вилучити прив'язку походження з зони, коди її було раніше додано\&.

source: IPSet Options
uk: Параметри наборів IP

source: Print the supported ipset types\&.
uk: Вивести підтримувані типи наборів ip\&.

source: B<--permanent> B<--new-ipset>=I<ipset> B<--type>=I<type> [B<--family>=I<inet>|I<inet6>] [B<--option>=I<key>[=I<value>]]
uk: B<--permanent> B<--new-ipset>=I<набір_ip> B<--type>=I<тип> [B<--family>=I<inet>|I<inet6>] [B<--option>=I<ключ>[=I<значення>]]

source: Add a new permanent and empty ipset with specifying the type and optional the family and options like I<timeout>, I<hashsize> and I<maxelem>\&. For more information please have a look at B<ipset>(8) man page\&.
uk: Додати новий постійний і порожній набір ip із визначенням типу і необов'язкового сімейства і параметрів, подібних до I<timeout>, I<hashsize> та I<maxelem>\&. Щоб дізнатися більше, зверніться до сторінки підручника щодо B<ipset>(8)\&.

source: ipset names must be alphanumeric and may additionally include characters: \*(Aq_\*(Aq and \*(Aq-\*(Aq\&.
uk: Набори ip мають складатися з літер і цифр і додатково можуть містити такі символи: \*(Aq-\*(Aq\&.

source: B<--permanent> B<--new-ipset-from-file>=I<filename> [B<--name>=I<ipset>]
uk: B<--permanent> B<--new-ipset-from-file>=I<назва_файла> [B<--name>=I<набір_ip>]

source: Add a new permanent ipset from a prepared ipset file with an optional name override\&.
uk: Додати новий постійний набір ip засіб з приготованого набору ip із необов'язковим перевизначенням назви\&.

source: B<--permanent> B<--delete-ipset>=I<ipset>
uk: B<--permanent> B<--delete-ipset>=I<набір_ip>

source: Delete an existing permanent ipset\&.
uk: Вилучити наявний постійний набір ip\&.

source: B<--permanent> B<--load-ipset-defaults>=I<ipset>
uk: B<--permanent> B<--load-ipset-defaults>=I<набір_ip>

source: Load ipset default settings or report NO_DEFAULTS error\&.
uk: Завантажити типові параметри набору ip або повідомити про помилку NO_DEFAULTS\&.

source: [B<--permanent>] B<--info-ipset=>I<ipset>
uk: [B<--permanent>] B<--info-ipset=>I<набір_ip>

source: Print information about the ipset I<ipset>\&. The output format is:
uk: Вивести відомості щодо набору ip I<набір_ip>\&. Формат виведення є таким:

source: I<ipset> type: I<type> options: I<option1[=value1]> \&.\&. entries: I<entry1> \&.\&.
uk: I<набір_ip> type: I<тип> options: I<параметр1[=значення1]> \&.\&. entries: I<запис1> \&.\&.

source: Print predefined ipsets as a space separated list\&.
uk: Вивести попередньо визначені набори ip у форматі списку відокремлених пробілами значень\&.

source: B<--permanent> B<--ipset>=I<ipset> B<--set-description>=I<description>
uk: B<--permanent> B<--ipset>=I<набір_ip> B<--set-description>=I<опис>

source: Set new description to ipset
uk: Встановити новий опис набору ip

source: B<--permanent> B<--ipset>=I<ipset> B<--get-description>
uk: B<--permanent> B<--ipset>=I<набір_ip> B<--get-description>

source: Print description for ipset
uk: Вивести опис набору ip

source: B<--permanent> B<--ipset>=I<ipset> B<--set-short>=I<description>
uk: B<--permanent> B<--ipset>=I<набір_ip> B<--set-short>=I<опис>

source: Set short description to ipset
uk: Встановити короткий опис набору ip

source: B<--permanent> B<--ipset>=I<ipset> B<--get-short>
uk: B<--permanent> B<--ipset>=I<набір_ip> B<--get-short>

source: Print short description for ipset
uk: Вивести короткий опис набору ip

source: [B<--permanent>] B<--ipset>=I<ipset> B<--add-entry>=I<entry>
uk: [B<--permanent>] B<--ipset>=I<набір_ip> B<--add-entry>=I<запис>

source: Add a new entry to the ipset\&.
uk: Додати новий запис до набору ip\&.

source: Adding an entry to an ipset with option I<timeout> is permitted, but these entries are not tracked by firewalld\&.
uk: Дозволено додавання запису до набору ipset за допомогою параметра I<timeout>, але firewalld не виконуватиме спостереження за такими записами\&.

source: [B<--permanent>] B<--ipset>=I<ipset> B<--remove-entry>=I<entry>
uk: [B<--permanent>] B<--ipset>=I<набір_ip> B<--remove-entry>=I<запис>

source: Remove an entry from the ipset\&.
uk: Вилучити запис із набору ip\&.

source: [B<--permanent>] B<--ipset>=I<ipset> B<--query-entry>=I<entry>
uk: [B<--permanent>] B<--ipset>=I<набір_ip> B<--query-entry>=I<запис>

source: Return whether the entry has been added to an ipset\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано запис до набору ip\&. Повертає 0, якщо було, і 1, якщо не було\&.

source: Querying an ipset with a timeout will yield an error\&. Entries are not tracked for ipsets with a timeout\&.
uk: Опитування набору ipset зі встановленим часом очікування призведе до помилки\&. Для наборів ip з часами очікування стеження за записами не відбуватиметься\&.

source: [B<--permanent>] B<--ipset>=I<ipset> B<--get-entries>
uk: [B<--permanent>] B<--ipset>=I<набір_ip> B<--get-entries>

source: List all entries of the ipset\&.
uk: Вивести список усіх записів у наборі ip\&.

source: [B<--permanent>] B<--ipset>=I<ipset> B<--add-entries-from-file>=I<filename>
uk: [B<--permanent>] B<--ipset>=I<набір_ip> B<--add-entries-from-file>=I<назва_файла>

source: Add a new entries to the ipset from the file\&. For all entries that are listed in the file but already in the ipset, a warning will be printed\&.
uk: Додати нові записи до набору ip з файла\&. Для усіх записів, які є у списку файла, але які вже є у наборі ip, буде виведено попередження\&.

source: The file should contain an entry per line\&. Lines starting with an hash or semicolon are ignored\&. Also empty lines\&.
uk: Файл має містити по одному запису на рядок\&. Рядки, які починаються з символу решітки або крапки з комою, буде проігноровано\&. Також буде проігноровано порожні рядки\&.

source: [B<--permanent>] B<--ipset>=I<ipset> B<--remove-entries-from-file>=I<filename>
uk: [B<--permanent>] B<--ipset>=I<набір_ip> B<--remove-entries-from-file>=I<назва_файла>

source: Remove existing entries from the ipset from the file\&. For all entries that are listed in the file but not in the ipset, a warning will be printed\&.
uk: Вилучити наявні записи з набору ip з файла\&. Для усіх записів, які є у списку файла, але яких немає у наборі ip, буде виведено попередження\&.

source: B<--permanent> B<--path-ipset=>I<ipset>
uk: B<--permanent> B<--path-ipset=>I<набір_ip>

source: Print path of the ipset configuration file\&.
uk: Вивести шлях до файла налаштувань набору ip\&.

source: Service Options
uk: Параметри служби

source: Options in this section affect only one particular service\&.
uk: Параметри у цьому розділі стосуються лише однієї окремої служби\&.

source: [B<--permanent>] B<--info-service=>I<service>
uk: [B<--permanent>] B<--info-service=>I<служба>

source: Print information about the service I<service>\&. The output format is:
uk: Вивести відомості щодо служби I<служба>\&. Формат виведення є таким:

source: I<service> ports: I<port1> \&.\&. protocols: I<protocol1> \&.\&. source-ports: I<source-port1> \&.\&. helpers: I<helper1> \&.\&. destination: I<ipv1>:I<address1> \&.\&.
uk: I<служба> ports: I<порт1> \&.\&. protocols: I<протокол1> \&.\&. source-ports: I<порт_походження1> \&.\&. helpers: I<допоміжний_засіб1> \&.\&. destination: I<ipv1>:I<адреса1> \&.\&.

source: The following options are only usable in the permanent configuration\&.
uk: Наведеними нижче параметрами можна користуватися лише для постійних налаштувань\&.

source: B<--permanent> B<--new-service>=I<service>
uk: B<--permanent> B<--new-service>=I<служба>

source: Add a new permanent and empty service\&.
uk: Додати новий постійний і порожній запис служби\&.

source: Service names must be alphanumeric and may additionally include characters: \*(Aq_\*(Aq and \*(Aq-\*(Aq\&.
uk: Назви служб мають складатися з літер і цифр і додатково можуть містити такі символи: \*(Aq-\*(Aq\&.

source: B<--permanent> B<--new-service-from-file>=I<filename> [B<--name>=I<service>]
uk: B<--permanent> B<--new-service-from-file>=I<назва_файла> [B<--name>=I<служба>]

source: Add a new permanent service from a prepared service file with an optional name override\&.
uk: Додати новий постійну службу з приготованої служби із необов'язковим перевизначенням назви\&.

source: B<--permanent> B<--delete-service>=I<service>
uk: B<--permanent> B<--delete-service>=I<служба>

source: Delete an existing permanent service\&.
uk: Вилучити наявну постійну службу\&.

source: B<--permanent> B<--load-service-defaults>=I<service>
uk: B<--permanent> B<--load-service-defaults>=I<служба>

source: Load service default settings or report NO_DEFAULTS error\&.
uk: Завантажити типові параметри служби або повідомити про помилку NO_DEFAULTS\&.

source: B<--permanent> B<--path-service=>I<service>
uk: B<--permanent> B<--path-service=>I<служба>

source: Print path of the service configuration file\&.
uk: Вивести шлях до файла налаштувань служби\&.

source: B<--permanent> B<--service>=I<service> B<--set-description>=I<description>
uk: B<--permanent> B<--service>=I<служба> B<--set-description>=I<опис>

source: Set new description to service
uk: Встановити новий опис служби

source: B<--permanent> B<--service>=I<service> B<--get-description>
uk: B<--permanent> B<--service>=I<служба> B<--get-description>

source: Print description for service
uk: Вивести опис служби

source: B<--permanent> B<--service>=I<service> B<--set-short>=I<description>
uk: B<--permanent> B<--service>=I<служба> B<--set-short>=I<опис>

source: Set short description to service
uk: Встановити короткий опис служби

source: B<--permanent> B<--service>=I<service> B<--get-short>
uk: B<--permanent> B<--service>=I<служба> B<--get-short>

source: Print short description for service
uk: Вивести короткий опис служби
