Repository: yurchor/uk-man-firewalld
Catalog: *.po
Languages: uk

source: Restore a permission backup created by `getfacl -R' or similar. All permissions of a complete directory subtree are restored using this mechanism. If the input contains owner comments or group comments, setfacl attempts to restore the owner and owning group. If the input contains flags comments (which define the setuid, setgid, and sticky bits), setfacl sets those three bits accordingly; otherwise, it clears them. This option cannot be mixed with other options except `--test'.
uk: Відновити резервну копію прав доступу, яку створено «getfacl -R» або подібною командою. Усі права доступу повного піддерева каталогів буде відновлено за допомогою цього механізму. Якщо вхідні дані містять коментарі щодо власника або коментарі щодо групи, setfacl спробує відновити дані щодо користувача-власника і групи-власника. Якщо у вхідних даних містяться коментарі щодо прапорців (яків визначають біти setuid, setgid і липкий біт), setfacl встановить значення цих трьох бітів за коментарями. Якщо таких коментарів виявлено не буде, біти буде очищено. Цей параметр не можна використовувати у поєднанні з іншими параметрами, окрім параметра «--test».

source: Test mode. Instead of changing the ACLs of any files, the resulting ACLs are listed.
uk: Режим тестування. Замість внесення змін до ACL якихось файлів, буде просто виведено список ACL результатів можливого виконання команди.

source: Apply operations to all files and directories recursively. This option cannot be mixed with `--restore'.
uk: Застосувати дії до усіх файлів та каталогів рекурсивно. Цей параметр не можна поєднувати з параметром «--restore».

source: Logical walk, follow symbolic links to directories. The default behavior is to follow symbolic link arguments, and skip symbolic links encountered in subdirectories. Only effective in combination with -R. This option cannot be mixed with `--restore'.
uk: Логічний обхід з переходом за символічними посиланнями на каталоги. Типовою поведінкою є перехід за аргументами символічних посилань і пропускання символічних посилань у підкаталогах. Працює лише у поєднанні з -R. Цей параметр не можна поєднувати з параметром «--restore».

source: Physical walk, do not follow symbolic links to directories. This also skips symbolic link arguments. Only effective in combination with -R. This option cannot be mixed with `--restore'.
uk: Фізичний обхід без переходу за символічними посиланнями на каталоги. У результаті також буде пропущено аргументи символічних посилань. Працює лише у поєднанні з -R. Цей параметр не можна поєднувати з параметром «--restore».

source: Print the version of setfacl and exit.
uk: Вивести дані щодо версії setfacl і завершити роботу.

source: End of command line options. All remaining parameters are interpreted as file names, even if they start with a dash.
uk: Кінець параметрів командного рядка. Решта параметрів вважатиметься назвами файлів, навіть якщо вони починаються із символу дефіса.

source: If the file name parameter is a single dash, setfacl reads a list of files from standard input.
uk: Якщо параметр назви файла є одинарним символом дефіса, setfacl читає список файлів зі стандартного джерела вхідних даних.

source: ACL ENTRIES
uk: ЗАПИСИ ACL

source: The setfacl utility recognizes the following ACL entry formats (blanks inserted for clarity):
uk: У програмі setfacl передбачено розпізнавання таких форматів записів ACL (пробіли вставлено для зручності):

source: [d[efault]:] [u[ser]:]I<uid >[:I<perms>]
uk: [d[efault]:] [u[ser]:]I<uid >[:I<права_доступу>]

source: Permissions of a named user. Permissions of the file owner if I<uid> is empty.
uk: Права доступу іменованого користувача. Права доступу власника файла, якщо I<uid> є порожнім.

source: [d[efault]:] g[roup]:I<gid >[:I<perms>]
uk: [d[efault]:] g[roup]:I<gid >[:I<права_доступу>]

source: Permissions of a named group. Permissions of the owning group if I<gid> is empty.
uk: Права доступу іменованої групи. Права доступу групи-власника, якщо I<gid> є порожнім.

source: [d[efault]:] m[ask][:] [:I<perms>]
uk: [d[efault]:] m[ask][:] [:I<права_доступу>]

source: Effective rights mask
uk: Маска ефективних прав

source: [d[efault]:] o[ther][:] [:I<perms>]
uk: [d[efault]:] o[ther][:] [:I<права_доступу>]

source: Permissions of others.
uk: Права доступу інших.

source: Whitespace between delimiter characters and non-delimiter characters is ignored.
uk: Пробіли між символами-роздільниками і символами, які не є роздільниками, буде проігноровано.

source: Proper ACL entries including permissions are used in modify and set operations. (options I<-m>, I<-M>, I<--set> and I<--set-file>). Entries without the I<perms> field are used for I<deletion> of entries (options I<-x> and I<-X>).
uk: Належні записи ACL, включно з правами доступу, буде використано у діях зі зміни та встановлення прав доступу (параметри I<-m>, I<-M>, I<--set> і I<--set-file>). Записи без поля I<права_доступу> буде використано для I<вилучення> записів (параметри I<-x> і I<-X>).

source: For I<uid> and I<gid> you can specify either a name or a number. Character literals may be specified with a backslash followed by the 3-digit octal digits corresponding to the ASCII code for the character (e.g., I<\e101> for 'A'). If the name contains a literal backslash followed by 3 digits, the backslash must be escaped (i.e., I<\e\e>).
uk: Для I<uid> і I<gid> ви можете вказати назву або число. Символьні літерали можна вказувати за допомогою символу зворотної похилої риски із наступним 3-цифровим вісімковим значенням, яке відповідають коду ASCII символу (наприклад, I<\e101> — це «A»). Якщо у назві міститься сам символ зворотної похилої риски із трьома наступними цифрами, символ зворотної похилої риски слід екранувати (тобто, I<\e\e>).

source: The I<perms> field is a combination of characters that indicate the read I<(r)>, write I<(w)>, execute I<(x)> permissions. Dash characters in the I<perms> field I<(-)> are ignored. The character I<X> stands for the execute permission if the file is a directory or already has execute permission for some user. Alternatively, the I<perms> field can define the permissions numerically, as a bit-wise combination of read I<(4)>, write I<(2)>, and execute I<(1)>. Zero I<perms> fields or I<perms> fields that only consist of dashes indicate no permissions.
uk: Поле I<права_доступу> є комбінацією символів, які позначають права доступу до читання I<(r)>, записування I<(w)>, виконання I<(x)>. Символи дефіса у полі I<права_доступу>, I<(-)>, буде проігноровано. Символ I<X> позначає права доступу для виконання, якщо файл є каталогом або вже має права доступу для виконання для іншого користувача. Крім того, у полі I<права_доступу> права доступу можна визначати у числовій формі, як побітове поєднання значень читання I<(4)>, записування I<(2)> та виконання I<(1)>. Нульове значення у полі I<права_доступу> або поля I<права_доступу>, що складаються лише з дефісів, означають те, що відповідних прав доступу немає.

source: AUTOMATICALLY CREATED ENTRIES
uk: ЗАПИСИ, ЯКІ СТВОРЕНО АВТОМАТИЧНО

source: Initially, files and directories contain only the three base ACL entries for the owner, the group, and others. There are some rules that need to be satisfied in order for an ACL to be valid:
uk: Спочатку, записи файлів і каталогів містять лише три базових записи ACL щодо власника, групи та доступу інших користувачів. Передбачено певні правила, які має бути виконано, щоб запис ACL був коректним:

source: The three base entries cannot be removed. There must be exactly one entry of each of these base entry types.
uk: Три базових записи не можна вилучати. Має бути точно один запис для кожного з цих базових типів записів.

source: Whenever an ACL contains named user entries or named group objects, it must also contain an effective rights mask.
uk: Якщо ACL містить іменовані записи користувачів або іменовані об'єкти груп, він також має містити маску ефективних прав доступу.

source: Whenever an ACL contains any Default ACL entries, the three Default ACL base entries (default owner, default group, and default others) must also exist.
uk: Якщо ACL містить записи типового ACL, також мають існувати три базових записи ACL (права для типового власника, типової групи та інших користувачів).

source: Whenever a Default ACL contains named user entries or named group objects, it must also contain a default effective rights mask.
uk: Якщо типовий ACL містить іменовані записи користувачів або іменовані об'єкти груп, він також має містити типову маску ефективних прав доступу.

source: To help the user ensure these rules, setfacl creates entries from existing entries under the following conditions:
uk: Щоб допомогти користувачеві у виконанні цих правил, setfacl створює записи на основі наявних записів за таких умов:

source: If an ACL contains named user or named group entries, and no mask entry exists, a mask entry containing the same permissions as the group entry is created. Unless the I<-n> option is given, the permissions of the mask entry are further adjusted to include the union of all permissions affected by the mask entry. (See the I<-n> option description).
uk: Якщо ACL містить іменовані записи користувача або іменовані записи груп, і немає запису маски, буде створено запис маски, що міститиме ті самі права доступу, що і запис групи. Якщо не вказано параметр I<-n>, права доступу запису маски буде скориговано так, щоб включити об'єднання усіх прав доступу, яких стосується запис маски. Див. опис параметра I<-n>.

source: If a Default ACL entry is created, and the Default ACL contains no owner, owning group, or others entry, a copy of the ACL owner, owning group, or others entry is added to the Default ACL.
uk: Якщо буде створено запис типового ACL, і типовий ACL не містить прав доступу для власника, групи власника та інших користувачів, до типового ACL буде додано запис власника ACL, групи власника ACL або запис інших користувачів ACL.

source: If a Default ACL contains named user entries or named group entries, and no mask entry exists, a mask entry containing the same permissions as the default Default ACL's group entry is added. Unless the I<-n> option is given, the permissions of the mask entry are further adjusted to include the union of all permissions affected by the mask entry. (See the I<-n> option description).
uk: Якщо типовий ACL містить іменовані записи користувача або іменовані записи груп, і немає запису маски, буде додано запис маски, що міститиме ті самі права доступу, що і типовий запис групи типового ACL. Якщо не вказано параметр I<-n>, права доступу запису маски буде скориговано так, щоб включити об'єднання усіх прав доступу, яких стосується запис маски. Див. опис параметра I<-n>.

source: Granting an additional user read access
uk: Надання додаткових прав доступу до читання користувачем

source: setfacl -m u:lisa:r file
uk: setfacl -m u:lisa:r файл

source: Revoking write access from all groups and all named users (using the effective rights mask)
uk: Відкликання доступу до запису для усіх груп і усіх іменованих користувачів (за допомогою маски ефективних прав)

source: setfacl -m m::rx file
uk: setfacl -m m::rx файл

source: Removing a named group entry from a file's ACL
uk: Вилучення іменованого запису групи з ACL файла

source: setfacl -x g:staff file
uk: setfacl -x g:staff файл

source: Copying the ACL of one file to another
uk: Копіювання ACL одного файла до іншого

source: getfacl file1 | setfacl --set-file=- file2
uk: getfacl файл1 | setfacl --set-file=- файл2

source: Copying the access ACL into the Default ACL
uk: Копіювання ACL доступу до типового ACL

source: getfacl --access dir | setfacl -d -M- dir
uk: getfacl --access каталог | setfacl -d -M- каталог

source: If the environment variable POSIXLY_CORRECT is defined, the default behavior of setfacl changes as follows: All non-standard options are disabled. The ``default:'' prefix is disabled. The I<-x> and I<-X> options also accept permission fields (and ignore them).
uk: Якщо визначено змінну середовища POSIXLY_CORRECT, типову поведінку setfacl буде змінено таким чином: усі нестандартні параметри буде вимкнено. Префікс ``default:'' буде вимкнено. Параметри I<-x> і I<-X> прийматимуть поля прав доступу (і ігноруватимуть їх).

source: Please send your bug reports, suggested features and comments to the above address.
uk: Будь ласка, надсилайте ваші звіти про вади, пропозиції можливостей та коментарі на вказану вище адресу.
