Repository: yurchor/uk-man-firewalld
Catalog: *.po
Languages: uk

source: B<--permanent> B<--service>=I<service> B<--add-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--add-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Add a new port to the permanent service\&.
uk: Додати новий порт до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--remove-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--remove-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Remove a port from the permanent service\&.
uk: Вилучити порт з постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--query-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--query-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Return whether the port has been added to the permanent service\&.
uk: Повернути, чи було додано порт до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--get-ports>
uk: B<--permanent> B<--service>=I<служба> B<--get-ports>

source: List ports added to the permanent service\&.
uk: Вивести список портів, які додано до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--add-protocol>=I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--add-protocol>=I<протокол>

source: Add a new protocol to the permanent service\&.
uk: Додати новий протокол до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--remove-protocol>=I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--remove-protocol>=I<протокол>

source: Remove a protocol from the permanent service\&.
uk: Вилучити протокол з постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--query-protocol>=I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--query-protocol>=I<протокол>

source: Return whether the protocol has been added to the permanent service\&.
uk: Повернути, чи було додано протокол до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--get-protocols>
uk: B<--permanent> B<--service>=I<служба> B<--get-protocols>

source: List protocols added to the permanent service\&.
uk: Вивести список протоколів, які додано до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--add-source-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--add-source-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Add a new source port to the permanent service\&.
uk: Додати новий порт походження до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--remove-source-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--remove-source-port>=I<іденти>[-I<ідентифікатор_порту>]/I<протокол>

source: Remove a source port from the permanent service\&.
uk: Вилучити порт походження з постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--query-source-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--service>=I<служба> B<--query-source-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Return whether the source port has been added to the permanent service\&.
uk: Повернути, чи було додано порт походження до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--get-source-ports>
uk: B<--permanent> B<--service>=I<служба> B<--get-source-ports>

source: List source ports added to the permanent service\&.
uk: Вивести список портів походження, які додано до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--add-helper>=I<helper>
uk: B<--permanent> B<--service>=I<служба> B<--add-helper>=I<допоміжний_засіб>

source: Add a new helper to the permanent service\&.
uk: Додати новий допоміжний засіб до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--remove-helper>=I<helper>
uk: B<--permanent> B<--service>=I<служба> B<--remove-helper>=I<допоміжний_засіб>

source: Remove a helper from the permanent service\&.
uk: Вилучити допоміжний засіб з постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--query-helper>=I<helper>
uk: B<--permanent> B<--service>=I<служба> B<--query-helper>=I<допоміжний_засіб>

source: Return whether the helper has been added to the permanent service\&.
uk: Повернути, чи було додано допоміжний засіб до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--get-service-helpers>
uk: B<--permanent> B<--service>=I<служба> B<--get-service-helpers>

source: List helpers added to the permanent service\&.
uk: Вивести список допоміжних засобів, які додано до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--set-destination>=I<ipv>:I<address>[/I<mask>]
uk: B<--permanent> B<--service>=I<служба> B<--set-destination>=I<ipv>:I<адреса>[/I<маска>]

source: Set destination for ipv to address[/mask] in the permanent service\&.
uk: Встановити призначення для ipv у адресу[/маску] в постійній службі\&.

source: B<--permanent> B<--service>=I<service> B<--remove-destination>=I<ipv>
uk: B<--permanent> B<--service>=I<служба> B<--remove-destination>=I<ipv>

source: Remove the destination for ipv from the permanent service\&.
uk: Вилучити призначення для версії протоколу з постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--query-destination>=I<ipv>:I<address>[/I<mask>]
uk: B<--permanent> B<--service>=I<служба> B<--query-destination>=I<ipv>:I<адреса>[/I<маска>]

source: Return whether the destination ipv to address[/mask] has been set in the permanent service\&.
uk: Повернути, чи було встановлено версію протоколу призначення у адресу[/маску] в постійній службі\&.

source: B<--permanent> B<--service>=I<service> B<--get-destinations>
uk: B<--permanent> B<--service>=I<служба> B<--get-destinations>

source: List destinations added to the permanent service\&.
uk: Вивести список призначень, які додано до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--add-include>=I<service>
uk: B<--permanent> B<--service>=I<служба> B<--add-include>=I<служба>

source: Add a new include to the permanent service\&.
uk: Додати нове включення до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--remove-include>=I<service>
uk: B<--permanent> B<--service>=I<служба> B<--remove-include>=I<служба>

source: Remove a include from the permanent service\&.
uk: Вилучити включення з постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--query-include>=I<service>
uk: B<--permanent> B<--service>=I<служба> B<--query-include>=I<служба>

source: Return whether the include has been added to the permanent service\&.
uk: Повернути, чи було додано включення до постійної служби\&.

source: B<--permanent> B<--service>=I<service> B<--get-includes>
uk: B<--permanent> B<--service>=I<служба> B<--get-includes>

source: List includes added to the permanent service\&.
uk: Вивести список включень, які додано до постійної служби\&.

source: Helper Options
uk: Параметри допоміжного засобу

source: Options in this section affect only one particular helper\&.
uk: Параметри у цьому розділі стосуються лише одного окремого допоміжного засобу\&.

source: [B<--permanent>] B<--info-helper=>I<helper>
uk: [B<--permanent>] B<--info-helper=>I<допоміжний_засіб>

source: Print information about the helper I<helper>\&. The output format is:
uk: Вивести відомості щодо допоміжного засобу I<допоміжний_засіб>\&. Формат виведення є таким:

source: I<helper> family: I<family> module: I<module> ports: I<port1> \&.\&.
uk: I<допоміжний_засіб> family: I<сімейство> module: I<модуль> ports: I<порт1> \&.\&.

source: B<--permanent> B<--new-helper>=I<helper> B<--module>=I<nf_conntrack_module> [B<--family>=I<ipv4>|I<ipv6>]
uk: B<--permanent> B<--new-helper>=I<допоміжний_засіб> B<--module>=I<модуль_conntrack_nf> [B<--family>=I<ipv4>|I<ipv6>]

source: Add a new permanent helper with module and optionally family defined\&.
uk: Додати постійний допоміжний засіб із визначенням модуля та, необов'язково, сімейства\&.

source: Helper names must be alphanumeric and may additionally include characters: \*(Aq-\*(Aq\&.
uk: Назви допоміжних засобів мають складатися з літер і цифр і додатково можуть містити такі символи: \*(Aq-\*(Aq\&.

source: B<--permanent> B<--new-helper-from-file>=I<filename> [B<--name>=I<helper>]
uk: B<--permanent> B<--new-helper-from-file>=I<назва_файла> [B<--name>=I<допоміжний_засіб>]

source: Add a new permanent helper from a prepared helper file with an optional name override\&.
uk: Додати новий постійний допоміжний засіб з приготованого допоміжного файла із необов'язковим перевизначенням назви\&.

source: B<--permanent> B<--delete-helper>=I<helper>
uk: B<--permanent> B<--delete-helper>=I<допоміжний_засіб>

source: Delete an existing permanent helper\&.
uk: Вилучити наявний постійний допоміжний засіб\&.

source: B<--permanent> B<--load-helper-defaults>=I<helper>
uk: B<--permanent> B<--load-helper-defaults>=I<допоміжний_засіб>

source: Load helper default settings or report NO_DEFAULTS error\&.
uk: Завантажити типові параметри допоміжного засобу або повідомити про помилку NO_DEFAULTS\&.

source: B<--permanent> B<--path-helper=>I<helper>
uk: B<--permanent> B<--path-helper=>I<допоміжний_засіб>

source: Print path of the helper configuration file\&.
uk: Вивести шлях до файла налаштувань допоміжного засобу\&.

source: Print predefined helpers as a space separated list\&.
uk: Вивести попередньо визначені допоміжні засоби у форматі списку відокремлених пробілами значень\&.

source: B<--permanent> B<--helper>=I<helper> B<--set-description>=I<description>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--set-description>=I<опис>

source: Set new description to helper
uk: Встановити новий опис допоміжного засобу

source: B<--permanent> B<--helper>=I<helper> B<--get-description>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--get-description>

source: Print description for helper
uk: Вивести опис допоміжного засобу

source: B<--permanent> B<--helper>=I<helper> B<--set-short>=I<description>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--set-short>=I<опис>

source: Set short description to helper
uk: Встановити короткий опис допоміжного засобу

source: B<--permanent> B<--helper>=I<helper> B<--get-short>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--get-short>

source: Print short description for helper
uk: Вивести короткий опис допоміжного засобу

source: B<--permanent> B<--helper>=I<helper> B<--add-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--add-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Add a new port to the permanent helper\&.
uk: Додати новий порт до постійного допоміжного засобу\&.

source: B<--permanent> B<--helper>=I<helper> B<--remove-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--remove-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Remove a port from the permanent helper\&.
uk: Вилучити порт з постійного допоміжного засобу\&.

source: B<--permanent> B<--helper>=I<helper> B<--query-port>=I<portid>[-I<portid>]/I<protocol>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--query-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Return whether the port has been added to the permanent helper\&.
uk: Повернути, чи було додано порт до постійного допоміжного засобу\&.

source: B<--permanent> B<--helper>=I<helper> B<--get-ports>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--get-ports>

source: List ports added to the permanent helper\&.
uk: Вивести список портів, які додано до постійного допоміжного засобу\&.

source: B<--permanent> B<--helper>=I<helper> B<--set-module>=I<description>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--set-module>=I<опис>

source: Set module description for helper
uk: Встановити опис модуля для допоміжного засобу

source: B<--permanent> B<--helper>=I<helper> B<--get-module>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--get-module>

source: Print module description for helper
uk: Вивести опис модуля допоміжного засобу

source: B<--permanent> B<--helper>=I<helper> B<--set-family>=I<description>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--set-family>=I<опис>

source: Set family description for helper
uk: Встановити опис сімейства для допоміжного засобу

source: B<--permanent> B<--helper>=I<helper> B<--get-family>
uk: B<--permanent> B<--helper>=I<допоміжний_засіб> B<--get-family>

source: Print family description of helper
uk: Вивести опис сімейства допоміжного засобу

source: Internet Control Message Protocol (ICMP) type Options
uk: Параметри типу Internet Control Message Protocol (ICMP)

source: Options in this section affect only one particular icmptype\&.
uk: Параметри у цьому розділі стосуються лише одного окремого типу ICMP\&.

source: [B<--permanent>] B<--info-icmptype=>I<icmptype>
uk: [B<--permanent>] B<--info-icmptype=>I<тип_icmp>

source: Print information about the icmptype I<icmptype>\&. The output format is:
uk: Вивести відомості щодо типу ICMP I<тип_icmp>\&. Формат виведення є таким:

source: I<icmptype> destination: I<ipv1> \&.\&.
uk: I<тип_icmp> призначення: I<ipv1> \&.\&.

source: B<--permanent> B<--new-icmptype>=I<icmptype>
uk: B<--permanent> B<--new-icmptype>=I<тип_icmp>

source: Add a new permanent and empty icmptype\&.
uk: Додати новий постійний і порожній тип ICMP\&.

source: ICMP type names must be alphanumeric and may additionally include characters: \*(Aq_\*(Aq and \*(Aq-\*(Aq\&.
uk: Назви типів ICMP мають складатися з літер і цифр і додатково можуть містити такі символи: \*(Aq-\*(Aq\&.

source: B<--permanent> B<--new-icmptype-from-file>=I<filename> [B<--name>=I<icmptype>]
uk: B<--permanent> B<--new-icmptype-from-file>=I<назва_файла> [B<--name>=I<тип_icmp>]

source: Add a new permanent icmptype from a prepared icmptype file with an optional name override\&.
uk: Додати новий постійний тип ICMP з приготованого типу ICMP із необов'язковим перевизначенням назви\&.

source: B<--permanent> B<--delete-icmptype>=I<icmptype>
uk: B<--permanent> B<--delete-icmptype>=I<тип_icmp>

source: Delete an existing permanent icmptype\&.
uk: Вилучити наявний постійний тип ICMP\&.

source: B<--permanent> B<--load-icmptype-defaults>=I<icmptype>
uk: B<--permanent> B<--load-icmptype-defaults>=I<тип_icmp>

source: Load icmptype default settings or report NO_DEFAULTS error\&.
uk: Завантажити типові параметри типу ICMP або повідомити про помилку NO_DEFAULTS\&.

source: B<--permanent> B<--icmptype>=I<icmptype> B<--set-description>=I<description>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--set-description>=I<опси>

source: Set new description to icmptype
uk: Встановити новий опис типу ICMP

source: B<--permanent> B<--icmptype>=I<icmptype> B<--get-description>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--get-description>

source: Print description for icmptype
uk: Вивести опис типу ICMP

source: B<--permanent> B<--icmptype>=I<icmptype> B<--set-short>=I<description>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--set-short>=I<опис>

source: Set short description to icmptype
uk: Встановити короткий опис типу ICMP

source: B<--permanent> B<--icmptype>=I<icmptype> B<--get-short>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--get-short>

source: Print short description for icmptype
uk: Вивести короткий опис типу ICMP

source: B<--permanent> B<--icmptype>=I<icmptype> B<--add-destination>=I<ipv>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--add-destination>=I<ipv>

source: Enable destination for ipv in permanent icmptype\&. ipv is one of I<ipv4> or I<ipv6>\&.
uk: Увімкнути призначення для ipv у постійному типі ICMP\&. ipv є одним з таких значень: I<ipv4> або I<ipv6>\&.

source: B<--permanent> B<--icmptype>=I<icmptype> B<--remove-destination>=I<ipv>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--remove-destination>=I<ipv>

source: Disable destination for ipv in permanent icmptype\&. ipv is one of I<ipv4> or I<ipv6>\&.
uk: Вимкнути призначення для ipv у постійному типі ICMP\&. ipv є одним з таких значень: I<ipv4> або I<ipv6>\&.

source: B<--permanent> B<--icmptype>=I<icmptype> B<--query-destination>=I<ipv>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--query-destination>=I<ipv>

source: Return whether destination for ipv is enabled in permanent icmptype\&. ipv is one of I<ipv4> or I<ipv6>\&.
uk: Повернути, чи призначення для ipv увімкнено у постійному типі ICMP\&. ipv є одним з таких значень: I<ipv4> або I<ipv6>\&.

source: B<--permanent> B<--icmptype>=I<icmptype> B<--get-destinations>
uk: B<--permanent> B<--icmptype>=I<тип_icmp> B<--get-destinations>

source: List destinations in permanent icmptype\&.
uk: Вивести список призначень у постійному типі ICMP\&.

source: B<--permanent> B<--path-icmptype=>I<icmptype>
uk: B<--permanent> B<--path-icmptype=>I<тип_icmp>

source: Print path of the icmptype configuration file\&.
uk: Вивести шлях до файла налаштувань типу ICMP\&.

source: Direct Options
uk: Параметри безпосереднього інтерфейсу

source: B<DEPRECATED>
uk: B<ЗАСТАРІЛЕ>

source: The direct interface has been deprecated\&. It will be removed in a future release\&. It is superseded by policies, see B<firewalld.policies>(5)\&.
uk: Безпосередній інтерфейс вважається застарілим\&. Його буде вилучено у майбутніх випусках\&. Його наступником стали правила, див. B<firewalld.policies>(5)\&.

source: The direct options give a more direct access to the firewall\&. These options require user to know basic iptables concepts, i\&.e\&. I<table> (filter/mangle/nat/\&.\&.\&.), I<chain> (INPUT/OUTPUT/FORWARD/\&.\&.\&.), I<commands> (-A/-D/-I/\&.\&.\&.), I<parameters> (-p/-s/-d/-j/\&.\&.\&.) and I<targets> (ACCEPT/DROP/REJECT/\&.\&.\&.)\&.
uk: Параметри безпосереднього керування надають безпосередніший доступ до брандмауера\&. Для користування цими параметрами користувач має бути ознайомлений із базовими поняттями iptables, тобто поняттями I<таблиця> (filter/mangle/nat/\&.\&.\&.), I<ланцюжок> (INPUT/OUTPUT/FORWARD/\&.\&.\&.), I<команда> (-A/-D/-I/\&.\&.\&.), I<параметр> (-p/-s/-d/-j/\&.\&.\&.) і I<призначення> (ACCEPT/DROP/REJECT/\&.\&.\&.)\&.

source: Direct options should be used only as a last resort when it\*(Aqs not possible to use for example B<--add-service>=I<service> or B<--add-rich-rule>=\*(AqI<rule>\*(Aq\&.
uk: Параметрами безпосереднього керування слід користуватися лише як останнім виходом, якщо не вдається скористатися, наприклад, B<--add-service>=I<служба> або B<--add-rich-rule>=\*(AqI<правило>\*(Aq\&.

source: B<Warning>: Direct rules behavior is different depending on the value of I<FirewallBackend>\&. See I<CAVEATS> in B<firewalld.direct>(5)\&.
uk: B<Попередження>: поведінка правил є різною для різних значень I<FirewallBackend>\&. Див. I<ЗАСТЕРЕЖЕННЯ> на сторінці підручника B<firewalld.direct>(5)\&.

source: The first argument of each option has to be I<ipv4> or I<ipv6> or I<eb>\&. With I<ipv4> it will be for IPv4 (B<iptables>(8)), with I<ipv6> for IPv6 (B<ip6tables>(8)) and with I<eb> for ethernet bridges (B<ebtables>(8))\&.
uk: Першим аргументом кожного параметра має бути I<ipv4>, I<ipv6> або I<eb>\&. З I<ipv4> це буде IPv4 (B<iptables>(8)), з I<ipv6> — IPv6 (B<ip6tables>(8)), а з I<eb> — ethernet-містки (B<ebtables>(8))\&.

source: Get all chains added to all tables\&. This option concerns only chains previously added with B<--direct --add-chain>\&.
uk: Отримати усі ланцюжки, які додано до усіх таблиць\&. Цей параметр стосується лише ланцюжків, які раніше було додано за допомогою B<--direct --add-chain>\&.

source: [B<--permanent>] B<--direct> B<--get-chains> { I<ipv4> | I<ipv6> | I<eb> } I<table>
uk: [B<--permanent>] B<--direct> B<--get-chains> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця>

source: Get all chains added to table I<table> as a space separated list\&. This option concerns only chains previously added with B<--direct --add-chain>\&.
uk: Отримати усі ланцюжки, які додано до таблиці I<таблиця>, у форматі списку відокремлених пробілами значень\&. Цей параметр стосується лише ланцюжків, які раніше було додано за допомогою B<--direct --add-chain>\&.

source: [B<--permanent>] B<--direct> B<--add-chain> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain>
uk: [B<--permanent>] B<--direct> B<--add-chain> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок>

source: Add a new chain with name I<chain> to table I<table>\&. Make sure there\*(Aqs no other chain with this name already\&.
uk: Додати новий ланцюжок із назвою I<ланцюжок> до таблиці I<таблиця>\&. Переконайтеся, що там ще немає ланцюжка з такою самою назвою\&.

source: There already exist basic chains to use with direct options, for example I<INPUT_direct> chain (see I<iptables-save | grep direct> output for all of them)\&. These chains are jumped into before chains for zones, i\&.e\&. every rule put into I<INPUT_direct> will be checked before rules in zones\&.
uk: Базові ланцюжки, якими можна скористатися з параметрами безпосереднього керування, вже існують, наприклад, таким ланцюжком є I<INPUT_direct> (див. результат виконання команди I<iptables-save | grep direct>, щоб отримати повний список)\&. Перехід за цими ланцюжками буде здійснено до ланцюжків зон, тобто буде виконано перевірку усіх правил, які закладено до I<INPUT_direct>, до правил у зонах\&.

source: [B<--permanent>] B<--direct> B<--remove-chain> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain>
uk: [B<--permanent>] B<--direct> B<--remove-chain> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок>

source: Remove chain with name I<chain> from table I<table>\&. Only chains previously added with B<--direct --add-chain> can be removed this way\&.
uk: Вилучити ланцюжок із назвою I<ланцюжок> з таблиці I<таблиця>\&. У цей спосіб можна вилучити лише ланцюжки, які раніше було додано за допомогою B<--direct --add-chain>\&.

source: [B<--permanent>] B<--direct> B<--query-chain> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain>
uk: [B<--permanent>] B<--direct> B<--query-chain> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок>

source: Return whether a chain with name I<chain> exists in table I<table>\&. Returns 0 if true, 1 otherwise\&. This option concerns only chains previously added with B<--direct --add-chain>\&.
uk: Повернути, чи існує ланцюжок із назвою I<ланцюжок> у таблиці I<таблиця>\&. Повертає 0, якщо існує; 1, якщо не існує\&. Цей параметр стосується лише ланцюжків, які раніше було додано за допомогою параметра B<--direct --add-chain>\&.

source: Get all rules added to all chains in all tables as a newline separated list of the priority and arguments\&. This option concerns only rules previously added with B<--direct --add-rule>\&.
uk: Отримати усі правила, які додано до усіх ланцюжків в усіх таблицях у форматі списку відокремлених символами розривів рядків пріоритетностей та аргументів\&. Цей параметр стосується лише правил, які раніше було додано за допомогою B<--direct --add-rule>\&.

source: [B<--permanent>] B<--direct> B<--get-rules> { I<ipv4> | I<ipv6> | I<eb> } I<table> I<chain>
uk: [B<--permanent>] B<--direct> B<--get-rules> { I<ipv4> | I<ipv6> | I<eb> } I<таблиця> I<ланцюжок>

source: Get all rules added to chain I<chain> in table I<table> as a newline separated list of the priority and arguments\&. This option concerns only rules previously added with B<--direct --add-rule>\&.
uk: Отримати усі правила, які додано до ланцюжка I<ланцюжок> у таблиці I<таблиця> у форматі списку відокремлених символами розривів рядків пріоритетностей та аргументів\&. Цей параметр стосується лише правил, які раніше було додано за допомогою B<--direct --add-rule>\&.
