Repository: yurchor/uk-man-firewalld
Catalog: *.po
Languages: uk

source: List ports added as a space separated list\&. A port is of the form I<portid>[-I<portid>]/I<protocol>, it can be either a port and protocol pair or a port range with a protocol\&.
uk: Вивести список доданих портів у форматі списку відокремлених пробілами значень\&. Порт записують у формі I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>, запис може бути у формі пари порт-протокол або діапазону портів з протоколом\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-port>=I<portid>[-I<portid>]/I<protocol> [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--add-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол> [B<--timeout>=I<значення_часу>]

source: Add the port\&. This option can be specified multiple times\&. If a timeout is supplied, the rule will be active for the specified amount of time and will be removed automatically afterwards\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&.
uk: Додати порт\&. Цей параметр можна вказувати декілька разів в одній команді\&. Якщо вказано значення часу очікування, правило буде активним протягом вказаного періоду часу, а потім його буде автоматично вилучено\&. Значення I<значення_часу> можна вказати або як кількість (секунд) або як число, за яким вказано один із таких символів: I<s> (секунди), I<m> (хвилини), I<h> (години), приклади: I<20m> або I<1h>\&.

source: The port can either be a single port number or a port range I<portid>-I<portid>\&. The protocol can either be I<tcp>, I<udp>, I<sctp> or I<dccp>\&.
uk: Портом може бути або окремий номер порту, або діапазон портів I<ідентифікатор_порту>-I<ідентифікатор_порту>\&. Протоколом може бути I<tcp>, I<udp>, I<sctp> або I<dccp>\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-port>=I<portid>[-I<portid>]/I<protocol>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Remove the port\&. This option can be specified multiple times\&.
uk: Вилучити порт\&. Цей параметр можна вказувати декілька разів в одній команді\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-port>=I<portid>[-I<portid>]/I<protocol>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Return whether the port has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано порт\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--list-protocols>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--list-protocols>

source: List protocols added as a space separated list\&.
uk: Вивести список доданих протоколів як список відокремлених пробілами значень\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-protocol>=I<protocol> [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--add-protocol>=I<протокол> [B<--timeout>=I<значення_часу>]

source: Add the protocol\&. This option can be specified multiple times\&. If a timeout is supplied, the rule will be active for the specified amount of time and will be removed automatically afterwards\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&.
uk: Додати протокол\&. Цей параметр можна вказувати декілька разів в одній команді\&. Якщо вказано значення часу очікування, правило буде активним протягом вказаного періоду часу, а потім його буде автоматично вилучено\&. Значення I<значення_часу> можна вказати або як кількість (секунд) або як число, за яким вказано один із таких символів: I<s> (секунди), I<m> (хвилини), I<h> (години), приклади: I<20m> або I<1h>\&.

source: The protocol can be any protocol supported by the system\&. Please have a look at I</etc/protocols> for supported protocols\&.
uk: Протоколом може бути будь-який протокол, підтримку якого передбачено у системі\&. Будь ласка, ознайомтеся із I</etc/protocols>, щоб отримати список підтримуваних протоколів\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-protocol>=I<protocol>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-protocol>=I<протокол>

source: Remove the protocol\&. This option can be specified multiple times\&.
uk: Вилучити протокол\&. Цей параметр можна вказувати декілька разів в одній команді\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-protocol>=I<protocol>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-protocol>=I<протокол>

source: Return whether the protocol has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано протокол\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--list-source-ports>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--list-source-ports>

source: List source ports added as a space separated list\&. A port is of the form I<portid>[-I<portid>]/I<protocol>\&.
uk: Вивести список доданих портів походження у форматі списку відокремлених пробілами значень\&. Порт записують у формі I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-source-port>=I<portid>[-I<portid>]/I<protocol> [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--add-source-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол> [B<--timeout>=I<значення_часу>]

source: Add the source port\&. This option can be specified multiple times\&. If a timeout is supplied, the rule will be active for the specified amount of time and will be removed automatically afterwards\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&.
uk: Додати порт походження\&. Цей параметр можна вказувати декілька разів в одній команді\&. Якщо вказано значення часу очікування, правило буде активним протягом вказаного періоду часу, а потім його буде автоматично вилучено\&. Значення I<значення_часу> можна вказати або як кількість (секунд) або як число, за яким вказано один із таких символів: I<s> (секунди), I<m> (хвилини), I<h> (години), приклади: I<20m> або I<1h>\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-source-port>=I<portid>[-I<portid>]/I<protocol>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-source-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Remove the source port\&. This option can be specified multiple times\&.
uk: Вилучити порт походження\&. Цей параметр можна вказувати декілька разів в одній команді\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-source-port>=I<portid>[-I<portid>]/I<protocol>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-source-port>=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]/I<протокол>

source: Return whether the source port has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано порт походження\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--list-icmp-blocks>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--list-icmp-blocks>

source: List Internet Control Message Protocol (ICMP) type blocks added as a space separated list\&.
uk: Вивести список доданих блоків типів Internet Control Message Protocol (ICMP) у форматі списку відокремлених пробілами значень\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-icmp-block>=I<icmptype> [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--add-icmp-block>=I<тип_icmp> [B<--timeout>=I<значення_часу>]

source: Add an ICMP block for I<icmptype>\&. This option can be specified multiple times\&. If a timeout is supplied, the rule will be active for the specified amount of time and will be removed automatically afterwards\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&.
uk: Додати блок ICMP для типу I<тип_icmp>\&. Цей параметр можна вказувати декілька разів в одній команді\&. Якщо вказано значення часу очікування, правило буде активним протягом вказаного періоду часу, а потім його буде автоматично вилучено\&. Значення I<значення_часу> можна вказати або як кількість (секунд) або як число, за яким вказано один із таких символів: I<s> (секунди), I<m> (хвилини), I<h> (години), приклади: I<20m> або I<1h>\&.

source: The I<icmptype> is the one of the icmp types firewalld supports\&. To get a listing of supported icmp types: B<firewall-cmd --get-icmptypes>
uk: Значенням I<тип_icmp> є один з типів icmp, підтримку яких передбачено у firewalld\&. Щоб отримати список підтримуваних типів icmp, скористайтеся командою B<firewall-cmd --get-icmptypes>

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-icmp-block>=I<icmptype>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-icmp-block>=I<тип_icmp>

source: Remove the ICMP block for I<icmptype>\&. This option can be specified multiple times\&.
uk: Вилучити блок ICMP для типу ICMP I<тип_icmp>\&. Цей параметр можна вказувати декілька разів в одній команді\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-icmp-block>=I<icmptype>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-icmp-block>=I<тип_icmp>

source: Return whether an ICMP block for I<icmptype> has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано блок ICMP для I<тип_icmp>\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--list-forward-ports>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--list-forward-ports>

source: List I<IPv4> forward ports added as a space separated list\&.
uk: Вивести список доданих портів переспрямування I<IPv4> як список відокремлених пробілами значень\&.

source: For I<IPv6> forward ports, please use the rich language\&.
uk: Для портів переспрямування I<IPv6>, будь ласка, скористайтеся розширеним варіантом мови\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-forward-port>=port=I<portid>[-I<portid>]:proto=I<protocol>[:toport=I<portid>[-I<portid>]][:toaddr=I<address>[/I<mask>]] [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--add-forward-port>=port=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]:proto=I<протокол>[:toport=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]][:toaddr=I<адреса>[/I<маска>]] [B<--timeout>=I<значення_часу>]

source: Add the I<IPv4> forward port\&. This option can be specified multiple times\&. If a timeout is supplied, the rule will be active for the specified amount of time and will be removed automatically afterwards\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&.
uk: Додати порт переспрямування I<IPv4>\&. Цей параметр можна вказувати декілька разів в одній команді\&. Якщо вказано значення часу очікування, правило буде активним протягом вказаного періоду часу, а потім його буде автоматично вилучено\&. Значення I<значення_часу> можна вказати або як кількість (секунд) або як число, за яким вказано один із таких символів: I<s> (секунди), I<m> (хвилини), I<h> (години), приклади: I<20m> або I<1h>\&.

source: The port can either be a single port number I<portid> or a port range I<portid>-I<portid>\&. The protocol can either be I<tcp>, I<udp>, I<sctp> or I<dccp>\&. The destination address is a simple IP address\&.
uk: Портом може бути або окремий номер порту I<ідентифікатор_порту>, або діапазон портів I<ідентифікатор_порту>-I<ідентифікатор_порту>\&. Протоколом може бути I<tcp>, I<udp>, I<sctp> або I<dccp>\&. Адреса призначення є простою адресою IP\&.

source: I<Note:> IP forwarding will be implicitly enabled if B<toaddr> is specified\&.
uk: I<Зауваження:> буде неявними чином увімкнено переспрямовування IP, якщо вказано B<toaddr>\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-forward-port>=port=I<portid>[-I<portid>]:proto=I<protocol>[:toport=I<portid>[-I<portid>]][:toaddr=I<address>[/I<mask>]]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-forward-port>=port=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]:proto=I<протокол>[:toport=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]][:toaddr=I<адреса>[/I<маска>]]

source: Remove the I<IPv4> forward port\&. This option can be specified multiple times\&.
uk: Вилучити порт переспрямування I<IPv4>\&. Цей параметр можна вказувати декілька разів в одній команді\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-forward-port>=port=I<portid>[-I<portid>]:proto=I<protocol>[:toport=I<portid>[-I<portid>]][:toaddr=I<address>[/I<mask>]]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-forward-port>=port=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]:proto=I<протокол>[:toport=I<ідентифікатор_порту>[-I<ідентифікатор_порту>]][:toaddr=I<адреса>[/I<маска>]]

source: Return whether the I<IPv4> forward port has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано порт переспрямування I<IPv4>\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-masquerade> [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--add-masquerade> [B<--timeout>=I<значення_часу>]

source: Enable I<IPv4> masquerade\&. If a timeout is supplied, masquerading will be active for the specified amount of time\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&. Masquerading is useful if the machine is a router and machines connected over an interface in another zone should be able to use the first connection\&.
uk: Увімкнути приховування I<IPv4>\&. Якщо вказано час очікування, приховування буде активним протягом вказаного періоду часу\&. Значенням I<значення_часу> є числом (секунд) або числом із одним з наступних символів: I<s> (секунди), I<m> (хвилини), I<h> (години), наприклад, I<20m> або I<1h>\&. Приховування корисне, якщо комп'ютер є маршрутизатором, а комп'ютери у іншій зоні, які з'єднано через інтерфейс, повинні мати можливість скористатися першим з'єднанням\&.

source: For I<IPv6> masquerading, please use the rich language\&.
uk: Для приховування I<IPv6>, будь ласка, скористайтеся розширеним варіантом мови\&.

source: I<Note:> IP forwarding will be implicitly enabled\&.
uk: I<Зауваження:> буде неявними чином увімкнено переспрямовування IP\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-masquerade>
uk: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-masquerade>

source: Disable I<IPv4> masquerade\&. If the masquerading was enabled with a timeout, it will be disabled also\&.
uk: Вимкнути приховування I<IPv4>\&. Якщо приховування було увімкнено з часом очікування, його також буде вимкнено\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-masquerade>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-masquerade>

source: Return whether I<IPv4> masquerading has been enabled\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було увімкнено приховування I<IPv4>\&. Повертає 0, якщо було; 1, якщо не було\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--list-rich-rules>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--list-rich-rules>

source: List rich language rules added as a newline separated list\&.
uk: Вивести список доданих правил розширеної мови у форматі списку відокремлених символами розриву рядків значень\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-rich-rule>=\*(AqI<rule>\*(Aq [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правло>] B<--add-rich-rule>=\*(AqI<правило>\*(Aq [B<--timeout>=I<значення_часу>]

source: Add rich language rule \*(AqI<rule>\*(Aq\&. This option can be specified multiple times\&. If a timeout is supplied, the I<rule> will be active for the specified amount of time and will be removed automatically afterwards\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&.
uk: Додати правило розширеної мови «I<правило>»\&. Цей параметр можна вказувати декілька разів в одній команді\&. Якщо вказано значення часу очікування, I<правило> буде активним протягом вказаного періоду часу, а потім його буде автоматично вилучено\&. Значення I<значення_часу> можна вказати або як кількість (секунд) або як число, за яким вказано один із таких символів: I<s> (секунди), I<m> (хвилини), I<h> (години), приклади: I<20m> або I<1h>\&.

source: For the rich language rule syntax, please have a look at B<firewalld.richlanguage>(5)\&.
uk: Щоб ознайомитися із синтаксисом розширеної мови, будь ласка, зверніться до сторінки підручника B<firewalld.richlanguage>(5)\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-rich-rule>=\*(AqI<rule>\*(Aq
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-rich-rule>=\*(AqI<правило>\*(Aq

source: Remove rich language rule \*(AqI<rule>\*(Aq\&. This option can be specified multiple times\&.
uk: Вилучити правило розширеної мови \*(AqI<правило>\*(Aq\&. Цей параметр можна вказувати декілька разів в одній команді\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-rich-rule>=\*(AqI<rule>\*(Aq
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-rich-rule>=\*(AqI<правило>\*(Aq

source: Return whether a rich language rule \*(AqI<rule>\*(Aq has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано правило розширеної мови «I<правило>»\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: Options to Adapt and Query Zones
uk: Параметри для пристосування зон та опитування зон

source: Options in this section affect only one particular zone\&. If used with B<--zone>=I<zone> option, they affect the specified zone\&. If the option is omitted, they affect default zone (see B<--get-default-zone>)\&.
uk: Параметри з цього розділу стосуються лише одної певної зони\&. Якщо їх використано разом із параметром B=I<зона>, вони стосуватимуться вказаної зони\&. Якщо параметр не вказано, воно стосуватиметься типової зони (див. B<--get-default-zone>)\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--add-icmp-block-inversion>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--add-icmp-block-inversion>

source: Enable ICMP block inversion\&.
uk: Увімкнути інверсію блоків ICMP\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--remove-icmp-block-inversion>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--remove-icmp-block-inversion>

source: Disable ICMP block inversion\&.
uk: Вимкнути інверсію блоків ICMP\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--query-icmp-block-inversion>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--query-icmp-block-inversion>

source: Return whether ICMP block inversion is enabled\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було увімкнено інверсію блоків ICMP\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--add-forward>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--add-forward>

source: Enable intra zone forwarding\&.
uk: Увімкнути переспрямування всередині зони\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--remove-forward>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--remove-forward>

source: Disable intra zone forwarding\&.
uk: Вимкнути переспрямування всередині зони\&.

source: [B<--permanent>] [B<--zone>=I<zone>] B<--query-forward>
uk: [B<--permanent>] [B<--zone>=I<зона>] B<--query-forward>

source: Return whether intra zone forwarding is enabled\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було увімкнено переспрямування всередині зони\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: Options to Adapt and Query Policies
uk: Параметри для пристосування правил та опитування правил

source: Options in this section affect only one particular policy\&. It\*(Aqs required to specify B<--policy>=I<policy> with these options\&.
uk: Параметри у цьому розділі стосуються лише одного окремого правила\&. Щоб скористатися цими параметрами, слід вказати B<--policy>=I<правило>\&.

source: B<--permanent> B<--policy>=I<policy> B<--get-priority>
uk: B<--permanent> B<--policy>=I<правило> B<--get-priority>

source: Get the priority\&.
uk: Отримати пріоритетність\&.

source: B<--permanent> B<--policy>=I<policy> B<--set-priority>=I<priority>
uk: B<--permanent> B<--policy>=I<правило> B<--set-priority>=I<пріоритетність>

source: Set the priority\&. The priority determines the relative ordering of policies\&. This is an integer value between -32768 and 32767 where -1 is the default value for new policies and 0 is reserved for internal use\&.
uk: Встановити пріоритетність\&. Пріоритетність визначає відносний порядок правил\&. Це ціле число від -32768 до 32767, де типовим для нових правил є значення -1, значення 0 зарезервовано для внутрішнього використання\&.

source: If a priority is E<lt> 0, then the policy\*(Aqs rules will execute before all rules in all zones\&.
uk: Якщо пріоритетність E<lt> 0, правило буде виконано до усіх правил в усіх зонах\&.

source: If a priority is E<gt> 0, then the policy\*(Aqs rules will execute after all rules in all zones\&.
uk: Якщо пріоритетність E<gt> 0, правило буде виконано після усіх правил в усіх зонах\&.

source: [B<--permanent>] B<--policy>=I<policy> B<--list-ingress-zones>
uk: [B<--permanent>] B<--policy>=I<правило> B<--list-ingress-zones>

source: List ingress zones added as a space separated list\&.
uk: Вивести список доданих вхідних зон як список відокремлених пробілами значень\&.
