Repository: yurchor/uk-man-firewalld
Catalog: *.po
Languages: uk

source: NAME
uk: НАЗВА

source: firewall-cmd - firewalld command line client
uk: firewall-cmd — клієнт командного рядка firewalld

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<firewall-cmd> [OPTIONS...]
uk: B<firewall-cmd> [ПАРАМЕТРИ...]

source: DESCRIPTION
uk: ОПИС

source: firewall-cmd is the command line client of the firewalld daemon\&. It provides an interface to manage the runtime and permanent configurations\&.
uk: firewall-cmd — клієнтська програма фонової служби firewalld, якою керують з командного рядка\&. Вона надає інтерфейс для керування динамічними і постійними налаштуваннями служби\&.

source: The runtime configuration in firewalld is separated from the permanent configuration\&. This means that things can get changed in the runtime or permanent configuration\&.
uk: Динамічні налаштування у firewalld відокремлено від постійних налаштувань\&. Це означає, що поведінку програми можна змінювати у динамічних або постійних налаштуваннях\&.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Sequence options are the options that can be specified multiple times, the exit code is 0 if there is at least one item that succeeded\&. The I<ALREADY_ENABLED> (11), I<NOT_ENABLED> (12) and also I<ZONE_ALREADY_SET> (16) errors are treated as succeeded\&. If there are issues while parsing the items, then these are treated as warnings and will not change the result as long as there is a succeeded one\&. Without any succeeded item, the exit code will depend on the error codes\&. If there is exactly one error code, then this is used\&. If there are more than one then I<UNKNOWN_ERROR> (254) will be used\&.
uk: Параметри послідовності є параметрами, які може бути вказано декілька разів; кодом виходу буде 0, якщо успішним буде принаймні один з елементів послідовності\&. Коди помилок I<ALREADY_ENABLED> (11, «вже увімкнено»), I<NOT_ENABLED> (12, «не увімкнено») і I<ZONE_ALREADY_SET> (16, «зону вже встановлено») також вважаються кодами успішного виконання\&. Якщо під час обробки записів буде виявлено помилки, ці помилки вважаються попередженнями і не змінюють результату, якщо було успішно виконано принаймні один запис\&. Якщо успішно виконаного запису не буде, код виходу залежатиме від кодів помилок\&. Якщо буде отримано точно один код помилки, буде використано саме цей код\&. Якщо кодів помилок було декілька, буде використано I<UNKNOWN_ERROR> (254)\&.

source: The following options are supported:
uk: Передбачено підтримку таких загальних параметрів:

source: General Options
uk: Загальні параметри

source: Prints a short help text and exits\&.
uk: Виводить коротку текстову довідку і завершує роботу\&.

source: Print the version string of firewalld\&. This option is not combinable with other options\&.
uk: Вивести рядок версії firewalld\&. Цей параметр не можна поєднувати з іншими параметрами\&.

source: Do not print status messages\&.
uk: Не виводити повідомлень щодо стану\&.

source: Status Options
uk: Параметри стану

source: Check whether the firewalld daemon is active (i\&.e\&. running)\&. Returns an exit code 0 if it is active, I<RUNNING_BUT_FAILED> if failure occurred on startup, I<NOT_RUNNING> otherwise\&. See the section called \(lqEXIT CODES\(rq\&. This will also print the state to I<STDOUT>\&.
uk: Перевірити, чи є активною фонова служба firewalld (тобто, чи запущено програму)\&. Повертає код виходу 0, якщо служба є активною; I<RUNNING_BUT_FAILED>, якщо під час запуску програми сталася помилка; I<NOT_RUNNING> в усіх інших випадках\&. Див. розділ \(lqКОДИ ВИХОДУ\(rq\&. Також стан буде виведено до I<STDOUT>\&.

source: Reload firewall rules and keep state information\&. Current permanent configuration will become new runtime configuration, i\&.e\&. all runtime only changes done until reload are lost with reload if they have not been also in permanent configuration\&.
uk: Перезавантажити правила брандмауера і зберегти дані щодо стану\&. Поточні постійні налаштування стануть новими динамічними налаштуваннями, тобто усі зміни у динамічних налаштуваннях, які було внесено до динамічних налаштувань до моменту перезавантаження, буде втрачено після перезавантаження, якщо їх не було у постійних налаштуваннях\&.

source: Note: If FlushAllOnReload=no, runtime changes applied via the direct interface are not affected and will therefore stay in place until firewalld daemon is restarted completely\&. For FlushAllOnReload, see B<firewalld.conf>(5)\&.
uk: Зауваження: якщо FlushAllOnReload=no, зміни у динамічних налаштуваннях, застосовані за допомогою безпосереднього інтерфейсу, не зміняться і тому лишаться чинними, аж доки фонову службу firewalld не буде перезапущено повністю\&. Щодо FlushAllOnReload див. B<firewalld.conf>(5)\&.

source: Reload firewall completely, even netfilter kernel modules\&. This will most likely terminate active connections, because state information is lost\&. This option should only be used in case of severe firewall problems\&. For example if there are state information problems that no connection can be established with correct firewall rules\&.
uk: Повністю перезавантажити брандмауер, навіть модулі ядра netfilter\&. Це, найімовірніше, призведе до розірвання активних з'єднань, оскільки дані щодо стану буде втрачено\&. Цим параметром слід користуватися, лише у разі критичних проблем із брандмауером\&. Наприклад, якщо є проблеми із даними щодо стану такі, що жодне з'єднання не може бути встановлено із належними правилами брандмауера\&.

source: Save active runtime configuration and overwrite permanent configuration with it\&. The way this is supposed to work is that when configuring firewalld you do runtime changes only and once you\*(Aqre happy with the configuration and you tested that it works the way you want, you save the configuration to disk\&.
uk: Зберегти активні динамічні налаштування і перезаписати постійні налаштування ними\&. Це відбувається так: при налаштовуванні firewalld ви вносите зміни лише до динамічних налаштувань, і коли досягнуто прийнятного варіанта, ви перевірили, що усе працює так, як слід, ви зберігаєте налаштування на диск\&.

source: Run checks on the permanent configuration\&. This includes XML validity and semantics\&.
uk: Виконати перевірки щодо постійних налаштувань\&. Перевірки стосуватимуться чинності XML і семантики\&.

source: Log Denied Options
uk: Параметри журналу відмов

source: Print the log denied setting\&.
uk: Вивести параметр запису відмов до журналу\&.

source: B<--set-log-denied>=I<value>
uk: B<--set-log-denied>=I<значення>

source: Add logging rules right before reject and drop rules in the INPUT, FORWARD and OUTPUT chains for the default rules and also final reject and drop rules in zones for the configured link-layer packet type\&. The possible values are: I<all>, I<unicast>, I<broadcast>, I<multicast> and I<off>\&. The default setting is I<off>, which disables the logging\&.
uk: Додати правила журналювання безпосередньо перед правилами відмови (reject) та відкидання (drop) у ланцюжках INPUT, FORWARD і OUTPUT для типових правил, а також правилами остаточної відмови та відкидання у зонах для налаштованих типів пакетів зв'язку-шару\&. Можливими значеннями є такі: I<all>, I<unicast>, I<broadcast>, I<multicast> і I<off>\&. Типовим значенням є I<off>, що означає «вимкнути записування до журналу»\&.

source: This is a runtime and permanent change and will also reload the firewall to be able to add the logging rules\&.
uk: Це зміна у динамічних і постійних налаштуваннях, вона також призведе до перезавантаження брандмауера з метою уможливлення додавання правил запису до журналу\&.

source: Permanent Options
uk: Постійні параметри

source: The permanent option B<--permanent> can be used to set options permanently\&. These changes are not effective immediately, only after service restart/reload or system reboot\&. Without the B<--permanent> option, a change will only be part of the runtime configuration\&.
uk: Параметр постійних налаштувань B<--permanent> можна використати для встановлення постійних значень параметрів\&. Ці параметри не набудуть чинності негайно, а лише після перезапуску/перезавантаження налаштувань або перезавантаження системи\&. Без параметра B<--permanent> зміни лишатимуться частиною лише динамічних налаштувань\&.

source: If you want to make a change in runtime and permanent configuration, use the same call with and without the B<--permanent> option\&.
uk: Якщо ви хочете внести зміни до динамічних і постійних налаштувань, скористайтеся тим самим викликом з параметром B<--permanent> і без нього\&.

source: The B<--permanent> option can be optionally added to all options further down where it is supported\&.
uk: Параметр B<--permanent> можна додати до усіх параметрів, які описано нижче, там, де передбачено його підтримку\&.

source: Zone Options
uk: Параметри зони

source: Print default zone for connections and interfaces\&.
uk: Вивести типову зону для з'єднань та інтерфейсів\&.

source: B<--set-default-zone>=I<zone>
uk: B<--set-default-zone>=I<зона>

source: Set default zone for connections and interfaces where no zone has been selected\&. Setting the default zone changes the zone for the connections or interfaces, that are using the default zone\&.
uk: Встановити типову зону для з'єднань та інтерфейсів там, де не було вибрано жодної зони\&. Встановлення типової зони змінить зону для з'єднань та інтерфейсів, у яких використано типову зону\&.

source: This is a runtime and permanent change\&.
uk: Це зміна у динамічних і постійних налаштуваннях\&.

source: Print currently active zones altogether with interfaces and sources used in these zones\&. Active zones are zones, that have a binding to an interface or source\&. The output format is:
uk: Вивести поточні активні зони разом із інтерфейсами і адресами походження, які використано у цих зонах\&. Активними є зони, які пов'язано із інтерфейсом або походженням\&. Формат виведення є таким:

source: I<zone1> interfaces: I<interface1> I<interface2> \&.\&. sources: I<source1> \&.\&. I<zone2> interfaces: I<interface3> \&.\&. I<zone3> sources: I<source2> \&.\&. If there are no interfaces or sources bound to the zone, the corresponding line will be omitted\&.
uk: I<зона> interfaces: I<інтерфейс1> I<інтерфейс2> \&.\&. sources: I<походження1> \&.\&. I<походження2> interfaces: I<інтерфейс3> \&.\&. I<зона3> sources: I<походження2> \&.\&. Якщо з зоною не пов'язано жодних інтерфейсів або походжень, відповідний рядок буде пропущено\&.

source: Print predefined zones as a space separated list\&.
uk: Вивести попередньо визначені зони у форматі списку відокремлених пробілами значень\&.

source: Print predefined services as a space separated list\&.
uk: Вивести попередньо визначені служби у форматі списку відокремлених пробілами значень\&.

source: Print predefined icmptypes as a space separated list\&.
uk: Вивести попередньо визначені типи ICMP у форматі списку відокремлених пробілами значень\&.

source: [B<--permanent>] B<--get-zone-of-interface>=I<interface>
uk: [B<--permanent>] B<--get-zone-of-interface>=I<інтерфейс>

source: Print the name of the zone the I<interface> is bound to or I<no zone>\&.
uk: Вивести назву зони, із якою пов'язано I<інтерфейс> або I<немає зони>\&.

source: [B<--permanent>] B<--get-zone-of-source>=I<source>[/I<mask>]|I<MAC>|ipset:I<ipset>
uk: [B<--permanent>] B<--get-zone-of-source>=I<джерело>[/I<маска>]|I<MAC>|ipset:I<набір_ip>

source: Print the name of the zone the source is bound to or I<no zone>\&.
uk: Вивести назву зони, із якою пов'язано походження або I<немає зони>\&.

source: [B<--permanent>] B<--info-zone=>I<zone>
uk: [B<--permanent>] B<--info-zone=>I<зона>

source: Print information about the zone I<zone>\&. The output format is:
uk: Вивести відомості щодо зони I<зона>\&. Формат виведення є таким:

source: I<zone> interfaces: I<interface1> \&.\&. sources: I<source1> \&.\&. services: I<service1> \&.\&. ports: I<port1> \&.\&. protocols: I<protocol1> \&.\&. forward-ports: I<forward-port1> \&.\&. source-ports: I<source-port1> \&.\&. icmp-blocks: I<icmp-type1> \&.\&. rich rules: I<rich-rule1> \&.\&.
uk: I<зона> interfaces: I<інтерфейс1> \&.\&. sources: I<походження1> \&.\&. services: I<служба1> \&.\&. ports: I<порт1> \&.\&. protocols: I<протокол1> \&.\&. forward-ports: I<порт_переспрямування1> \&.\&. source-ports: I<порт_походження1> \&.\&. icmp-blocks: I<тип_icmp1> \&.\&. rich rules: I<розширене_правило1> \&.\&.

source: List everything added for or enabled in all zones\&. The output format is:
uk: Вивести список усього доданого або увімкненого в усіх зонах\&. Формат виведення є таким:

source: I<zone1> interfaces: I<interface1> \&.\&. sources: I<source1> \&.\&. services: I<service1> \&.\&. ports: I<port1> \&.\&. protocols: I<protocol1> \&.\&. forward-ports: I<forward-port1> \&.\&. icmp-blocks: I<icmp-type1> \&.\&. rich rules: I<rich-rule1> \&.\&. \&.\&.
uk: I<зона1> interfaces: I<інтерфейс1> \&\& sources: I<походження> \&\& services: I<служба1> \&.\&. ports: I<порт1> \&.\&. protocols: I<протокол1> \&.\&. forward-ports: I<порт_переспрямування1> \&.\&. icmp-blocks: I<тип_icmp1> \&.\&. rich rules: I<розширене_правило1> \&.\&. \&.\&.

source: B<--permanent> B<--new-zone>=I<zone>
uk: B<--permanent> B<--new-zone>=I<зона>

source: Add a new permanent and empty zone\&.
uk: Додати нову постійну і порожню зону\&.

source: Zone names must be alphanumeric and may additionally include characters: \*(Aq_\*(Aq and \*(Aq-\*(Aq\&.
uk: Назви зон мають складатися з літер і цифр і додатково можуть містити такі символи: \*(Aq-\*(Aq\&.

source: B<--permanent> B<--new-zone-from-file>=I<filename> [B<--name>=I<zone>]
uk: B<--permanent> B<--new-zone-from-file>=I<назва_файла> [B<--name>=I<зона>]

source: Add a new permanent zone from a prepared zone file with an optional name override\&.
uk: Додати новий постійну зону засіб з приготованої зони із необов'язковим перевизначенням назви\&.

source: B<--permanent> B<--delete-zone>=I<zone>
uk: B<--permanent> B<--delete-zone>=I<зона>

source: Delete an existing permanent zone\&.
uk: Вилучити наявну постійну зону\&.

source: B<--permanent> B<--load-zone-defaults>=I<zone>
uk: B<--permanent> B<--load-zone-defaults>=I<зона>

source: Load zone default settings or report NO_DEFAULTS error\&.
uk: Завантажити типові параметри зони або повідомити про помилку NO_DEFAULTS\&.

source: B<--permanent> B<--path-zone=>I<zone>
uk: B<--permanent> B<--path-zone=>I<зона>

source: Print path of the zone configuration file\&.
uk: Вивести шлях до файла налаштувань зони\&.

source: Policy Options
uk: Параметри правил

source: Print predefined policies as a space separated list\&.
uk: Вивести попередньо визначені правила у форматі списку відокремлених пробілами значень\&.

source: [B<--permanent>] B<--info-policy>=I<policy>
uk: [B<--permanent>] B<--info-policy>=I<правило>

source: Print information about the policy I<policy>\&.
uk: Вивести відомості щодо правила I<правило>\&.

source: List everything added for or enabled in all policies\&.
uk: Вивести список усього доданого або увімкненого в усіх правилах\&.

source: B<--permanent> B<--new-policy>=I<policy>
uk: B<--permanent> B<--new-policy>=I<правило>

source: Add a new permanent policy\&.
uk: Додати нове постійне правило\&.

source: Policy names must be alphanumeric and may additionally include characters: \*(Aq_\*(Aq and \*(Aq-\*(Aq\&.
uk: Назви правил мають складатися з літер і цифр і додатково можуть містити такі символи: \*(Aq-\*(Aq\&.

source: B<--permanent> B<--new-policy-from-file>=I<filename> [B<--name>=I<policy>]
uk: B<--permanent> B<--new-policy-from-file>=I<назва_файла> [B<--name>=I<правило>]

source: Add a new permanent policy from a prepared policy file with an optional name override\&.
uk: Додати новий постійне правило з приготованого файла правил із необов'язковим перевизначенням назви\&.

source: B<--permanent> B<--path-policy>=I<policy>
uk: B<--permanent> B<--path-policy>=I<правило>

source: Print path of the policy configuration file\&.
uk: Вивести шлях до файла налаштувань правил\&.

source: B<--permanent> B<--delete-policy>=I<policy>
uk: B<--permanent> B<--delete-policy>=I<правило>

source: Delete an existing permanent policy\&.
uk: Вилучити наявне постійне правило\&.

source: B<--permanent> B<--load-policy-defaults>=I<policy>
uk: B<--permanent> B<--load-policy-defaults>=I<правило>

source: Load the shipped defaults for a policy\&. Only applies to policies shipped with firewalld\&. Does not apply to user defined policies\&.
uk: Завантажити типові параметри для правила\&. Стосується лише правил, які є частиною пакунка firewalld\&. Не стосується визначених користувачем правил\&.

source: Options to Adapt and Query Zones and Policies
uk: Параметри для пристосування зон та правил та опитування зон та правил

source: Options in this section affect only one particular zone or policy\&. If used with B<--zone>=I<zone> or B<--policy>=I<policy> option, they affect the specified zone or policy\&. If both options are omitted, they affect the default zone (see B<--get-default-zone>)\&.
uk: Параметри з цього розділу стосуються лише одної певної зони або одного певного правила\&. Якщо їх використано разом із параметром B<--zone>=I<зона> або B<--policy>=I<правило>, вони стосуватимуться вказаної зони або вказаного правила\&. Якщо не вказано жодного з цих параметрів, вони стосуватимуться типової зони (див. B<--get-default-zone>)\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--policy>=I<policy>] B<--list-all>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--policy>=I<правило>] B<--list-all>

source: List everything added or enabled\&.
uk: Вивести список усього доданого або увімкненого\&.

source: B<--permanent> [B<--zone>=I<zone>] [B<--policy>=I<policy>] B<--get-target>
uk: B<--permanent> [B<--zone>=I<зона>] [B<--policy>=I<правило>] B<--get-target>

source: Get the target\&.
uk: Отримати призначення\&.

source: B<--permanent> [B<--zone>=I<zone>] [B<--policy>=I<policy>] B<--set-target>=I<target>
uk: B<--permanent> [B<--zone>=I<зона>] [B<--policy>=I<правило>] B<--set-target>=I<призначення>

source: Set the target\&.
uk: Встановити призначення\&.

source: For zones I<target> is one of: I<default>, I<ACCEPT>, I<DROP>, I<REJECT>
uk: Для зон I<призначення> є одним з таких значень: I<default> (типове), I<ACCEPT> (прийняти), I<DROP> (відкинути), I<REJECT> (відмовити)

source: For policies I<target> is one of: I<CONTINUE>, I<ACCEPT>, I<DROP>, I<REJECT>
uk: Для правил I<призначення> є одним з таких значень: I<CONTINUE> (продовжити), I<ACCEPT> (прийняти), I<DROP> (відкинути), I<REJECT> (відмовити)

source: I<default> is similar to I<REJECT>, but it implicitly allows ICMP packets\&.
uk: Варіант I<default> є подібним до I<REJECT>, але неявним чином дозволяє пакети ICMP\&.

source: B<--permanent> [B<--zone>=I<zone>] [B<--policy>=I<policy>] B<--set-description>=I<description>
uk: B<--permanent> [B<--zone>=I<зона>] [B<--policy>=I<правило>] B<--set-description>=I<опис>

source: Set description\&.
uk: Встановити опис\&.

source: B<--permanent> [B<--zone>=I<zone>] [B<--policy>=I<policy>] B<--get-description>
uk: B<--permanent> [B<--zone>=I<зона>] [B<--policy>=I<правило>] B<--get-description>

source: Print description\&.
uk: Вивести опис\&.

source: B<--permanent> [B<--zone>=I<zone>] [B<--policy>=I<policy>] B<--set-short>=I<description>
uk: B<--permanent> [B<--zone>=I<зона>] [B<--policy>=I<правило>] B<--set-short>=I<опис>

source: Set short description\&.
uk: Встановити короткий опис\&.

source: B<--permanent> [B<--zone>=I<zone>] [B<--policy>=I<policy>] B<--get-short>
uk: B<--permanent> [B<--zone>=I<зона>] [B<--policy>=I<правило>] B<--get-short>

source: Print short description\&.
uk: Вивести короткий опис\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--list-services>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--list-services>

source: List services added as a space separated list\&.
uk: Вивести список доданих служб як список відокремлених пробілами значень\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--add-service>=I<service> [B<--timeout>=I<timeval>]
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--add-service>=I<служба> [B<--timeout>=I<значення_часу>]

source: Add a service\&. This option can be specified multiple times\&. If a timeout is supplied, the rule will be active for the specified amount of time and will be removed automatically afterwards\&. I<timeval> is either a number (of seconds) or number followed by one of characters I<s> (seconds), I<m> (minutes), I<h> (hours), for example I<20m> or I<1h>\&.
uk: Додати службу\&. Цей параметр можна вказувати декілька разів в одній команді\&. Якщо вказано значення часу очікування, правило буде активним протягом вказаного періоду часу, а потім його буде автоматично вилучено\&. Значення I<значення_часу> можна вказати або як кількість (секунд) або як число, за яким вказано один із таких символів: I<s> (секунди), I<m> (хвилини), I<h> (години), приклади: I<20m> або I<1h>\&.

source: The service is one of the firewalld provided services\&. To get a list of the supported services, use B<firewall-cmd --get-services>\&.
uk: Службою є одна із служб, які надає firewalld\&. Для отримання списку підтримуваних служб скористайтеся командою B<firewall-cmd --get-services>\&.

source: The B<--timeout> option is not combinable with the B<--permanent> option\&.
uk: Параметр B<--timeout> не можна поєднувати з параметром B<--permanent>\&.

source: B<Note>: Some services define connection tracking helpers\&. Helpers that may operate in client mode (e\&.g\&. tftp) must be added to an outbound policy instead of a zone to take effect for clients\&. Otherwise the helper will not be applied to the outbound traffic\&. The related traffic, as defined by the connection tracking helper, on the return path (ingress) will be allowed by the stateful firewall rules\&.
uk: B<Зауваження>: деякі служби визначають допоміжні засоби стеження за з'єднанням\&. Допоміжні засоби, які можуть працювати у клієнтському режимі (наприклад, tftp), слід додати до правила вихідних з'єднань, а не до зони, щоб вони працювали для клієнтів\&. Якщо цього не зробити, допоміжний засіб не буде застосовано до вихідного з'єднання\&. Пов'язаний обмін даними, як це визначено допоміжним засобом стеження за з'єднанням, на зворотному шляху (вхід) буде дозволено правилами брандмауера з керуванням станом\&.

source: An example of an outbound policy for connection tracking helpers:
uk: Приклад правил для вихідних даних для допоміжних засобів стеження за з'єднанням:

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--remove-service>=I<service>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--remove-service>=I<служба>

source: Remove a service\&. This option can be specified multiple times\&.
uk: Вилучити службу\&. Цей параметр можна вказувати декілька разів в одній команді\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--query-service>=I<service>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--query-service>=I<служба>

source: Return whether I<service> has been added\&. Returns 0 if true, 1 otherwise\&.
uk: Повернути, чи було додано службу I<служба>\&. Повертає 0, якщо додано; 1, якщо не додано\&.

source: [B<--permanent>] [B<--zone>=I<zone>] [B<--permanent>] [B<--policy>=I<policy>] B<--list-ports>
uk: [B<--permanent>] [B<--zone>=I<зона>] [B<--permanent>] [B<--policy>=I<правило>] B<--list-ports>
