Repository: yurchor/uk-man-firewalld
Catalog: bind9/*.po
Languages: uk

source: B<host> [B<-aCdlnrsTUwv>] [B<-c\ >I<class>] [B<-N\ >I<ndots>] [B<-p\ >I<port>] [B<-R\ >I<number>] [B<-t\ >I<type>] [B<-W\ >I<wait>] [B<-m\ >I<flag>] [[B<-4>] | [B<-6>]] [B<-v>] [B<-V>] {name} [server]
uk: B<host> [B<-aCdlnrsTUwv>] [B<-c\ >I<клас>] [B<-N\ >I<кількість_крапок>] [B<-p\ >I<порт>] [B<-R\ >I<число>] [B<-t\ >I<тип>] [B<-W\ >I<очікування>] [B<-m\ >I<прапорець>] [[B<-4>] | [B<-6>]] [B<-v>] [B<-V>] {назва} [сервер]

source: B<host> is a simple utility for performing DNS lookups\&. It is normally used to convert names to IP addresses and vice versa\&. When no arguments or options are given, B<host> prints a short summary of its command line arguments and options\&.
uk: B<host> — проста допоміжна програма для виконання пошуків у DNS\&. Зазвичай, нею користуються для перетворення назв на IP-адреси, і навпаки\&. Якщо програмі не буде передано аргументів або параметрів, B<host> виводить коротке резюме щодо аргументів і параметрів командного рядка\&.

source: I<name> is the domain name that is to be looked up\&. It can also be a dotted-decimal IPv4 address or a colon-delimited IPv6 address, in which case B<host> will by default perform a reverse lookup for that address\&. I<server> is an optional argument which is either the name or IP address of the name server that B<host> should query instead of the server or servers listed in /etc/resolv\&.conf\&.
uk: Значенням I<назва> має бути назва домену, пошук якої слід виконати\&. Ним також може бути IPv4-адреса із розділених крапками десяткових блоків або IPv6-адреса із розділених двокрапками блоків. У цьому випадку B<host> типово виконуватиме зворотний пошук для цієї адреси\&. Значенням I<сервер> є необов'язковий аргумент, яким є назва або IP-адреса сервера назв, який B<host> має опитати замість сервера або серверів зі списку у файлі /etc/resolv\&.conf\&.

source: Use IPv4 only for query transport\&. See also the B<-6> option\&.
uk: Використати IPv4 лише для обміну даними щодо запиту\&. Див. також параметр B<-6>\&.

source: Use IPv6 only for query transport\&. See also the B<-4> option\&.
uk: Використати IPv6 лише для обміну даними щодо запиту\&. Див. також параметр B<-4>\&.

source: "All"\&. The B<-a> option is normally equivalent to B<-v -t >B<ANY>\&. It also affects the behaviour of the B<-l> list zone option\&.
uk: «Усі»\&. Параметр B<-a>, зазвичай, еквівалентний до B<-v -t >B<ANY>\&. Також впливає на поведінку параметра списку зон B<-l>\&.

source: Query class: This can be used to lookup HS (Hesiod) or CH (Chaosnet) class resource records\&. The default class is IN (Internet)\&.
uk: Клас запиту: цим можна скористатися для пошуку записів ресурсів класу HS (Hesiod) або CH (Chaosnet)\&. Типовим класом є IN (Internet)\&.

source: Check consistency: B<host> will query the SOA records for zone I<name> from all the listed authoritative name servers for that zone\&. The list of name servers is defined by the NS records that are found for the zone\&.
uk: Перевірити узгодженість: B<host> виконає запит щодо записів SOA для зони I<назва> з усіх уповноважених серверів назв зі списку для цієї зони\&. Список серверів назв визначається за записами NS, які буде знайдено для зони\&.

source: Print debugging traces\&. Equivalent to the B<-v> verbose option\&.
uk: Вивести діагностичне трасування\&. Те саме, що і параметр докладності B<-v>\&.

source: Obsolete\&. Use the IP6\&.INT domain for reverse lookups of IPv6 addresses as defined in RFC1886 and deprecated in RFC4159\&. The default is to use IP6\&.ARPA as specified in RFC3596\&.
uk: Застарілий\&. Скористайтеся доменом IP6\&.INT для зворотного пошуку адрес IPv6, як їх визначено у RFC1886\&. Такий пошук визнано застарілим у RFC4159\&. Типовим є використання IP6\&.ARPA, як це визначено у RFC3596\&.

source: List zone: The B<host> command performs a zone transfer of zone I<name> and prints out the NS, PTR and address records (A/AAAA)\&.
uk: Вивести список зони: команда B<host> виконує передавання зон зони I<назва> і виводить NS, PTR і записи адрес (A/AAAA)\&.

source: Together, the B<-l -a> options print all records in the zone\&.
uk: Разом, параметри B<-l -a> призводять до виведення усіх записів у зоні\&.

source: -N I<ndots>
uk: -N I<кількість_крапок>

source: The number of dots that have to be in I<name> for it to be considered absolute\&. The default value is that defined using the ndots statement in /etc/resolv\&.conf, or 1 if no ndots statement is present\&. Names with fewer dots are interpreted as relative names and will be searched for in the domains listed in the B<search> or B<domain> directive in /etc/resolv\&.conf\&.
uk: Кількість крапок, які мають бути у назві I<назва>, щоб її можна було розглядати як абсолютну\&. Типовим значенням є значення, яке визначено інструкцією ndots в /etc/resolv\&.conf, або 1, якщо інструкції ndots у цьому файлі немає\&. Назви із меншою кількістю точок вважатимуться відносними назвами\&. Ці назви буде використано для пошуку у доменах зі списку в інструкції B<search> або B<domain> у файлі /etc/resolv\&.conf\&.

source: Specify the port on the server to query\&. The default is 53\&.
uk: Вказати порт на сервері для запиту\&. Типовим є 53\&.

source: Non-recursive query: Setting this option clears the RD (recursion desired) bit in the query\&. This should mean that the name server receiving the query will not attempt to resolve I<name>\&. The B<-r> option enables B<host> to mimic the behavior of a name server by making non-recursive queries and expecting to receive answers to those queries that can be referrals to other name servers\&.
uk: Нерекурсивний запит: встановлення цього параметра знімає біт RD (recursion desired або «бажана рекурсія») у запиті\&. Це має означати, що сервер назв, що отримає запит, не намагатиметься визначити адресу назви I<назва>\&. Параметр B<-r> уможливлює для B<host> імітацію поведінки сервера назв шляхом створення нерекурсивних запитів та очікування отримання відповідей на ці запити, які можуть бути спрямуваннями на інші сервери назв\&.

source: -R I<number>
uk: -R I<число>

source: Number of retries for UDP queries: If I<number> is negative or zero, the number of retries will default to 1\&. The default value is 1, or the value of the I<attempts> option in /etc/resolv\&.conf, if set\&.
uk: Кількість повторних спроб для запитів UDP: якщо I<число> є від'ємним або нульовим, типовою кількістю повторних спроб є 1\&. Типовим є значення 1 або значення параметра I<attempts> у файлі /etc/resolv\&.conf, якщо його встановлено\&.

source: Do I<not> send the query to the next nameserver if any server responds with a SERVFAIL response, which is the reverse of normal stub resolver behavior\&.
uk: I<Не> надсилати запит до наступного сервера назв, якщо якийсь сервер відповідає SERVFAIL, тобто обернена поведінка щодо звичайної поведінки фіктивного засобу визначення адрес\&.

source: Query type: The I<type> argument can be any recognized query type: CNAME, NS, SOA, TXT, DNSKEY, AXFR, etc\&.
uk: Тип запиту: аргумент I<тип> може бути будь-яким розпізнаваним типом запиту: CNAME, NS, SOA, TXT, DNSKEY, AXFR тощо\&.

source: When no query type is specified, B<host> automatically selects an appropriate query type\&. By default, it looks for A, AAAA, and MX records\&. If the B<-C> option is given, queries will be made for SOA records\&. If I<name> is a dotted-decimal IPv4 address or colon-delimited IPv6 address, B<host> will query for PTR records\&.
uk: Якщо тип запиту не вказано, B<host> автоматично вибере відповідний тип запиту\&. Типово, програма шукатиме записи A, AAAA і MX\&. Якщо задано параметр B<-C>, буде виконано запити щодо записів SOA\&. Якщо назвою I<назва> є адреса IPv4 із відокремленими крапками блоками або адреса IPv6 із відокремленими двокрапками блоками, B<host> виконає запит щодо записів PTR\&.

source: If a query type of IXFR is chosen the starting serial number can be specified by appending an equal followed by the starting serial number (like B<-t >B<IXFR=12345678>)\&.
uk: Якщо вибрано тип запиту IXFR, початковий серійний номер можна вказати дописуванням знаку «дорівнює» з наступним початковим серійним номером (приклад: B<-t >B<IXFR=12345678>)\&.

source: TCP/UDP: By default, B<host> uses UDP when making queries\&. The B<-T> option makes it use a TCP connection when querying the name server\&. TCP will be automatically selected for queries that require it, such as zone transfer (AXFR) requests\&. Type ANY queries default to TCP but can be forced to UDP initially using B<-U>\&.
uk: TCP/UDP: типово, B<host> використовує UDP при виконанні запитів\&. Параметр B<-T> наказує програмі використати з'єднання TCP при опитуванні сервера назв\&. TCP буде автоматично вибрано для запитів, які його потребують, зокрема запитів щодо перенесення зори (AXFR)\&. Типовим для запитів ANY є TCP, але можна від початку примусово визначити для них UDP за допомогою параметра B<-U>\&.

source: -m I<flag>
uk: -m I<прапорець>

source: Memory usage debugging: the flag can be I<record>, I<usage>, or I<trace>\&. You can specify the B<-m> option more than once to set multiple flags\&.
uk: Діагностика щодо використання пам'яті: прапорцем може бути I<record>, I<usage> або I<trace>\&. Ви можете вказати параметр B<-m> декілька разів, щоб встановити декілька прапорців\&.

source: Verbose output\&. Equivalent to the B<-d> debug option\&. Verbose output can also be enabled by setting the I<debug> option in /etc/resolv\&.conf\&.
uk: Докладний режим виведення\&. Те саме, що і параметр діагностики B<-d>\&. Докладне виведення також можна увімкнути встановленням параметра I<debug> у файлі /etc/resolv\&.conf\&.

source: Wait forever: The query timeout is set to the maximum possible\&. See also the B<-W> option\&.
uk: Очікувати без обмежень: час очікування на запит буде встановлено у максимальне можливе значення\&. Див. також параметр B<-W>\&.

source: -W I<wait>
uk: -W I<очікування>

source: Timeout: Wait for up to I<wait> seconds for a reply\&. If I<wait> is less than one, the wait interval is set to one second\&.
uk: Час очікування: очікувати на відповідь, аж до I<очікування> секунд\&. Якщо значення I<очікування> є меншим за одиницю, інтервал очікування буде встановлено у одну секунду\&.

source: By default, B<host> will wait for 5 seconds for UDP responses and 10 seconds for TCP connections\&. These defaults can be overridden by the I<timeout> option in /etc/resolv\&.conf\&.
uk: Типово, B<host> чекатиме 5 секунд на відповіді UDP і 10 секунд на з'єднання TCP\&. Ці типові значення може бути перевизначено за допомогою параметра I<timeout> у файлі /etc/resolv\&.conf\&.

source: See also the B<-w> option\&.
uk: Див. також параметр B<-w>\&.

source: If B<host> has been built with IDN (internationalized domain name) support, it can accept and display non-ASCII domain names\&. B<host> appropriately converts character encoding of domain name before sending a request to DNS server or displaying a reply from the server\&. If you\*(Aqd like to turn off the IDN support for some reason, define the B<IDN_DISABLE> environment variable\&. The IDN support is disabled if the variable is set when B<host> runs\&.
uk: Якщо B<host> було зібрано з підтримкою IDN (internationalized domain name або інтернаціоналізованих назв доменів), програма може приймати або показувати назви доменів, що містять символи поза ASCII\&. B<host> відповідним чином перетворює кодування символів назви домену до надсилання запиту до сервера DNS або показу відповіді від сервера\&. Якщо з певної причини ви хочете вимкнути підтримку IDN, визначте змінну середовища B<IDN_DISABLE>\&. Підтримку IDN буде вимкнено, якщо значення змінної встановлено на момент запуску B<host>\&.

source: Copyright \(co 2000-2002, 2004, 2005, 2007-2009, 2014-2022 Internet Systems Consortium, Inc. ("ISC")
uk: \(co Internet Systems Consortium, Inc. ("ISC"), 2000-2002, 2004, 2005, 2007-2009, 2014-2022

source: nslookup - query Internet name servers interactively
uk: nslookup — інтерактивне опитування серверів назв інтернету

source: B<nslookup> [B<-option>] [name\ |\ -] [server]
uk: B<nslookup> [B<-параметр>] [назва\ |\ -] [сервер]

source: B<Nslookup> is a program to query Internet domain name servers\&. B<Nslookup> has two modes: interactive and non-interactive\&. Interactive mode allows the user to query name servers for information about various hosts and domains or to print a list of hosts in a domain\&. Non-interactive mode is used to print just the name and requested information for a host or domain\&.
uk: B<Nslookup> — програма для опитування серверів назв доменів інтернету\&. B<Nslookup> працює у двох режимах: інтерактивному і неінтерактивному\&. В інтерактивному режимі користувач може надсилати запити на сервери назв щодо відомостей про різноманітні вузли і домени або наказати програмі вивести список вузлів у домені\&. У неінтерактивному режимі програмою можна скористатися для виведення назви і потрібних відомостей щодо вузла або домену\&.

source: ARGUMENTS
uk: АРГУМЕНТ

source: Interactive mode is entered in the following cases:
uk: Програма входить до інтерактивного режиму у таких випадках:

source: when no arguments are given (the default name server will be used)
uk: якщо аргумент не задано (буде використано типовий сервер назв)

source: when the first argument is a hyphen (-) and the second argument is the host name or Internet address of a name server\&.
uk: якщо першим аргументом є дефіс (-), другим аргументом є назва вузла або інтернет-адреса сервера назв\&.

source: Non-interactive mode is used when the name or Internet address of the host to be looked up is given as the first argument\&. The optional second argument specifies the host name or address of a name server\&.
uk: Неінтерактивний режим використовують, коли назву або інтернет-адресу вузла, пошук якого відбувається, задано як перший аргумент\&. Необов'язковий другий аргумент вказує назву або адресу вузла сервера назв\&.

source: Options can also be specified on the command line if they precede the arguments and are prefixed with a hyphen\&. For example, to change the default query type to host information, and the initial timeout to 10 seconds, type:
uk: Можна також вказати параметри командного рядка: їх слід розташовувати перед аргументами і додавати перед ними дефіс\&. Наприклад, щоб змінити стандартний тип запиту на отримання даних щодо вузла та встановити початковий час очікування на дані у 10 секунд, введіть таку команду:

source: The B<-version> option causes B<nslookup> to print the version number and immediately exits\&.
uk: Використання параметра B<-version> призведе до виведення B<nslookup> номера версії і негайного завершення роботи програми після цього\&.

source: INTERACTIVE COMMANDS
uk: ІНТЕРАКТИВНІ КОМАНДИ

source: B<host> [server]
uk: B<host> [сервер]

source: Look up information for host using the current default server or using server, if specified\&. If host is an Internet address and the query type is A or PTR, the name of the host is returned\&. If host is a name and does not have a trailing period, the search list is used to qualify the name\&.
uk: Шукати відомості щодо вузла за допомогою поточного типового сервера або за допомогою вказаного сервера\&. Якщо вузол є інтернет-адресою і типом запиту є A або PTR, буде повернуто назву вузла\&. Якщо вузол вказано за назвою без кінцевої крапки, для кваліфікації назви буде використано список пошуку\&.

source: To look up a host not in the current domain, append a period to the name\&.
uk: Для пошуку вузла, який не перебуває у поточному домені, допишіть крапку до назви\&.

source: B<server> I<domain>
uk: B<server> I<домен>

source: B<lserver> I<domain>
uk: B<lserver> I<домен>

source: Change the default server to I<domain>; B<lserver> uses the initial server to look up information about I<domain>, while B<server> uses the current default server\&. If an authoritative answer can\*(Aqt be found, the names of servers that might have the answer are returned\&.
uk: Змінити типовий сервер на I<домен>; варіант B<lserver> призведе до використання початкового сервера для пошуку відомостей щодо I<домену>, а варіант B<server> — до використання поточного типового сервера\&. Якщо не вдасться знайти уповноваженої відповіді, буде повернуто назви серверів, які можуть мати відповідь\&.

source: not implemented
uk: не реалізовано

source: Exits the program\&.
uk: Завершує роботу програми\&.

source: B<set> I<keyword>I<[=value]>
uk: B<set> I<ключове_слово>I<[=значення]>

source: This command is used to change state information that affects the lookups\&. Valid keywords are:
uk: Цю команду використовують для зміни даних щодо стану, які впливають на пошук\&. Коректні ключові слова:

source: Prints the current values of the frequently used options to B<set>\&. Information about the current default server and host is also printed\&.
uk: Вивести поточні значення часто використовуваних параметрів до B<set>\&. Також буде виведено відомості щодо поточного типового сервера і вузла\&.

source: B<class=>I<value>
uk: B<class=>I<значення>

source: Change the query class to one of:
uk: Змінити клас запиту на один з таких:

source: the Internet class
uk: клас Internet

source: the Chaos class
uk: клас Chaos

source: the Hesiod class
uk: клас Hesiod

source: The class specifies the protocol group of the information\&.
uk: Клас визначає групу протоколів для даних\&.

source: (Default = IN; abbreviation = cl)
uk: (Типове значення = IN; скорочення = cl)

source: Turn on or off the display of the full response packet and any intermediate response packets when searching\&.
uk: Увімкнути або вимкнути показ повного пакета відповіді та усіх проміжних пакетів відповіді при пошуку\&.

source: (Default = nodebug; abbreviation = [no]deb)
uk: (Типове значення = nodebug; скорочення = [no]deb)

source: Turn debugging mode on or off\&. This displays more about what nslookup is doing\&.
uk: Увімкнути або вимкнути режим діагностики\&. Так можна увімкнути показ додаткових даних щодо дій nslookup\&.

source: (Default = nod2)
uk: (Типове значення = nod2)

source: B<domain=>I<name>
uk: B<domain=>I<назва>

source: Sets the search list to I<name>\&.
uk: Встановити список пошуку у значення I<назва>\&.

source: If the lookup request contains at least one period but doesn\*(Aqt end with a trailing period, append the domain names in the domain search list to the request until an answer is received\&.
uk: Якщо запит щодо пошуку містить принаймні одну крапку, але не завершується крапкою, дописувати назви доменів зі списку пошуку доменів до запиту, аж доки не буде отримано відповіді\&.

source: (Default = search)
uk: (Типове значення = search)

source: B<port=>I<value>
uk: B<port=>I<значення>

source: Change the default TCP/UDP name server port to I<value>\&.
uk: Змінити типовий порт сервера назв TCP/UDP на порт із номером I<значення>\&.

source: (Default = 53; abbreviation = po)
uk: (Типове значення = 53; скорочення = po)

source: B<querytype=>I<value>
uk: B<querytype=>I<значення>

source: B<type=>I<value>
uk: B<type=>I<значення>

source: Change the type of the information query\&.
uk: Змінити тип інформаційного запиту\&.

source: (Default = A and then AAAA; abbreviations = q, ty)
uk: (Типове значення = A, а потім AAAA; скорочення = q, ty)

source: B<Note:> It is only possible to specify one query type, only the default behavior looks up both when an alternative is not specified\&.
uk: B<Зауваження:> можна вказувати лише один тип запиту, лише типова поведінка призводить до пошуку за обома, якщо не вказано альтернативу\&.

source: Tell the name server to query other servers if it does not have the information\&.
uk: Наказати серверу назв опитати інші сервери, якщо на ньому немає даних\&.

source: (Default = recurse; abbreviation = [no]rec)
uk: (Типове значення = recurse; скорочення = [no]rec)

source: B<ndots=>I<number>
uk: B<ndots=>I<кількість>

source: Set the number of dots (label separators) in a domain that will disable searching\&. Absolute names always stop searching\&.
uk: Встановити кількість крапок (роздільників міток) у домені, яка вимикає пошук\&. Для абсолютних назв пошук припиняється завжди\&.

source: B<retry=>I<number>
uk: B<retry=>I<число>

source: Set the number of retries to number\&.
uk: Встановити кількість повторних спроб\&.

source: B<timeout=>I<number>
uk: B<timeout=>I<число>

source: Change the initial timeout interval for waiting for a reply to number seconds\&.
uk: Змінити початковий час очікування на відповідь у секундах\&.

source: Always use a virtual circuit when sending requests to the server\&.
uk: Завжди використовувати віртуальне коло при надсиланні запитів на сервер\&.

source: (Default = novc)
uk: (Типове значення = novc)

source: Try the next nameserver if a nameserver responds with SERVFAIL or a referral (nofail) or terminate query (fail) on such a response\&.
uk: Спробувати наступний сервер назв, якщо сервер назв відповідає SERVFAIL, спрямуванням (nofail) або перериванням запиту (fail) при такій відповіді\&.

source: (Default = nofail)
uk: (Типове значення = nofail)

source: RETURN VALUES
uk: ПОВЕРНЕНІ ЗНАЧЕННЯ

source: B<nslookup> returns with an exit status of 1 if any query failed, and 0 otherwise\&.
uk: B<nslookup> повертає керування зі станом виходу 1, якщо сталася якась помилка запиту, і станом виходу 0 в інших випадках\&.

source: If B<nslookup> has been built with IDN (internationalized domain name) support, it can accept and display non-ASCII domain names\&. B<nslookup> appropriately converts character encoding of domain name before sending a request to DNS server or displaying a reply from the server\&. If you\*(Aqd like to turn off the IDN support for some reason, define the B<IDN_DISABLE> environment variable\&. The IDN support is disabled if the variable is set when B<nslookup> runs or when the standard output is not a tty\&.
uk: Якщо B<nslookup> було зібрано з підтримкою IDN (internationalized domain name або інтернаціоналізованих назв доменів), програма може приймати або показувати назви доменів, що містять символи поза ASCII\&. B<nslookup> відповідним чином перетворює кодування символів назви домену до надсилання запиту до сервера DNS або показу відповіді від сервера\&. Якщо з певної причини ви хочете вимкнути підтримку IDN, визначте змінну середовища B<IDN_DISABLE>\&. Підтримку IDN буде вимкнено, якщо значення змінної встановлено на момент запуску B<nslookup>, або якщо стандартним виведенням не є термінал (tty)\&.

source: If B<nslookup> has been built with IDN (internationalized domain name) support, it can accept and display non-ASCII domain names\&. B<nslookup> appropriately converts character encoding of domain name before sending a request to DNS server or displaying a reply from the server\&. If you\*(Aqd like to turn off the IDN support for some reason, define the B<IDN_DISABLE> environment variable\&. The IDN support is disabled if the variable is set when B<nslookup> runs\&.
uk: Якщо B<nslookup> було зібрано з підтримкою IDN (internationalized domain name або інтернаціоналізованих назв доменів), програма може приймати або показувати назви доменів, що містять символи поза ASCII\&. B<nslookup> відповідним чином перетворює кодування символів назви домену до надсилання запиту до сервера DNS або показу відповіді від сервера\&. Якщо з певної причини ви хочете вимкнути підтримку IDN, визначте змінну середовища B<IDN_DISABLE>\&. Підтримку IDN буде вимкнено, якщо значення змінної встановлено на момент запуску B<nslookup>\&.

source: Copyright \(co 2004-2007, 2010, 2013-2022 Internet Systems Consortium, Inc. ("ISC")
uk: \(co Internet Systems Consortium, Inc. ("ISC"), 2004-2007, 2010, 2013-2022
