Repository: yurchor/uk-man-firewalld
Catalog: bind9/*.po
Languages: uk

source: Set the DSCP code point to be used when sending the query\&. Valid DSCP code points are in the range [0\&.\&.63]\&. By default no code point is explicitly set\&.
uk: Встановити кодову точку DSCP, якою слід скористатися при надсиланні запиту\&. Коректні кодові точки DSCP належать діапазону [0\&.\&.63]\&. Типово, програма не встановлює явним чином жодної кодової точки\&.

source: Specify the EDNS version to query with\&. Valid values are 0 to 255\&. Setting the EDNS version will cause a EDNS query to be sent\&. B<+noedns> clears the remembered EDNS version\&. EDNS is set to 0 by default\&.
uk: Вказати версію EDNS для надсилання запиту\&. Коректними є значення від 0 до 255\&. Встановлення версії EDNS призведе до надсилання запиту EDNS\&. Використання B<+noedns> призведе до вилучення раніше збереженої версії EDNS\&. Типовим значенням EDNS є 0\&.

source: Set the must-be-zero EDNS flags bits (Z bits) to the specified value\&. Decimal, hex and octal encodings are accepted\&. Setting a named flag (e\&.g\&. DO) will silently be ignored\&. By default, no Z bits are set\&.
uk: Встановити для бітів прапорців must-be-zero EDNS (Z-біти) вказане значення\&. Значення може бути закодовано у десятковому, шістнадцятковому та вісімковому форматах\&. Встановлення прапорця іменування (наприклад, DO) буде без повідомлень проігноровано\&. Типово, Z-біти не встановлено\&.

source: Enable / disable EDNS version negotiation\&. By default EDNS version negotiation is enabled\&.
uk: Увімкнути або вимкнути узгодження версії EDNS\&. Типово, узгодження версії EDNS увімкнено\&.

source: B<+[no]ednsopt[=code[:value]]>
uk: B<+[no]ednsopt[=код[:значення]]>

source: Specify EDNS option with code point B<code> and optionally payload of B<value> as a hexadecimal string\&. B<code> can be either an EDNS option name (for example, NSID or ECS), or an arbitrary numeric value\&. B<+noednsopt> clears the EDNS options to be sent\&.
uk: Вказати параметр EDNS із кодовою точкою B<код> і, необов'язково, вміст B<значення> у форматі шістнадцяткового рядка\&. Значенням B<код> може бути або назва параметра EDNS (наприклад, NSID або ECS), або довільне числове значення\&. Використання B<+noednsopt> вилучає параметри EDNS, які має бути надіслано\&.

source: Send an EDNS Expire option\&.
uk: Надіслати параметр Expire EDNS\&.

source: Do not try the next server if you receive a SERVFAIL\&. The default is to not try the next server which is the reverse of normal stub resolver behavior\&.
uk: Не намагатися скористатися наступним сервером, якщо отримано SERVFAIL\&. Типово, програма не намагатиметься скористатися наступним сервером, що є оберненою щодо звичайної поведінки фіктивного засобу визначення адрес\&.

source: Send a query with a DNS header without a question section\&. The default is to add a question section\&. The query type and query name are ignored when this is set\&.
uk: Надіслати запит із заголовком DNS без розділу питання\&. Типовим є додавання розділу питання\&. Якщо встановлено, тип запиту і назву запиту буде проігноровано\&.

source: Show [or do not show] the IP address and port number that supplied the answer when the I<+short> option is enabled\&. If short form answers are requested, the default is not to show the source address and port number of the server that provided the answer\&.
uk: Вивести [або не виводити] IP-адресу і номер порту, з яких надано відповідь, якщо увімкнено параметр I<+short>\&. Якщо надіслано запит на відповіді у короткій формі, типово, програма не виводитиме початкової адреси та номера порту сервера, який надав відповідь\&.

source: Process [do not process] IDN domain names on input\&. This requires IDN SUPPORT to have been enabled at compile time\&.
uk: Обробляти [не обробляти] назви доменів IDN на вході\&. Потребує вмикання IDN SUPPORT під час збирання програми\&.

source: The default is to process IDN input when standard output is a tty\&. The IDN processing on input is disabled when dig output is redirected to files, pipes, and other non-tty file descriptors\&.
uk: Типовою є обробка входу IDN, якщо стандартне виведення відбувається на термінал\&. Обробку IDN на вході буде вимкнено, якщо виведення dig переспрямовано до файлів, каналів та інших дескрипторів файлів, які не пов'язано із терміналами\&.

source: Convert [do not convert] puny code on output\&. This requires IDN SUPPORT to have been enabled at compile time\&.
uk: Перетворити [не перетворювати] виведені дані з використанням punycode\&. Потребує вмикання IDN SUPPORT під час збирання програми\&.

source: The default is to process puny code on output when standard output is a tty\&. The puny code processing on output is disabled when dig output is redirected to files, pipes, and other non-tty file descriptors\&.
uk: Типовою є обробка з використанням punicode, якщо стандартне виведення відбувається на термінал\&. Обробку з використанням punicode при виведенні буде вимкнено, якщо виведення dig переспрямовано до файлів, каналів та інших дескрипторів файлів, які не пов'язано із терміналами\&.

source: Ignore truncation in UDP responses instead of retrying with TCP\&. By default, TCP retries are performed\&.
uk: Ігнорувати обрізання у відповідях UDP, замість виконання повторних спроб з використанням TCP\&. Типово, буде виконано повторні спроби з TCP\&.

source: Keep the TCP socket open between queries and reuse it rather than creating a new TCP socket for each lookup\&. The default is B<+nokeepopen>\&.
uk: Тримати сокет TCP відкритим між запитами і повторно використовувати його, замість створення нового сокета TCP для кожного пошуку\&. Типовим варіантом є B<+nokeepopen>\&.

source: Allow mapped IPv4 over IPv6 addresses to be used\&. The default is B<+mapped>\&.
uk: Дозволити використання відображення адрес IPv4 на IPv6\&. Типовим варіантом є B<+mapped>\&.

source: Print records like the SOA records in a verbose multi-line format with human-readable comments\&. The default is to print each record on a single line, to facilitate machine parsing of the B<dig> output\&.
uk: Виводити записи, подібні до записів SOA, у докладному багаторядковому форматі зі зручними для читання коментарями\&. Типовим є виведення кожного запису в окремому рядку, для полегшення комп'ютерної обробки виведених B<dig> даних\&.

source: Set the number of dots that have to appear in I<name> to I<D> for it to be considered absolute\&. The default value is that defined using the ndots statement in /etc/resolv\&.conf, or 1 if no ndots statement is present\&. Names with fewer dots are interpreted as relative names and will be searched for in the domains listed in the B<search> or B<domain> directive in /etc/resolv\&.conf if B<+search> is set\&.
uk: Встановити для кількості крапок у назві I<назва> значення I<D>, щоб її можна було розглядати як абсолютну\& Типовим значенням є значення, яке визначено інструкцією ndots в /etc/resolv\&.conf, або 1, якщо інструкції ndots у цьому файлі немає\&. Назви із меншою кількістю точок вважатимуться відносними назвами\&. Ці назви буде використано для пошуку у доменах зі списку в інструкції B<search> або B<domain> у файлі /etc/resolv\&.conf, якщо встановлено B<+search>\&.

source: Include an EDNS name server ID request when sending a query\&.
uk: Включити запит щодо ідентифікатора сервера назв EDNS при надсиланні запиту\&.

source: When this option is set, B<dig> attempts to find the authoritative name servers for the zone containing the name being looked up and display the SOA record that each name server has for the zone\&.
uk: Якщо встановлено цей параметр, B<dig> спробує знайти уповноважені сервери назв для зони, що містить назву, пошук якої виконується, і виведе запис SOA, який має кожне сервер назв для зони\&.

source: Print only one (starting) SOA record when performing an AXFR\&. The default is to print both the starting and ending SOA records\&.
uk: Вивести лише один (початковий) запис SOA при виконанні AXFR\&. Типово, програма виведе і початковий, і кінцевий записи SOA\&.

source: B<+[no]opcode=value>
uk: B<+[no]opcode=значення>

source: Set [restore] the DNS message opcode to the specified value\&. The default value is QUERY (0)\&.
uk: Встановити [відновити] для коду дії повідомлення DNS вказане значення\&. Типовим значенням є QUERY (0)\&.

source: Toggles the display of the query message as it is sent\&. By default, the query is not printed\&.
uk: Увімкнути або вимкнути виведення повідомлення запиту так, як його було надіслано\&. Типово, запит не буде виведено\&.

source: Toggles the display of the question section of a query when an answer is returned\&. The default is to print the question section as a comment\&.
uk: Вмикає або вимикає виведення розділу питання запиту, якщо повернуто відповідь\&. Типово, розділ питання буде виведено як коментар\&.

source: A synonym for I<+[no]recurse>\&.
uk: Синонім I<+[no]recurse>\&.

source: Toggle the setting of the RD (recursion desired) bit in the query\&. This bit is set by default, which means B<dig> normally sends recursive queries\&. Recursion is automatically disabled when using the I<+nssearch> option, and when using I<+trace> except for an initial recursive query to get the list of root servers\&.
uk: Увімкнути або вимкнути встановлення біта RD (бажана рекурсія) у запиті\&. Типово, це біт встановлено, що означає, що B<dig> надсилатиме рекурсивні запити\&. Рекурсію буде автоматично вимкнено, якщо використано параметр I<+nssearch> і при використанні I<+trace>, окрім початкового рекурсивного запиту для отримання списку кореневих серверів\&.

source: Sets the number of times to retry UDP queries to server to I<T> instead of the default, 2\&. Unlike I<+tries>, this does not include the initial query\&.
uk: Встановити для кількості повторних спроб запитів UDP до сервера значення I<T>, замість типового, 2\&. На відміну від I<+tries>, початковий запит включено не буде\&.

source: Toggle the display of per-record comments in the output (for example, human-readable key information about DNSKEY records)\&. The default is not to print record comments unless multiline mode is active\&.
uk: Увімкнути або вимкнути виведення коментарів для окремих записів (наприклад, зручних для читання відомостей щодо ключа для записів DNSKEY)\&. Типово, якщо не увімкнено багаторядковий режим, виведення коментарів до записів не відбуватиметься\&.

source: Use [do not use] the search list defined by the searchlist or domain directive in resolv\&.conf (if any)\&. The search list is not used by default\&.
uk: Використати [не використовувати] список пошуку, який визначено інструкцією searchlist або domain у resolv\&.conf (якщо такі існують)\&. Типово, список пошуку використано не буде\&.

source: \*(Aqndots\*(Aq from resolv\&.conf (default 1) which may be overridden by I<+ndots> determines if the name will be treated as relative or not and hence whether a search is eventually performed or not\&.
uk: \*(Aqndots\*(Aq з resolv\&.conf (типове значення — 1), яке можна перевизначити за допомогою I<+ndots>, визначає, чи вважатиметься назва відносною, а отже, чи буде врешті виконано пошук\&.

source: Provide a terse answer\&. The default is to print the answer in a verbose form\&. This option always has global effect; it cannot be set globally and then overridden on a per-lookup basis\&.
uk: Надати коротку відповідь\&. Типовим є виведення відповіді у докладній формі\&. Цей параметр завжди працює на загальному рівні; не можна встановити його на загальному рівні, а потім перевизначити для окремого пошуку\&.

source: Perform [do not perform] a search showing intermediate results\&.
uk: Виконати [не виконувати] пошук із показом проміжних результатів\&.

source: Chase DNSSEC signature chains\&. Requires dig be compiled with -DDIG_SIGCHASE\&. This feature is deprecated\&. Use B<delv> instead\&.
uk: Переходити ланцюжками підписів DNSSEC\&. Потребує збирання dig з -DDIG_SIGCHASE\&. Ця можливість вважається застарілою\&. Користуйтеся замість неї B<delv>\&.

source: Split long hex- or base64-formatted fields in resource records into chunks of I<W> characters (where I<W> is rounded up to the nearest multiple of 4)\&. I<+nosplit> or I<+split=0> causes fields not to be split at all\&. The default is 56 characters, or 44 characters when multiline mode is active\&.
uk: Поділити довгі шістнадцяткові поля або поля у форматі base64 у записах ресурсів на фрагменти у I<W> символів (де I<W> буде округлено вгору до найближчого кратного до 4 цілого числа)\&. I<+nosplit> або I<+split=0> призведе до того, що поля не ділитимуться взагалі\&. Типовим є значення у 56 символів або 44 символи, якщо увімкнено багаторядковий режим\&.

source: Toggles the printing of statistics: when the query was made, the size of the reply and so on\&. The default behavior is to print the query statistics as a comment after each lookup\&.
uk: Увімкнути або вимкнути виведення статистичних даних: при виконанні запиту, розміру відповіді тощо\&. Типовим є виведення статистики запиту у форматі коментаря після кожного пошуку\&.

source: B<+[no]subnet=addr[/prefix-length]>
uk: B<+[no]subnet=адреса[/довжина-префікса]>

source: Send (don\*(Aqt send) an EDNS Client Subnet option with the specified IP address or network prefix\&.
uk: Надіслати (не надсилати) параметр підмережі клієнта EDNS із вказаною IP-адресою і префіксом мережі\&.

source: B<dig +subnet=0\&.0\&.0\&.0/0>, or simply B<dig +subnet=0> for short, sends an EDNS CLIENT-SUBNET option with an empty address and a source prefix-length of zero, which signals a resolver that the client\*(Aqs address information must I<not> be used when resolving this query\&.
uk: B<dig +subnet=0\&.0\&.0\&.0/0> або просто B<dig +subnet=0> надсилає параметр EDNS CLIENT-SUBNET із порожньою адресою і нульовою довжиною префікса джерела, що сигналізує засобу пошуку, що I<не> слід користуватися даними щодо адреси клієнта при обробці цього запиту\&.

source: Use [do not use] TCP when querying name servers\&. The default behavior is to use UDP unless a type any or ixfr=N query is requested, in which case the default is TCP\&. AXFR queries always use TCP\&.
uk: Використати [не використовувати] TCP при опитуванні серверів назв\&. Типовою поведінкою є використання UDP, якщо не використано запит типу any або ixfr=N, для яких типовим є TCP\&. Для запитів AXFR завжди використовують TCP\&.

source: Sets the timeout for a query to I<T> seconds\&. The default timeout is 5 seconds\&. An attempt to set I<T> to less than 1 will result in a query timeout of 1 second being applied\&.
uk: Встановити для часу очікування на результати запиту значення у I<T> секунд\&. Типовим є час очікування у 5 секунд\&. Спроби встановити для I<T> значення, яке є меншим за 1, призведуть до встановлення часу очікування на результати запиту в 1 секунду\&.

source: When chasing DNSSEC signature chains perform a top-down validation\&. Requires dig be compiled with -DDIG_SIGCHASE\&. This feature is deprecated\&. Use B<delv> instead\&.
uk: При переході ланцюжками підписів DNSSEC виконувати перевірку згори-вниз\&. Потребує збирання dig з -DDIG_SIGCHASE\&. Ця можливість вважається застарілою\&. Користуйтеся замість неї B<delv>\&.

source: Toggle tracing of the delegation path from the root name servers for the name being looked up\&. Tracing is disabled by default\&. When tracing is enabled, B<dig> makes iterative queries to resolve the name being looked up\&. It will follow referrals from the root servers, showing the answer from each server that was used to resolve the lookup\&.
uk: Увімкнути або вимкнути трасування шляху делегування від кореневих серверів назв для назви, пошук якої виконується\&. Типово, трасування вимкнено\&. Якщо трасування увімкнено, B<dig> виконуватиме ітеративні запити для назви, пошук даних якої виконується\&. Програма йтиме за спрямуваннями від кореневих серверів, виводячи дані кожного сервера, який було використано для виконання пошуку\&.

source: If @server is also specified, it affects only the initial query for the root zone name servers\&.
uk: Якщо також вказано @сервер, стосуватиметься лише початкового запису щодо серверів назв кореневої зони\&.

source: B<+dnssec> is also set when +trace is set to better emulate the default queries from a nameserver\&.
uk: B<+dnssec> також буде встановлено, якщо встановлено +trace, щоб краще імітувати типові запити від сервера назв\&.

source: Sets the number of times to try UDP queries to server to I<T> instead of the default, 3\&. If I<T> is less than or equal to zero, the number of tries is silently rounded up to 1\&.
uk: Встановити для кількості повторних спроб запитів UDP до сервера значення I<T>, замість типового, 3\&. Якщо значення I<T> є меншим за нуль або рівним нулеві, кількість спроб без повідомлень буде змінено на 1\&.

source: Specifies a file containing trusted keys to be used with B<+sigchase>\&. Each DNSKEY record must be on its own line\&.
uk: Визначає файл, який містить довірені ключів, які слід використовувати з B<+sigchase>\&. Кожен запис DNSKEY має бути вказано у власному рядку\&.

source: If not specified, B<dig> will look for /etc/trusted-key\&.key then trusted-key\&.key in the current directory\&.
uk: Якщо не вказано, B<dig> шукатиме /etc/trusted-key\&.key, а потім trusted-key\&.key у поточному каталозі\&.

source: Requires dig be compiled with -DDIG_SIGCHASE\&. This feature is deprecated\&. Use B<delv> instead\&.
uk: Потребує збирання dig з -DDIG_SIGCHASE\&. Ця можливість вважається застарілою\&. Користуйтеся замість неї B<delv>\&.

source: Display [do not display] the TTL when printing the record\&.
uk: Вивести [не виводити] TTL при виведенні запису\&.

source: Display [do not display] the TTL in friendly human-readable time units of "s", "m", "h", "d", and "w", representing seconds, minutes, hours, days and weeks\&. Implies +ttlid\&.
uk: Вивести [не виводити] TTL у зручному для читанні форматі одиниць часу з «s», «m», «h», «d» і «w» на позначення секунд, хвилин, годин, днів і тижнів\&. Неявно задає +ttlid\&.

source: Print all RDATA in unknown RR type presentation format (RFC 3597)\&. The default is to print RDATA for known types in the type\*(Aqs presentation format\&.
uk: Вивести усі RDATA у форматі представлення невідомого типу RR (RFC 3597)\&. Типовим є виведення RDATA для відомих типів у форматі представлення відповідного типу\&.

source: Use [do not use] TCP when querying name servers\&. This alternate syntax to I<+[no]tcp> is provided for backwards compatibility\&. The "vc" stands for "virtual circuit"\&.
uk: Використати [не використовувати] TCP при опитуванні серверів назв\&. Цей альтернативний до I<+[no]tcp> синтаксис реалізовано для забезпечення зворотної сумісності\&. Тут «vc» є абревіатурою від «virtual circuit» («віртуальний цикл»)\&.

source: Set [do not set] the last unassigned DNS header flag in a DNS query\&. This flag is off by default\&.
uk: Встановити [не встановлювати] прапорець останнього непризначеного заголовка DNS у запиті DNS\&. Типово, цей прапорець вимкнено\&.

source: MULTIPLE QUERIES
uk: КРАТНІ ЗАПИТИ

source: The BIND 9 implementation of B<dig > supports specifying multiple queries on the command line (in addition to supporting the B<-f> batch file option)\&. Each of those queries can be supplied with its own set of flags, options and query options\&.
uk: У реалізації BIND 9 у B<dig> передбачено підтримку задання декількох запитів у одному рядку команди (на додачу до підтримки параметра файла пакетної обробки, B<-f>)\&. Кожен із запитів може бути надано із власним набором прапорців та параметрів запиту\&.

source: In this case, each I<query> argument represent an individual query in the command-line syntax described above\&. Each consists of any of the standard options and flags, the name to be looked up, an optional query type and class and any query options that should be applied to that query\&.
uk: У цьому випадку, кожен аргумент I<запит> відповідає окремому запиту у синтаксисів рядка команди, описаному вище\&. Кожен складається з будь-яких стандартних параметрів і прапорців, назви, для якої відбувається пошук, необов'язкового типу та класу запиту та будь-яких параметрів, які має бути застосовано до запиту\&.

source: A global set of query options, which should be applied to all queries, can also be supplied\&. These global query options must precede the first tuple of name, class, type, options, flags, and query options supplied on the command line\&. Any global query options (except the B<+[no]cmd> option) can be overridden by a query-specific set of query options\&. For example:
uk: Також може бути вказано загальний набір параметрів запиту, який слід застосувати до усіх запитів\&. Ці загальні параметри слід вказати перед першим кортежем з назви, класу, типу, параметрів, прапорців та параметрів запиту у рядку команди\&. Усі загальні параметри запиту (окрім параметра B<+[no]cmd>) може бути перевизначено набором параметрів запиту на рівні окремого запиту\&. Приклад:

source: shows how B<dig> could be used from the command line to make three lookups: an ANY query for www\&.isc\&.org, a reverse lookup of 127\&.0\&.0\&.1 and a query for the NS records of isc\&.org\&. A global query option of I<+qr> is applied, so that B<dig> shows the initial query it made for each lookup\&. The final query has a local query option of I<+noqr> which means that B<dig> will not print the initial query when it looks up the NS records for isc\&.org\&.
uk: показує, як можна скористатися B<dig> з командного рядка для виконання трьох пошуків: запиту ANY для www\&.isc\&.org, зворотного пошуку 127\&.0\&.0\&.1 і запиту щодо записів NS для isc\&.org\&. Застосовано параметр запиту I<+qr>, отже, B<dig> виведе початковий запит для кожного пошуку\&. Для останнього запиту використано параметр локального запиту I<+noqr>, що означає, що B<dig> не виводитиме початковий запит при пошуку записів NS для isc\&.org\&.

source: IDN SUPPORT
uk: ПІДТРИМКА IDN

source: If B<dig> has been built with IDN (internationalized domain name) support, it can accept and display non-ASCII domain names\&. B<dig> appropriately converts character encoding of domain name before sending a request to DNS server or displaying a reply from the server\&. If you\*(Aqd like to turn off the IDN support for some reason, use parameters I<+noidnin> and I<+noidnout> or define the B<IDN_DISABLE> environment variable\&.
uk: Якщо B<dig> було зібрано із підтримкою IDN (internationalized domain name або міжнародних назв доменів), програма може приймати і виводити назви доменів, які містять символи поза ASCII\&. B<dig> належним чином виконує перетворення кодувань назв доменів до надсилання запитів до серверів DNS або виведення відповідей від серверів\&. Якщо з якоїсь причини ви хочете вимкнути підтримку IDN, скористайтеся параметрами I<+noidnin> і I<+noidnout> або визначте змінну середовища B<IDN_DISABLE>\&.

source: RETURN CODES
uk: ПОВЕРНУТІ КОДИ

source: B<Dig> return codes are:
uk: Коди повернення B<dig> є такими:

source: Everything went well, including things like NXDOMAIN\&.
uk: Усе гаразд, включно з речима, подібними до NXDOMAIN\&.

source: Usage error\&.
uk: Помилка користування\&.

source: Could not open batch file\&.
uk: Не вдалося відкрити пакетний файл\&.

source: No reply from server\&.
uk: Брак відповіді від сервера\&.

source: Internal error\&.
uk: Внутрішня помилка\&.

source: FILES
uk: ФАЙЛИ

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: BUGS
uk: ВАДИ

source: There are probably too many query options\&.
uk: Ймовірно, забагато параметрів запитів\&.

source: AUTHOR
uk: АВТОР

source: COPYRIGHT
uk: АВТОРСЬКІ ПРАВА

source: Copyright \(co 2000-2011, 2013-2022 Internet Systems Consortium, Inc. ("ISC")
uk: \(co Internet Systems Consortium, Inc. ("ISC"), 2000-2011, 2013-2022

source: host - DNS lookup utility
uk: host — допоміжна програма для пошуку DNS
