Repository: yurchor/uk-man-firewalld
Catalog: bind9/*.po
Languages: uk

source: NAME
uk: НАЗВА

source: dig - DNS lookup utility
uk: dig — допоміжна програма для пошуку DNS

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: B<dig> [@server] [B<-b\ >I<address>] [B<-c\ >I<class>] [B<-f\ >I<filename>] [B<-k\ >I<filename>] [B<-m>] [B<-p\ >I<port#>] [B<-q\ >I<name>] [B<-t\ >I<type>] [B<-v>] [B<-x\ >I<addr>] [B<-y\ >I<[hmac:]>I<name:key>] [[B<-4>] | [B<-6>]] [name] [type] [class] [queryopt...]
uk: B<dig> [@сервер] [B<-b\ >I<адреса>] [B<-c\ >I<клас>] [B<-f\ >I<назва_файла>] [B<-k\ >I<назва_файла>] [B<-m>] [B<-p\ >I<номер_порту>] [B<-q\ >I<назва>] [B<-t\ >I<тип>] [B<-v>] [B<-x\ >I<адреса>] [B<-y\ >I<[hmac:]>I<назва:ключ>] [[B<-4>] | [B<-6>]] [назва] [тип] [клас] [параметри_запиту...]

source: B<dig> [global-queryopt...] [query...]
uk: B<dig> [параметр_загального_запиту...] [запит...]

source: DESCRIPTION
uk: ОПИС

source: B<dig> is a flexible tool for interrogating DNS name servers\&. It performs DNS lookups and displays the answers that are returned from the name server(s) that were queried\&. Most DNS administrators use B<dig> to troubleshoot DNS problems because of its flexibility, ease of use and clarity of output\&. Other lookup tools tend to have less functionality than B<dig>\&.
uk: B<dig> — гнучкий інструмент для опитування серверів назв DNS\&. Він виконує пошуки у DNS і показує відповіді, які повернуто серверами назв, які було опитано\&. Більшість адміністраторів DNS використовують B<dig> для діагностики проблем із DNS через гнучкість програми, простоту у користуванні та ясність виведених даних\&. Інші інструменти пошуку, зазвичай, мають вужчі функціональні можливості, ніж B<dig>\&.

source: Although B<dig> is normally used with command-line arguments, it also has a batch mode of operation for reading lookup requests from a file\&. A brief summary of its command-line arguments and options is printed when the B<-h> option is given\&. Unlike earlier versions, the BIND 9 implementation of B<dig> allows multiple lookups to be issued from the command line\&.
uk: Хоча, зазвичай, B<dig> використовують із аргументами командного рядка, у програмі також передбачено пакетний режим роботи із читанням запитів щодо пошуку з файла\&. Коротке резюме щодо аргументів командного рядка та параметрів буде виведено у відповідь на команду з параметром B<-h>\&. На відміну від ранніх версій, реалізація B<dig> у BIND 9 уможливлює одночасне надсилання декількох запитів щодо пошуку з одного рядка команди\&.

source: Unless it is told to query a specific name server, B<dig> will try each of the servers listed in /etc/resolv\&.conf\&. If no usable server addresses are found, B<dig> will send the query to the local host\&.
uk: Якщо програмі не наказано опитати певний сервер назв, B<dig> спробує опитати усі сервери зі списку в /etc/resolv\&.conf\&. Якщо не буде знайдено придатних адрес серверів, B<dig> надішле запит локальній основній системі\&.

source: When no command line arguments or options are given, B<dig> will perform an NS query for "\&." (the root)\&.
uk: Якщо програмі не буде передано жодних аргументів командного рядка, B<dig> виконуватиме запит до сервера назв щодо «\&.» (кореня)\&.

source: It is possible to set per-user defaults for B<dig> via ${HOME}/\&.digrc\&. This file is read and any options in it are applied before the command line arguments\&. The B<-r> option disables this feature, for scripts that need predictable behaviour\&.
uk: Окремі для користувача типові налаштування для B<dig> можна вказати за допомогою файла ${HOME}/\&.digrc\&. Дані з цього файла та усі вказані у ньому значення параметрів буде прочитано до читання аргументів командного рядка\&. Параметр B<-r> вимикає цю можливість для скриптів, поведінка яких має бути незалежною від налаштувань у системі\&.

source: The IN and CH class names overlap with the IN and CH top level domain names\&. Either use the B<-t> and B<-c> options to specify the type and class, use the B<-q> the specify the domain name, or use "IN\&." and "CH\&." when looking up these top level domains\&.
uk: Назви класів IN і CH перекриваються із назвами доменів верхнього рівня IN та CH\&. Слід використовувати або параметри B<-t> і B<-c> для визначення типу і класу, або параметр B<-q> для визначення назви домену, або «IN\&.» і «CH\&.» при пошуку цих доменів верхнього рівня\&.

source: SIMPLE USAGE
uk: ПРОСТЕ КОРИСТУВАННЯ

source: A typical invocation of B<dig> looks like:
uk: Типовий виклик B<dig> виглядає так:

source: dig @server name type
uk: dig @сервер назва тип

source: where:
uk: де

source: B<server>
uk: B<сервер>

source: is the name or IP address of the name server to query\&. This can be an IPv4 address in dotted-decimal notation or an IPv6 address in colon-delimited notation\&. When the supplied I<server> argument is a hostname, B<dig> resolves that name before querying that name server\&.
uk: є назвою або IP-адресою сервера назв, який слід опитати\&. Це може бути адреса IPv4 у форматі блоків, які відокремлено крапками, або адреса IPv6 у форматі блоків, які відокремлено двокрапками\&. Якщо вказаним аргументом I<сервер> є назва вузла, B<dig> визначає адресу за назвою до надсилання запиту до сервера назв\&.

source: If no I<server> argument is provided, B<dig> consults /etc/resolv\&.conf; if an address is found there, it queries the name server at that address\&. If either of the B<-4> or B<-6> options are in use, then only addresses for the corresponding transport will be tried\&. If no usable addresses are found, B<dig> will send the query to the local host\&. The reply from the name server that responds is displayed\&.
uk: Якщо аргумент I<сервер> не вказано, B<dig> звертається до /etc/resolv\&.conf\&. Якщо адресу буде там знайдено, програма виконає опитування сервера назв із вказаною адресою\&. Якщо вказано параметр B<-4> або B<-6>, буде використано лише адреси для відповідного протоколу\&. Якщо придатних до використання адрес не буде знайдено, B<dig> надішле запит до локального вузла\&. Буде показано відповідь від сервера назв\&.

source: B<name>
uk: B<назва>

source: is the name of the resource record that is to be looked up\&.
uk: є назвою запису ресурсу, пошук якого виконуватиметься\&.

source: B<type>
uk: B<тип>

source: indicates what type of query is required \(em ANY, A, MX, SIG, etc\&. I<type> can be any valid query type\&. If no I<type> argument is supplied, B<dig> will perform a lookup for an A record\&.
uk: визначає, який тип запиту потрібен — ANY, A, MX, SIG тощо\&. Значенням I<тип> може бути будь-який коректний тип запиту\&. Якщо не вказано аргумент I<тип>, B<dig> виконає пошук для запису A\&.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Use IPv4 only\&.
uk: Використовувати лише IPv4\&.

source: Use IPv6 only\&.
uk: Використовувати лише IPv6\&.

source: -b I<address>I<[#port]>
uk: -b I<адреса>I<[#порт]>

source: Set the source IP address of the query\&. The I<address> must be a valid address on one of the host\*(Aqs network interfaces, or "0\&.0\&.0\&.0" or "::"\&. An optional port may be specified by appending "#E<lt>portE<gt>"
uk: Встановити початкову IP-адресу запиту\&. Значенням I<адреса> має бути коректна адреса на одному з інтерфейсів мережі вузла, або «0\&.0\&.0\&.0», або «::»\&. Необов'язковий порт може бути вказано додаванням «#E<lt>портE<gt>».

source: -c I<class>
uk: -c I<клас>

source: Set the query class\&. The default I<class> is IN; other classes are HS for Hesiod records or CH for Chaosnet records\&.
uk: Встановити клас запиту\&. Типовим значенням I<клас> є IN; іншими класами є HS для записів Hesiod та CH для записів Chaosnet\&.

source: -f I<file>
uk: -f I<файл>

source: Batch mode: B<dig> reads a list of lookup requests to process from the given I<file>\&. Each line in the file should be organized in the same way they would be presented as queries to B<dig> using the command-line interface\&.
uk: Пакетний режим: B<dig> читає список запитів щодо пошуку для обробки з заданого файла I<файл>\&. Кожен із рядків у файлі має бути записано у тому самому форматі, який би вони мали у запитах до B<dig> в інтерфейсі командного рядка\&.

source: Do reverse IPv6 lookups using the obsolete RFC 1886 IP6\&.INT domain, which is no longer in use\&. Obsolete bit string label queries (RFC 2874) are not attempted\&.
uk: Виконувати обернені пошуки IPv6 за допомогою застарілого домену IP6\&.INT з RFC 1886, яким вже не користуються\&. Спроб виконати застарілі запити щодо бітової рядкової мітки (RFC 2874) виконано не буде\&.

source: -k I<keyfile>
uk: -k I<файл_ключа>

source: Sign queries using TSIG using a key read from the given file\&. Key files can be generated using B<tsig-keygen>(8)\&. When using TSIG authentication with B<dig>, the name server that is queried needs to know the key and algorithm that is being used\&. In BIND, this is done by providing appropriate B<key> and B<server> statements in named\&.conf\&.
uk: Підписати запити за допомогою TSIG з ключем, який прочитано з вказаного файла\&. Файли ключів можна створити за допомогою B<tsig-keygen>(8)\&. При використанні розпізнавання TSIG за допомогою B<dig> сервер назв, опитування якого виконуватиметься, потребує даних щодо використаного ключа і алгоритму його обчислення\&. У BIND завдання з надання цих даних буде виконано наданням відповідних інструкцій B<key> і B<server> у named\&.conf\&.

source: Enable memory usage debugging\&.
uk: Увімкнути діагностику використання пам'яті\&.

source: -p I<port>
uk: -p I<порт>

source: Send the query to a non-standard port on the server, instead of the default port 53\&. This option would be used to test a name server that has been configured to listen for queries on a non-standard port number\&.
uk: Надіслати запит до нестандартного порту на сервері, замість типового порту 53\&. Цим параметром можна скористатися для перевірки того, чи працює сервер назв, який було налаштовано на очікування запитів, на порту із нестандартним номером\&.

source: -q I<name>
uk: -q I<назва>

source: The domain name to query\&. This is useful to distinguish the I<name> from other arguments\&.
uk: Назва домену, куди слід надіслати запит\&. Корисно для відокремлення I<назви> від інших аргументів\&.

source: Do not read options from ${HOME}/\&.digrc\&. This is useful for scripts that need predictable behaviour\&.
uk: Не читати параметри з ${HOME}/\&.digrc\&. Корисно для скриптів, де слід забезпечувати незалежну від налаштувань системи поведінку\&.

source: -t I<type>
uk: -t I<тип>

source: The resource record type to query\&. It can be any valid query type\&. If it is a resource record type supported in BIND 9, it can be given by the type mnemonic (such as "NS" or "AAAA")\&. The default query type is "A", unless the B<-x> option is supplied to indicate a reverse lookup\&. A zone transfer can be requested by specifying a type of AXFR\&. When an incremental zone transfer (IXFR) is required, set the I<type> to ixfr=N\&. The incremental zone transfer will contain the changes made to the zone since the serial number in the zone\*(Aqs SOA record was I<N>\&.
uk: Тип записів ресурсу, опитування щодо якого слід виконати\&. Це може бути будь-який коректний тип запиту\&. Якщо це тип запису ресурсу, підтримку якого передбачено у BIND 9, його можна вказати за допомогою мнемонічного запису (наприклад, «NS» або «AAAA»)\&. Стандартним типом запису є «A», якщо не вказано параметр B<-x> для визначення зворотного пошуку\&. Можна надіслати запит щодо перенесення зон, вказавши тип AXFR\&. Якщо надіслано запит щодо нарощувального перенесення зон (IXFR), встановіть для запису I<тип> значення ixfr=N\&. Нарощувальне перенесення зон міститиме зміни, внесені до зони з моменту, коли серійним номером у записі зони SOA був I<N>\&.

source: All resource record types can be expressed as "TYPEnn", where "nn" is the number of the type\&. If the resource record type is not supported in BIND 9, the result will be displayed as described in RFC 3597\&.
uk: Усі типи записів ресурсів можна виразити як «TYPEnn», де «nn» є номером типу\&. Якщо підтримки типу запису ресурсів у BIND 9 не передбачено, результат буде виведено так, як описано у RFC 3597\&.

source: Print query times in microseconds instead of milliseconds\&.
uk: Вивести дані щодо часу у мікросекундах, а не мілісекундах\&.

source: Print the version number and exit\&.
uk: Вивести дані щодо версії і вийти\&.

source: -x I<addr>
uk: -x I<адреса>

source: Simplified reverse lookups, for mapping addresses to names\&. The I<addr> is an IPv4 address in dotted-decimal notation, or a colon-delimited IPv6 address\&. When the B<-x> is used, there is no need to provide the I<name>, I<class> and I<type> arguments\&. B<dig> automatically performs a lookup for a name like 94\&.2\&.0\&.192\&.in-addr\&.arpa and sets the query type and class to PTR and IN respectively\&. IPv6 addresses are looked up using nibble format under the IP6\&.ARPA domain (but see also the B<-i> option)\&.
uk: Спрощений зворотний пошук для відображення адрес на назви\&. Значенням I<адреса> є адреса IPv4 з відокремлених крапками блоків або адреса IPv6 з відокремлених двокрапками блоків\&. Якщо використано B<-x>, немає потреби у надання аргументів I<назва>, I<клас> і I<тип>\&. B<dig> автоматично виконає пошук назв, подібних до 94\&.2\&.0\&.192\&.in-addr\&.arpa, і встановить тип і клас запиту у значення PTR і IN, відповідно\&. Пошук адрес IPv6 буде виконано з використанням скороченого формату у домені IP6\&.ARPA (втім, див. також параметр B<-i>)\&.

source: -y I<[hmac:]>I<keyname:secret>
uk: -y I<[hmac:]>I<назва_ключа:пароль>

source: Sign queries using TSIG with the given authentication key\&. I<keyname> is the name of the key, and I<secret> is the base64 encoded shared secret\&. I<hmac> is the name of the key algorithm; valid choices are hmac-md5, hmac-sha1, hmac-sha224, hmac-sha256, hmac-sha384, or hmac-sha512\&. If I<hmac> is not specified, the default is hmac-md5 or if MD5 was disabled hmac-sha256\&.
uk: Підписати запити за допомогою TSIG і вказаного ключа розпізнавання\&. Значенням I<назва_ключа> має бути назва ключа, а значенням I<пароль> має бути закодований за допомогою base64 запис пароля\&. Значенням I<hmac> має бути назва алгоритму шифрування\&. Коректними варіантами є hmac-md5, hmac-sha1, hmac-sha224, hmac-sha256, hmac-sha384 та hmac-sha512\&. Якщо I<hmac> не вказано, типовим значенням є hmac-md5 або, якщо MD5 було вимкнено, hmac-sha256\&.

source: NOTE: You should use the B<-k> option and avoid the B<-y> option, because with B<-y> the shared secret is supplied as a command line argument in clear text\&. This may be visible in the output from B<ps>(1) or in a history file maintained by the user\*(Aqs shell\&.
uk: Зауваження: вам слід скористатися параметром B<-k> і уникати параметра B<-y>, оскільки при використанні B<-y> пароль слід надавати в аргументі командного рядка без шифрування\&. Пароль можна буде побачити у виведенні команди B<ps>(1) або файлі журналу командної оболонки користувача\&.

source: QUERY OPTIONS
uk: ПАРАМЕТРИ ЗАПИТУ

source: B<dig> provides a number of query options which affect the way in which lookups are made and the results displayed\&. Some of these set or reset flag bits in the query header, some determine which sections of the answer get printed, and others determine the timeout and retry strategies\&.
uk: У B<dig> передбачено доволі багато параметрів запитів, які впливають на спосіб виконання пошуків і показу результатів\&. Деякі з параметрів встановлюють або знімають біти прапорців у заголовку запиту, деякі визначають, які розділи відповіді буде виведено, а інші визначають стратегії очікування та виконання повторних спроб\&.

source: Each query option is identified by a keyword preceded by a plus sign (+)\&. Some keywords set or reset an option\&. These may be preceded by the string no to negate the meaning of that keyword\&. Other keywords assign values to options like the timeout interval\&. They have the form B<+keyword=value>\&. Keywords may be abbreviated, provided the abbreviation is unambiguous; for example, +cd is equivalent to +cdflag\&. The query options are:
uk: Кожен параметр запиту визначається ключовим словом, перед яким слід вказати знак «плюс» (+)\&. Деякі ключові слова встановлюють або скасовують використання параметра\&. До ключових слів може бути дописано рядок «no» для заперечення значення ключового слова\&. Інші ключові слова встановлюють значення для параметрів, подібних до часу очікування\&. Їх записують у формі B<+ключове слово=значення>\&. Можна скористатися скороченнями від ключових слів, якщо скорочення є однозначним; наприклад, +cd є тим самим, що і +cdflag\&. Параметрами запитів є такі:

source: A synonym for I<+[no]aaonly>\&.
uk: Синонім I<+[no]aaonly>\&.

source: Sets the "aa" flag in the query\&.
uk: Встановлює прапорець «aa» у запиті\&.

source: Display [do not display] the additional section of a reply\&. The default is to display it\&.
uk: Вивести [не виводити] додатковий розділ відповіді\&. Типово, розділ буде виведено\&.

source: Set [do not set] the AD (authentic data) bit in the query\&. This requests the server to return whether all of the answer and authority sections have all been validated as secure according to the security policy of the server\&. AD=1 indicates that all records have been validated as secure and the answer is not from a OPT-OUT range\&. AD=0 indicate that some part of the answer was insecure or not validated\&. This bit is set by default\&.
uk: Встановити [скасувати встановлення] біта AD (автентичні дані) у запиті\&. За допомогою цього біта можна наказати серверу повернути дані щодо того, чи у сі розділи відповіді і служби уповноваження пройшли перевірку захисту за правилами безпеки сервера\&. AD=1 вказує на те, що усі записи пройшли перевірку як безпечні, а відповідь не потрапляє у діапазон OPT-OUT\&. AD=0 вказує на те, що якась з частин відповіді не пройшла перевірки\&. Типово, цей біт буде встановлено\&.

source: Set or clear all display flags\&.
uk: Встановити або зняти усі прапорці показу\&.

source: Display [do not display] the answer section of a reply\&. The default is to display it\&.
uk: Вивести [не виводити] розділ відповіді\&. Типово, розділ буде виведено\&.

source: Display [do not display] the authority section of a reply\&. The default is to display it\&.
uk: Вивести [не виводити] розділ служби уповноваження\&. Типово, розділ буде виведено\&.

source: Retry lookup with the new server cookie if a BADCOOKIE response is received\&.
uk: Виконати повторну спробу пошуку із новою кукою сервера, якщо буде отримано відповідь BADCOOKIE\&.

source: Attempt to display the contents of messages which are malformed\&. The default is to not display malformed answers\&.
uk: Спробувати вивести вміст повідомлень із помилковим форматуванням\&. Типово, програма не виводитиме відповідей із помилковим форматуванням\&.

source: This option sets the UDP message buffer size advertised using EDNS0 to I<B> bytes\&. The maximum and minimum sizes of this buffer are 65535 and 0, respectively\&. +bufsize=0 disables EDNS (use +bufsize=0 +edns to send a EDNS messages with a advertised size of 0 bytes)\&. +bufsize restores the default buffer size\&.
uk: Цей параметр встановлює для розміру буфера повідомлень UDP, про який буде оголошено за допомогою EDNS0, значення I<B> байтів\&. Максимальним і мінімальним розмірами цього буфера є 65535 і 0, відповідно\&. +bufsize=0 вимикає EDNS (скористайтеся +bufsize=0 +edns для надсилання повідомлень EDNS з оголошеним розміром у 0 байтів)\&. +bufsize відновлює типовий розмір буфера\&.

source: Set [do not set] the CD (checking disabled) bit in the query\&. This requests the server to not perform DNSSEC validation of responses\&.
uk: Встановити [скасувати встановлення] біта CD (перевірку вимкнено) у запиті\&. За допомогою цього біта можна наказати серверу не виконувати перевірку DNSSEC відповідей\&.

source: Display [do not display] the CLASS when printing the record\&.
uk: Вивести [не виводити] CLASS при виведенні запису\&.

source: Toggles the printing of the initial comment in the output, identifying the version of B<dig> and the query options that have been applied\&. This option always has global effect; it cannot be set globally and then overridden on a per-lookup basis\&. The default is to print this comment\&.
uk: Вмикає або вимикає виведення початкового коментаря, який вказує на версію B<dig> і параметри запиту, які було використано\&. Використання цього параметра завжди має загальні наслідки; його не можна встановити на загальному рівні, а потім перевизначити для окремого запиту\&. Типовим є виведення цього коментаря\&.

source: Toggles the display of some comment lines in the output, containing information about the packet header and OPT pseudosection, and the names of the response section\&. The default is to print these comments\&.
uk: Вмикає або вимикає показ деяких рядків коментарів у виведених даних; зокрема коментарів із відомостями щодо заголовка пакета та псевдорозділу OPT, а також назв розділів відповіді\&. Типовим є виведення цих коментарів\&.

source: Other types of comments in the output are not affected by this option, but can be controlled using other command line switches\&. These include B<+[no]cmd>, B<+[no]question>, B<+[no]stats>, and B<+[no]rrcomments>\&.
uk: Цей параметр не впливає на виведення інших типів коментарів, але ними можна керувати за допомогою інших перемикачів командного рядка\&. Це стосується, зокрема, B<+[no]cmd>, B<+[no]question>, B<+[no]stats> і B<+[no]rrcomments>\&.

source: Send a COOKIE EDNS option, with optional value\&. Replaying a COOKIE from a previous response will allow the server to identify a previous client\&. The default is B<+cookie>\&.
uk: Надіслати параметр COOKIE EDNS із необов'язковим значенням\&. Відтворення COOKIE з попередньої відповіді надасть змогу серверу ідентифікувати попередній клієнт\&. Типовим є варіант B<+cookie>\&.

source: B<+cookie> is also set when +trace is set to better emulate the default queries from a nameserver\&.
uk: B<+cookie> також буде встановлено, якщо встановлено +trace, щоб краще імітувати типові запити від сервера назв\&.

source: Toggle the display of cryptographic fields in DNSSEC records\&. The contents of these field are unnecessary to debug most DNSSEC validation failures and removing them makes it easier to see the common failures\&. The default is to display the fields\&. When omitted they are replaced by the string "[omitted]" or in the DNSKEY case the key id is displayed as the replacement, e\&.g\&. "[ key id = value ]"\&.
uk: Увімкнути або вимкнути виведення криптографічних полів у записах DNSSEC\&. Вміст цих полів не є необхідним для діагностики більшості помилок із перевірками DNSSEC, і їхнє вилучення спрощує виявлення типових помилок\&. Типовим є виведення цих полів\&. Якщо їх пропустити, вміст буде замінено рядком «[omitted]» або, у випадку DNSKEY, ідентифікатором ключа, наприклад, «[ ідентифікатор ключа = значення ]»\&.

source: Deprecated, treated as a synonym for I<+[no]search>
uk: Застарілий, вважається синонімом I<+[no]search>

source: Requests DNSSEC records be sent by setting the DNSSEC OK bit (DO) in the OPT record in the additional section of the query\&.
uk: Надіслати запит щодо надсилання записів DNSSEC встановленням біта DNSSEC OK (DO) у записі OPT у додатковому розділі запиту\&.

source: B<+domain=somename>
uk: B<+domain=якась_назва>

source: Set the search list to contain the single domain I<somename>, as if specified in a B<domain> directive in /etc/resolv\&.conf, and enable search list processing as if the I<+search> option were given\&.
uk: Встановити, що список пошуку має містити єдиний домен I<якась_назва>, так, наче його вказано у інструкції B<domain> у файлі /etc/resolv\&.conf, і увімкнути обробку списку пошуку так, наче вказано параметр I<+search>\&.

source: B<+dscp=value>
uk: B<+dscp=значення>
