Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: Some options require rsync to know the full file list, so these options disable the incremental recursion mode. These include:
uk: Для використання деяких параметрів потрібно, щоб rsync був відомим повний список файлів, тому використання цих параметрів призводить до вимикання режиму нарощувальної рекурсії. Серед цих параметрів такі:

source: B<--delete-before> (the old default of B<--delete>)
uk: B<--delete-before> (старе типове значення B<--delete>)

source: In order to make B<--delete> compatible with incremental recursion, rsync 3.0.0 made B<--delete-during> the default delete mode (which was first first added in 2.6.4).
uk: Щоб зробити B<--delete> сумісним із нарощувальною рекурсією, у rsync 3.0.0 типовим режимом вилучення зроблено B<--delete-during> (цей режим було вперше додано у 2.6.4).

source: One side-effect of incremental recursion is that any missing sub-directories inside a recursively-scanned directory are (by default) created prior to recursing into the sub-dirs. This earlier creation point (compared to a non-incremental recursion) allows rsync to then set the modify time of the finished directory right away (without having to delay that until a bunch of recursive copying has finished). However, these early directories don't yet have their completed mode, mtime, or ownership set\ -- they have more restrictive rights until the subdirectory's copying actually begins. This early-creation idiom can be avoiding by using the B<--omit-dir-times> option.
uk: Одним із побіжних результатів нарощувальної рекурсії є те, що будь-які підкаталоги у рекурсивно сканованого каталогу, яких не вистачає, буде (типово) створено до рекурсивного переходу підкаталогами. Ця рання позиція створення (порівняно із ненарощувальною рекурсією) дозволяє rsync потім одразу встановити час внесення змін для завершеного каталогу (без чекання, Доки буде завершено пакет дій з рекурсивного копіювання). Втім, ці попередньо створені каталоги ще не матимуть завершеного встановленого режиму доступу, позначки часу внесення змін та прав власності\ -- для них буде встановлено жорсткіші права доступу до того, як розпочнеться справжнє копіювання. Цієї ідіоми раннього створення можна уникнути використанням параметра B<--omit-dir-times>.

source: Incremental recursion can be disabled using the B<--no-inc-recursive> (B<--no-i-r>) option.
uk: Нарощувальну рекурсію можна вимкнути за допомогою параметра B<--no-inc-recursive> (B<--no-i-r>).

source: Disables the new incremental recursion algorithm of the B<--recursive> option. This makes rsync scan the full file list before it begins to transfer files. See B<--inc-recursive> for more info.
uk: Вимикає новий алгоритм нарощувальної рекурсії параметра B<--recursive>. Наказує rsync сканувати повний список файлів до того, як програма розпочне переносити файли. Див. B<--inc-recursive>, щоб дізнатися більше.

source: Use relative paths. This means that the full path names specified on the command line are sent to the server rather than just the last parts of the filenames. This is particularly useful when you want to send several different directories at the same time. For example, if you used this command:
uk: Використовувати відносні шляхи. Це означає, що повні шляхи, які вказано у рядку команди, буде надіслано на сервер замість простого надсилання останніх частин назв файлів. Це, зокрема, корисно, якщо ви хочете надіслати декілька різних каталогів одночасно. Наприклад, якщо ви використали таку команду:

source: rsync -av /foo/bar/baz.c remote:/tmp/
uk: rsync -av /щось/десь/там.c remote:/tmp/

source: would create a file named baz.c in /tmp/ on the remote machine. If instead you used
uk: створить файл із назвою там.c у /tmp/ на віддаленому комп'ютері. Якщо ж ви скористаєтеся таким:

source: rsync -avR /foo/bar/baz.c remote:/tmp/
uk: rsync -avR /щось/десь/там.c remote:/tmp/

source: then a file named /tmp/foo/bar/baz.c would be created on the remote machine, preserving its full path. These extra path elements are called "implied directories" (i.e. the "foo" and the "foo/bar" directories in the above example).
uk: на віддаленому комп'ютері буде створено файл із назвою /tmp/щось/десь/там.c зі збереженням його повного шляху. Ці додаткові елементи шляху називають «неявними каталогами» (тобто каталоги «щось» і «щось/десь» у наведеному вище прикладі).

source: Beginning with rsync 3.0.0, rsync always sends these implied directories as real directories in the file list, even if a path element is really a symlink on the sending side. This prevents some really unexpected behaviors when copying the full path of a file that you didn't realize had a symlink in its path. If you want to duplicate a server-side symlink, include both the symlink via its path, and referent directory via its real path. If you're dealing with an older rsync on the sending side, you may need to use the B<--no-implied-dirs> option.
uk: Починаючи з версії rsync 3.0.0, rsync завжди надсилає ці неявні каталоги як справжні каталоги у списку файлів, навіть якщо елемент шляху є насправді символічним посиланням на боці відправника. Це запобігає небажаним результатам при копіюванні повного шляху до файла, для якого не було встановлено наявність символічного посилання у шляху. Якщо ви хочете здублювати символічне посилання на боці сервера, включіть символічне посилання на основі його шляху і каталог, на яке воно посилається, на основі справжнього шляху до нього. Якщо ви маєте справу із застарілою версією rsync на боці відправника, ймовірно, вам доведеться скористатися параметром B<--no-implied-dirs>.

source: It is also possible to limit the amount of path information that is sent as implied directories for each path you specify. With a modern rsync on the sending side (beginning with 2.6.7), you can insert a dot and a slash into the source path, like this:
uk: Також можна обмежити обсяг даних щодо шляху, які буде надіслано як неявні каталоги для кожного вказаного вами шляху. Для сучасних версій rsync на боці відправника (починаючи з 2.6.7), ви можете вставити крапку і символ похилої риски до шляху джерела, ось так:

source: rsync -avR /foo/./bar/baz.c remote:/tmp/
uk: rsync -avR /щось/./десь/там.c remote:/tmp/

source: That would create /tmp/bar/baz.c on the remote machine. (Note that the dot must be followed by a slash, so "/foo/." would not be abbreviated.) For older rsync versions, you would need to use a chdir to limit the source path. For example, when pushing files:
uk: У результаті буде створено /tmp/десь/там.c на віддаленому комп'ютері. (Зауважте, що після крапки має бути символ похилої риски, отже «/щось/.» не буде скорочено.) Для застарілих версій rsync, вам доведеться скористатися chdir для обмеження шляху джерела. Наприклад, при надсиланні файлів:

source: (cd /foo; rsync -avR bar/baz.c remote:/tmp/)
uk: (cd /десь; rsync -avR щось/там.c remote:/tmp/)

source: (Note that the parens put the two commands into a sub-shell, so that the "cd" command doesn't remain in effect for future commands.) If you're pulling files from an older rsync, use this idiom (but only for a non-daemon transfer):
uk: (Зауважте, що круглі дужки надсилають дві команди до підоболонки, тому наслідки команди «cd» не стосуються наступних команд.) Якщо ви отримуєте файли зі старіших версій rsync, користуйтеся такою синтаксичною конструкцією (але лише для передавання даних без фонової служби):

source: rsync -avR --rsync-path="cd /foo; rsync" \e remote:bar/baz.c /tmp/
uk: rsync -avR --rsync-path="cd /десь; rsync" \e remote:щось/там.c /tmp/

source: This option affects the default behavior of the B<--relative> option. When it is specified, the attributes of the implied directories from the source names are not included in the transfer. This means that the corresponding path elements on the destination system are left unchanged if they exist, and any missing implied directories are created with default attributes. This even allows these implied path elements to have big differences, such as being a symlink to a directory on the receiving side.
uk: Цей параметр впливає на типову поведінку параметра B<--relative>. Якщо його вказано, атрибути неявних каталогів з назв джерела не буде включено до передавання. Це означає, що відповідні елементи шляху у системі призначення лишаються незмінними, якщо вони існують, і усі пропущені неявні каталоги буде створено із типовими атрибутами. Це навіть уможливлює більші відмінності у цих елементах неявних шляхів, зокрема символічні посилання на каталоги на боці отримувача.

source: For instance, if a command-line arg or a files-from entry told rsync to transfer the file "path/foo/file", the directories "path" and "path/foo" are implied when B<--relative> is used. If "path/foo" is a symlink to "bar" on the destination system, the receiving rsync would ordinarily delete "path/foo", recreate it as a directory, and receive the file into the new directory. With B<--no-implied-dirs>, the receiving rsync updates "path/foo/file" using the existing path elements, which means that the file ends up being created in "path/bar". Another way to accomplish this link preservation is to use the B<--keep-dirlinks> option (which will also affect symlinks to directories in the rest of the transfer).
uk: Наприклад, якщо аргумент рядка команди або запис походження файлів наказують rsync перенести файл «шлях/щось/файл», каталоги «шлях» і «шлях/десь» буде неявним чином використано, якщо використано B<--relative>. Якщо «шлях/щось» є символічним посиланням на «десь» у системі призначення, rsync отримання, зазвичай, вилучить «шлях/щось», повторно створить його як каталог і отримає файл до нового каталогу. З B<--no-implied-dirs> rsync отримувача оновить «шлях/щось/файл» з використанням наявних елементів шляху, тобто файл буде створено у «шлях/десь». Іншим способом досягти такого збереження посилань є використання параметра B<--keep-dirlinks> (який також вплине на символічні посилання на каталоги у решті масиву передавання даних).

source: When pulling files from an rsync older than 3.0.0, you may need to use this option if the sending side has a symlink in the path you request and you wish the implied directories to be transferred as normal directories.
uk: При отриманні файлів з rsync, який є старішим за 3.0.0, вам варто скористатися цим параметром, якщо з боку відправника є символічне посилання на потрібний вам шлях, і ви хочете перенести неявні каталоги, як звичайні каталоги.

source: With this option, preexisting destination files are renamed as each file is transferred or deleted. You can control where the backup file goes and what (if any) suffix gets appended using the B<--backup-dir> and B<--suffix> options.
uk: У разі використання цього параметра програма перейменовуватиме початкові файли у каталогах призначення, які згодом буде оновлено або вилучено. Керувати місцем зберігання початкових файлів та додаванням до їх назв суфікса (якщо такий слід додавати) можна за допомогою параметрів the B<--backup-dir> і B<--suffix>.

source: If you don't specify B<--backup-dir>:
uk: Якщо ви не вкажете B<--backup-dir>:

source: the B<--omit-dir-times> option will be forced on
uk: параметр B<--omit-dir-times> буде примусово увімкнено

source: the use of B<--delete> (without B<--delete-excluded>), causes rsync to add a "protect" filter-rule for the backup suffix to the end of all your existing filters that looks like this: B<-f\ "P\ *~">. This rule prevents previously backed-up files from being deleted.
uk: використання B<--delete> (без B<--delete-excluded>) наказує rsync додати правило фільтрування «захистити» для суфікса резервної копії наприкінці усіх ваших наявних фільтрів, який виглядає десь так: B<-f\ "P\ *~">. Це правило запобігає вилученню файлів, для яких раніше було створено резервні копії.

source: Note that if you are supplying your own filter rules, you may need to manually insert your own exclude/protect rule somewhere higher up in the list so that it has a high enough priority to be effective (e.g. if your rules specify a trailing inclusion/exclusion of B<*>, the auto-added rule would never be reached).
uk: Зауважте, що якщо ви надаєте програмі власні правила фільтрування, вам, можливо, слід вручну вставити ваше власне правило виключення/захисту десь вище у списку, щоб воно мало достатньо високу пріоритетність, щоб бути працездатним (наприклад, якщо ваші правила визначають кінцеве включення/виключення B<*>, програма ніколи не дістанеться правила автоматичного додавання).

source: B<--backup-dir=DIR>
uk: B<--backup-dir=КАТАЛОГ>

source: This implies the B<--backup> option, and tells rsync to store all backups in the specified directory on the receiving side. This can be used for incremental backups. You can additionally specify a backup suffix using the B<--suffix> option (otherwise the files backed up in the specified directory will keep their original filenames).
uk: Неявним чином встановлює параметр B<--backup> і наказує rsync зберегти усі резервні копії у вказаному каталозі на боці отримання. Цим можна скористатися для створення нарощувальних резервних копій. Крім того, ви можете вказати суфікс назв файлів резервних копій за допомогою параметра B<--suffix> (якщо цього не зробити, резервні копії у вказаному каталозі матимуть ті самі назви, що і початкові файли).

source: Note that if you specify a relative path, the backup directory will be relative to the destination directory, so you probably want to specify either an absolute path or a path that starts with "../". If an rsync daemon is the receiver, the backup dir cannot go outside the module's path hierarchy, so take extra care not to delete it or copy into it.
uk: Зауважте, що якщо ви вкажете відносний шлях, каталог резервних копій буде визначено відносно каталогу призначення, тому, ймовірно, вам варто вказати або абсолютний шлях, або шлях, який починається з «../». Якщо отримувачем є фонова служба rsync, каталог резервних копій не може перебувати поза ієрархією шляхів модуля, тому будьте особливо уважні — не вилучайте його і не копіюйте до нього дані.

source: B<--suffix=SUFFIX>
uk: B<--suffix=СУФІКС>

source: This option allows you to override the default backup suffix used with the B<--backup> (B<-b>) option. The default suffix is a B<~> if no B<--backup-dir> was specified, otherwise it is an empty string.
uk: За допомогою цього параметра ви можете перевизначити типовий суфікс назв резервних копій, який буде використано для команди з параметром B<--backup> (B<-b>). Типовим суфіксом, якщо не вказано параметра B<--backup-dir>, буде B<~>, якщо ж цей параметр буде вказано, програма використовуватиме порожній рядок.

source: This forces rsync to skip any files which exist on the destination and have a modified time that is newer than the source file. (If an existing destination file has a modification time equal to the source file's, it will be updated if the sizes are different.)
uk: За допомогою цього параметра можна наказати rsync пропускати всі файли у каталозі призначення, які позначено часом зміни, новішим за час зміни файла джерела. Якщо наявний файл призначення матиме часову позначку зміни, рівну часовій позначці зміни файла джерела, його буде оновлено за умови відмінності у розмірах файлів.

source: Note that this does not affect the copying of dirs, symlinks, or other special files. Also, a difference of file format between the sender and receiver is always considered to be important enough for an update, no matter what date is on the objects. In other words, if the source has a directory where the destination has a file, the transfer would occur regardless of the timestamps.
uk: Зауважте, що цей не стосується копіювання каталогів, символічних посилань або інших особливих файлів. Крім того, відмінність у форматах файлів між відправником та отримувачем завжди вважається достатньо важливою для оновлення, незалежно від датування об'єктів. Іншими словами, якщо у джерелі маємо каталог там, де у призначенні маємо файл, передавання даних буде здійснено незалежно від часових позначок.

source: This option is a transfer rule, not an exclude, so it doesn't affect the data that goes into the file-lists, and thus it doesn't affect deletions. It just limits the files that the receiver requests to be transferred.
uk: Цей параметр є правилом передавання, а не виключення, тому він не впливає на дані, які потрапляють до списків файлів, а отже, не впливає на вилучення. Він просто обмежує перелік файлів, на які отримувач надішле запит щодо передавання.

source: A caution for those that choose to combine B<--inplace> with B<--update>: an interrupted transfer will leave behind a partial file on the receiving side that has a very recent modified time, so re-running the transfer will probably B<not> continue the interrupted file. As such, it is usually best to avoid combining this with B<--inplace> unless you have implemented manual steps to handle any interrupted in-progress files.
uk: Попередження для тих, хто поєднує B<--inplace> з B<--update>: перерване передавання даних лишить по собі частковий файл на боці отримувача із досить свіжим часом внесення змін, тому повторний запуск передавання, ймовірно, B<не> продовжиться на перерваному файлі. Ось чому, зазвичай, варто уникати поєднання цього параметра з B<--inplace>, якщо вами не реалізовано вручну обробку сценаріїв роботи із будь-якими файлами, передавання яких було перервано.

source: This option changes how rsync transfers a file when its data needs to be updated: instead of the default method of creating a new copy of the file and moving it into place when it is complete, rsync instead writes the updated data directly to the destination file.
uk: Цей параметр змінює спосіб, у який rsync передаватиме файл, якщо дані у ньому слід оновити: замість типового способу створення нової копії файла і пересування її на місце при завершенні передавання, rsync записуватиме оновлені дані безпосередньо до файла призначення.

source: This has several effects:
uk: Результатів буде декілька:

source: Hard links are not broken. This means the new data will be visible through other hard links to the destination file. Moreover, attempts to copy differing source files onto a multiply-linked destination file will result in a "tug of war" with the destination data changing back and forth.
uk: Жорсткі посилання не буде пошкоджено. Це означає, що нові дані будуть видимими через інші жорсткі посилання на файл призначення. Більше того, спроби копіювання відмінних файлів джерела до файла призначення із декількома посиланнями призведуть до «перетягування канату» зі зміною даних призначення вперед і назад.

source: In-use binaries cannot be updated (either the OS will prevent this from happening, or binaries that attempt to swap-in their data will misbehave or crash).
uk: Виконувані файли, які перебувають у використанні, не можна буде оновити (цьому запобігатиме або операційна система, або виконувані файли, які намагатимуться створити резервну копію даних на диску, поводитимуться нештатно і завершуватимуть роботу в аварійному режимі).

source: The file's data will be in an inconsistent state during the transfer and will be left that way if the transfer is interrupted or if an update fails.
uk: Під час передавання даних дані файла перебуватимуть у неузгодженому стані і лишатимуться у такому стані, якщо передавання буде перервано або оновлення зазнає невдачі.

source: A file that rsync cannot write to cannot be updated. While a super user can update any file, a normal user needs to be granted write permission for the open of the file for writing to be successful.
uk: Файл, до якого не може записати дані rsync, не можна оновити. Надкористувач може оновлювати будь-які файли, а ось звичайному користувачеві має бути надано доступ до запису для того, щоб відкриття файла для запису було успішним.

source: The efficiency of rsync's delta-transfer algorithm may be reduced if some data in the destination file is overwritten before it can be copied to a position later in the file. This does not apply if you use B<--backup>, since rsync is smart enough to use the backup file as the basis file for the transfer.
uk: Ефективність алгоритму дельта-передавання rsync може знизитися, якщо деякі дані у файлів призначення буде перезаписано до того, як їх можна буде скопіювати до позиції далі у файлі. Це не стосується випадку, коли ви використовуєте B<--backup>, оскільки rsync є достатньо кмітливим, щоб скористатися файлом резервної копії як базовим файлом для передавання даних.

source: WARNING: you should not use this option to update files that are being accessed by others, so be careful when choosing to use this for a copy.
uk: УВАГА! Не слід користуватися цим параметром для оновлення файлів, доступ до яких здійснюють інші користувачі. Отже, будьте уважні при використанні цього параметра для копіювання.

source: This option is useful for transferring large files with block-based changes or appended data, and also on systems that are disk bound, not network bound. It can also help keep a copy-on-write filesystem snapshot from diverging the entire contents of a file that only has minor changes.
uk: Цей параметр є корисним для передавання великих файлів із змінами на основі блоків або дописування даних, а також у системах, які обмежені за параметрами дисків, а не мережі. Він також може допомогти у створенні знімка файлової системи з копіюванням при записі: не треба буде копіювати увесь вміст файла, зміни у якому є незначними.

source: The option implies B<--partial> (since an interrupted transfer does not delete the file), but conflicts with B<--partial-dir> and B<--delay-updates>. Prior to rsync 2.6.4 B<--inplace> was also incompatible with B<--compare-dest> and B<--link-dest>.
uk: Параметр неявним чином встановлює B<--partial> (оскільки при частковому передаванні файл не буде вилучено), але конфліктує із параметрами B<--partial-dir> і B<--delay-updates>. До версії rsync 2.6.4 B<--inplace> параметр був несумісним із параметрами B<--compare-dest> і B<--link-dest>.

source: This special copy mode only works to efficiently update files that are known to be growing larger where any existing content on the receiving side is also known to be the same as the content on the sender. The use of B<--append> B<can be dangerous> if you aren't 100% sure that all the files in the transfer are shared, growing files. You should thus use filter rules to ensure that you weed out any files that do not fit this criteria.
uk: Цей особливий режим копіювання ефективно працює лише для оновлення файлів, розмір яких збільшується з часом, там, де усі наявні дані на боці отримувача завжди є і на боці відправника. Використання B<--append> B<може бути небезпечним>, якщо немає 100% гарантії, що усі файли у передаванні є спільними і розміри їх зростають із часом. Через це, вам слід скористатися правилами фільтрування, щоб усунути з передавання усі файли, які не відповідають цим критеріям.

source: Rsync updates these growing file in-place without verifying any of the existing content in the file (it only verifies the content that it is appending). Rsync skips any files that exist on the receiving side that are not shorter than the associated file on the sending side (which means that new files are transferred). It also skips any files whose size on the sending side gets shorter during the send negotiations (rsync warns about a "diminished" file when this happens).
uk: Rsync виконує оновлення таких файлів, розмір яких збільшується, без перевірки наявного вмісту файла (виконує перевірку лише даних, які слід дописати). Rsync пропускатиме усі файли на боці отримувача, які не є меншими за відповідні файли на боці відправника (це означає, що нові файли буде передано). Також буде пропущено файли, чий розмір зменшуватиметься під час узгодження надсилання (rsync попередить про «зменшений» файл, якщо таке трапиться).
