Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: If the destination contains extraneous hard-links (more linking than what is present in the source file list), the copying algorithm will not break them explicitly. However, if one or more of the paths have content differences, the normal file-update process will break those extra links (unless you are using the B<--inplace> option).
uk: Якщо призначення містить сторонні жорсткі посилання (більше посилань, ніж було у списку файлів джерела), алгоритм копіювання не порушуватиме їх явним чином. Втім, якщо за одним або декількома шляхами будуть відмінності у даних, звичайний процес оновлення файлів порушить ці сторонні посилання (якщо ви не скористаєтеся параметром B<--inplace>).

source: If you specify a B<--link-dest> directory that contains hard links, the linking of the destination files against the B<--link-dest> files can cause some paths in the destination to become linked together due to the B<--link-dest> associations.
uk: Якщо ви вкажете катало B<--link-dest>, що містить жорсткі посилання, прив'язування файлів призначення до файлів B<--link-dest> може призвести до пов'язування деяких шляхів у призначенні між собою через прив'язки B<--link-dest>.

source: Note that rsync can only detect hard links between files that are inside the transfer set. If rsync updates a file that has extra hard-link connections to files outside the transfer, that linkage will be broken. If you are tempted to use the B<--inplace> option to avoid this breakage, be very careful that you know how your files are being updated so that you are certain that no unintended changes happen due to lingering hard links (and see the B<--inplace> option for more caveats).
uk: Зауважте, що rsync може виявляти жорсткі посилання лише між файлами, які перебувають у наборі для передавання. Якщо rsync оновлює файл, який має жорсткі прив'язки до файлів поза набором файлів для передавання, такі прив'язки буде зруйновано. Якщо вам хочеться скористатися параметром B<--inplace>, щоб уникнути такого руйнування, будьте дуже обережні: файли не повіинні змінюватися до файлів протягом тривалості існування жорстких посилань (опис додаткових можливих проблем наведено у описі параметра B<--inplace>).

source: If incremental recursion is active (see B<--inc-recursive>), rsync may transfer a missing hard-linked file before it finds that another link for that contents exists elsewhere in the hierarchy. This does not affect the accuracy of the transfer (i.e. which files are hard-linked together), just its efficiency (i.e. copying the data for a new, early copy of a hard-linked file that could have been found later in the transfer in another member of the hard-linked set of files). One way to avoid this inefficiency is to disable incremental recursion using the B<--no-inc-recursive> option.
uk: Якщо активною є нарощувальна рекурсія (див. B<--inc-recursive>), rsync може передати пропущений файл із жорстким посиланням до того, як виявить, що на ці дані є інше посилання десь в ієрархії. Це не вплине на точність передавання даних (тобто те, які файли буде пов'язано жорсткими посиланнями між собою), а лише на його ефективність (тобто на копіювання даних заново, випереджальне копіювання файла із жорстким посиланням, який могло б бути знайдено пізніше під час передавання іншого запису набору файлів із жорсткими посиланнями). Одним зі способів уникнути цієї неефективності є вимикання нарощувальної рекурсії за допомогою параметра B<--no-inc-recursive>.

source: This option causes the receiving rsync to set the destination permissions to be the same as the source permissions. (See also the B<--chmod> option for a way to modify what rsync considers to be the source permissions.)
uk: Якщо буде позначено цей пункт, програма встановлюватиме на стороні отримання даних rsync права доступу до елементів структури каталогів тотожні до прав доступу до елементів структури каталогів на стороні джерела. (Див. також параметр B<--chmod>, щоб дізнатися про зміну того, що rsync розглядає, як права доступу джерела.)

source: When this option is I<off>, permissions are set as follows:
uk: Якщо значенням цього параметра є I<off>, права доступу буде встановлено ось так:

source: Existing files (including updated files) retain their existing permissions, though the B<--executability> option might change just the execute permission for the file.
uk: Наявні файли (включно із оновленими файлами) зберігатимуть наявні права доступу, хоча параметр B<--executability> може змінити права доступу до виконання файла.

source: New files get their "normal" permission bits set to the source file's permissions masked with the receiving directory's default permissions (either the receiving process's umask, or the permissions specified via the destination directory's default ACL), and their special permission bits disabled except in the case where a new directory inherits a setgid bit from its parent directory.
uk: Нові файли отримають «звичайні» біти прав доступу до файла джерела з маскою типових прав доступу каталогу отримувача (або umask процесу-отримувача, або права доступу, які визначено за допомогою типового ACL каталогу призначення), а їхні особливі біти прав доступу буде вимкнено, за винятком випадку, коли новий каталог успадковує біт setgid від свого батьківського каталогу.

source: Thus, when B<--perms> and B<--executability> are both disabled, rsync's behavior is the same as that of other file-copy utilities, such as B<cp>(1) and B<tar>(1).
uk: Таким чином, якщо вимкнено одразу B<--perms> і B<--executability>, поведінка rsync буде тією самою, що і поведінка інших програм для копіювання файлів, зокрема B<cp>(1) і B<tar>(1).

source: In summary: to give destination files (both old and new) the source permissions, use B<--perms>. To give new files the destination-default permissions (while leaving existing files unchanged), make sure that the B<--perms> option is off and use B<--chmod=ugo=rwX> (which ensures that all non-masked bits get enabled). If you'd care to make this latter behavior easier to type, you could define a popt alias for it, such as putting this line in the file B<~/.popt> (the following defines the B<-Z> option, and includes B<--no-g> to use the default group of the destination dir):
uk: Резюме: щоб надати файлам призначення (старим і новим) прав доступу джерела, скористайтеся B<--perms>. Щоб надати новим файлам типових для призначення прав доступу (не змінюючи прав доступу до наявних файлів), переконайтеся, що вимкнено параметр B<--perms> і скористайтеся параметром B<--chmod=ugo=rwX> (який забезпечує вмикання усіх незамаскованих бітів). Якщо вам хочеться скоротити останній запис параметра, ви можете визначити для нього альтернативу popt, додавши цей рядок до файла B<~/.popt> (нижче ми визначаємо параметр B<-Z> і включаємо B<--no-g>, щоб скористатися типовою групою-власником каталогу призначення):

source: You could then use this new option in a command such as this one:
uk: Ви можете скористатися цим новим параметром у команді, подібній до такої:

source: rsync -avZ src/ dest/
uk: rsync -avZ джерело/ призначення/

source: (Caveat: make sure that B<-a> does not follow B<-Z>, or it will re-enable the two B<--no-*> options mentioned above.)
uk: (Застереження: слід розташовувати B<-a> перед B<-Z>, інакше цей параметр повторно увімкне обидва параметри B<--no-*>, про які ми згадували вище.)

source: The preservation of the destination's setgid bit on newly-created directories when B<--perms> is off was added in rsync 2.6.7. Older rsync versions erroneously preserved the three special permission bits for newly-created files when B<--perms> was off, while overriding the destination's setgid bit setting on a newly-created directory. Default ACL observance was added to the ACL patch for rsync 2.6.7, so older (or non-ACL-enabled) rsyncs use the umask even if default ACLs are present. (Keep in mind that it is the version of the receiving rsync that affects these behaviors.)
uk: Збереження біта setgid у призначенні для новостворених каталогів, якщо вимкнено B<--perms>, було додано у rsync 2.6.7. У старіших версіях rsync помилково зберігалися три біти особливих прав доступу для новостворених файлів, якщо B<--perms> було вимкнено із перевизначенням встановленого біта setgid призначення для новоствореного каталогу. Типове дотримання ACL було додано у латці ACL до rsync 2.6.7, отже давніші (без вмикання ACL) версії rsyncs використовують umask, навіть якщо виявлено типові ACL. (Слід пам'ятати, що все це стосується версії rsync на боці отримувача.)

source: This option causes rsync to preserve the executability (or non-executability) of regular files when B<--perms> is not enabled. A regular file is considered to be executable if at least one 'x' is turned on in its permissions. When an existing destination file's executability differs from that of the corresponding source file, rsync modifies the destination file's permissions as follows:
uk: Цей параметр наказує rsync зберегти права щодо виконання (або невиконання) звичайних файлів, якщо не увімкнено B<--perms>. Звичайний файл вважатиметься виконуваним, якщо у його правах доступ увімкнено принаймні один біт «x». Якщо права доступу до виконання файла на боці призначення відрізняються від прав доступу відповідного файла джерела, rsync змінить права доступу до файла призначення таким чином:

source: To make a file non-executable, rsync turns off all its 'x' permissions.
uk: Щоб зробити файл непридатним до виконання, rsync вимикає усі його права доступу «x».

source: To make a file executable, rsync turns on each 'x' permission that has a corresponding 'r' permission enabled.
uk: Щоб зробити файл придатним до виконання, rsync вмикає усі права доступу «x», де увімкнено відповідні права доступу «r».

source: If B<--perms> is enabled, this option is ignored.
uk: Якщо увімкнено B<--perms>, цей параметр буде проігноровано.

source: This option causes rsync to update the destination ACLs to be the same as the source ACLs. The option also implies B<--perms>.
uk: Використання цього параметра наказує rsync оновлювати ACL призначення так, щоб вони були такими самими, що і ACL джерела. Параметр також неявним чином встановлює B<--perms>.

source: The source and destination systems must have compatible ACL entries for this option to work properly. See the B<--fake-super> option for a way to backup and restore ACLs that are not compatible.
uk: Щоб цей параметр працював належним чином, у системах джерела і призначення повинні бути сумісні записи ACL. Див. параметр B<--fake-super>, якщо потрібен спосіб резервного копіювання та відновлення ACL, які є несумісними.

source: This option causes rsync to update the destination extended attributes to be the same as the source ones.
uk: Використання цього параметра наказує rsync оновлювати розширені атрибути призначення так, щоб вони були такими самими, що і розширені атрибути джерела.

source: For systems that support extended-attribute namespaces, a copy being done by a super-user copies all namespaces except system.*. A normal user only copies the user.* namespace. To be able to backup and restore non-user namespaces as a normal user, see the B<--fake-super> option.
uk: У системах, де передбачено підтримку просторів назв розширених атрибутів, копіювання, що виконується надкористувачем, копіюватиме усі простори назв, окрім system.*. Звичайний користувач зможе скопіювати лише простір назв user.*. Щоб мати змогу створювати резервні копії і відновлювати дані для просторів назв поза user.* від імені звичайного користувача, скористайтеся параметром B<--fake-super>.

source: The above name filtering can be overridden by using one or more filter options with the B<x> modifier. When you specify an xattr-affecting filter rule, rsync requires that you do your own system/user filtering, as well as any additional filtering for what xattr names are copied and what names are allowed to be deleted. For example, to skip the system namespace, you could specify:
uk: Описане вище фільтрування назв можна перевизначити за допомогою одного або декількох параметрів фільтрування з модифікатором B<x>. Якщо ви визначаєте правило фільтрування, що стосуватиметься x-атрибутів, rsync вимагатиме, щоб ви створили власне фільтрування на рівні системи/користувача, а також виконали усе додаткове фільтрування щодо того, які назви x-атрибутів буде скопійовано, і які можна буде вилучити. Наприклад, щоб пропустити простір назв system, ви можете вказати таке:

source: To skip all namespaces except the user namespace, you could specify a negated-user match:
uk: Щоб пропустити усі простори назв, окрім простору назв user, ви можете вказати відповідність запереченню рядку user:

source: To prevent any attributes from being deleted, you could specify a receiver-only rule that excludes all names:
uk: Щоб запобігти вилученню атрибутів, ви можете вказати правило лише для отримувача, яке виключає усі назви:

source: Note that the B<-X> option does not copy rsync's special xattr values (e.g. those used by B<--fake-super>) unless you repeat the option (e.g. B<-XX>). This "copy all xattrs" mode cannot be used with B<--fake-super>.
uk: Зауважте, що використання параметра B<-X> не призведе до копіювання rsync значень особливих x-атрибутів (наприклад тих, які використовує B<--fake-super>), якщо ви не повторите цей параметр (наприклад, B<-XX>). Цей режим «копіювання усіх x-атрибутів» не можна використовувати разом із B<--fake-super>.

source: B<--chmod=CHMOD>
uk: B<--chmod=РЕЖИМ>

source: This option tells rsync to apply one or more comma-separated "chmod" modes to the permission of the files in the transfer. The resulting value is treated as though it were the permissions that the sending side supplied for the file, which means that this option can seem to have no effect on existing files if B<--perms> is not enabled.
uk: Цей параметр наказує rsync застосувати один або декілька відокремлених комами режимів «chmod» до прав доступу до файлів у передаванні даних. Отримане у результаті значення буде оброблено так, наче це були права доступу на боці надсилання, що означає, що цей параметр не вплине на наявні файли, якщо не увімкнено B<--perms>.

source: In addition to the normal parsing rules specified in the B<chmod>(1) manpage, you can specify an item that should only apply to a directory by prefixing it with a 'D', or specify an item that should only apply to a file by prefixing it with a 'F'. For example, the following will ensure that all directories get marked set-gid, that no files are other-writable, that both are user-writable and group-writable, and that both have consistent executability across all bits:
uk: На додачу до звичайних правил обробки, які вказано на сторінці підручника щодо B<chmod>(1), ви можете вказати запис, який має бути застосовано до каталогу, додавши префікс «D», або вказати запис, який слід застосувати лише до файла, додавши префікс «F». Наприклад, вказана нижче команда забезпечить позначення усіх каталогів бітом setgid, те, що усі файли не будуть придатними до запису іншими користувачами, придатними до запису користувачем і групою-власником, і каталоги і файли матимуть узгоджені права на запуск для усіх бітів:

source: Using octal mode numbers is also allowed:
uk: Також можна використовувати числові вісімкові режими:

source: It is also legal to specify multiple B<--chmod> options, as each additional option is just appended to the list of changes to make.
uk: Також можна вказати декілька параметрів B<--chmod>, оскільки кожен додатковий параметр просто дописує дані до списку змін, які слід внести.

source: See the B<--perms> and B<--executability> options for how the resulting permission value can be applied to the files in the transfer.
uk: Див. опис параметрів B<--perms> і B<--executability>, щоб дізнатися про те, як остаточне значення прав доступу може бути застосовано до файлів при передаванні.

source: This option causes rsync to set the owner of the destination file to be the same as the source file, but only if the receiving rsync is being run as the super-user (see also the B<--super> and B<--fake-super> options). Without this option, the owner of new and/or transferred files are set to the invoking user on the receiving side.
uk: Використання цього параметра наказує rsync встановити власника файла призначення так, щоб він збігався із власником файла джерела, але лише якщо rsync на боці отримувача запущено від імені надкористувача (див. також параметри B<--super> і B<--fake-super>). Без цього параметра власником нових і/або перенесених файлів буде користувач, який запустив програму на боці отримання даних.

source: The preservation of ownership will associate matching names by default, but may fall back to using the ID number in some circumstances (see also the B<--numeric-ids> option for a full discussion).
uk: Збереження прав власності типово призведе до прив'язки за назвами, але, за певних обставин, резервним варіантом буде використання числового ідентифікатора (див. також B<--numeric-ids> параметр, де наведено повне обговорення).

source: This option causes rsync to set the group of the destination file to be the same as the source file. If the receiving program is not running as the super-user (or if B<--no-super> was specified), only groups that the invoking user on the receiving side is a member of will be preserved. Without this option, the group is set to the default group of the invoking user on the receiving side.
uk: Використання цього параметра наказує rsync встановити таку саму групу-власника файла призначення, що і для файла джерела. Якщо програму на боці отримувача не запущено від імені надкористувача (або якщо не вказано B<--no-super>), буде збережено лише групи, учасником яких є користувач, який запустив програму на боці отримання. Без цього параметра буде встановлено типову групу користувача-власника у системі отримання даних.

source: The preservation of group information will associate matching names by default, but may fall back to using the ID number in some circumstances (see also the B<--numeric-ids> option for a full discussion).
uk: Збереження даних щодо групи-власника типово призведе до прив'язки за назвами, але, за певних обставин, резервним варіантом буде використання числового ідентифікатора (див. також B<--numeric-ids> параметр, де наведено повне обговорення).

source: This option causes rsync to transfer character and block device files to the remote system to recreate these devices. If the receiving rsync is not being run as the super-user, rsync silently skips creating the device files (see also the B<--super> and B<--fake-super> options).
uk: Використання цього параметра наказує rsync передавати файли символьних і блокових пристроїв на віддалену систему так, щоб відтворити ці пристрої. Якщо rsync на боці отримання не запущено від імені надкористувача, rsync без додаткових повідомлень пропустить створення файлів пристроїв (див. також параметри B<--super> і B<--fake-super>).

source: By default, rsync generates a "non-regular file" warning for each device file encountered when this option is not set. You can silence the warning by specifying B<--info=nonreg0>.
uk: Типово, rsync створює повідомлення «незвичайний файл» для кожного файла пристрою, який трапиться програмі, коли цей параметр не використано. Ви можете придушити це попередження, вказавши параметр B<--info=nonreg0>.

source: This option causes rsync to transfer special files, such as named sockets and fifos. If the receiving rsync is not being run as the super-user, rsync silently skips creating the special files (see also the B<--super> and B<--fake-super> options).
uk: Використання цього параметра наказує rsync передавати особливі файли , зокрема іменовані сокети і FIFO. Якщо rsync на боці отримання не запущено від імені надкористувача, rsync без додаткових повідомлень пропустить створення особливих файлів (див. також параметри B<--super> і B<--fake-super>).

source: By default, rsync generates a "non-regular file" warning for each special file encountered when this option is not set. You can silence the warning by specifying B<--info=nonreg0>.
uk: Типово, rsync створює повідомлення «незвичайний файл» для кожного особливого файла, який трапиться програмі, коли цей параметр не використано. Ви можете придушити це попередження, вказавши параметр B<--info=nonreg0>.

source: The B<-D> option is equivalent to "B<--devices> B<--specials>".
uk: Параметр B<-D> є тим сами, що і «B<--devices> B<--specials>».

source: This tells rsync to treat a device on the sending side as a regular file, allowing it to be copied to a normal destination file (or another device if B<--write-devices> was also specifed).
uk: Цей параметр наказує rsync обробляти пристрій на боці відправника як звичайний файл, уможливлюючи його копіювання до звичайного файла призначення (або іншого пристрою, якщо також вказано B<--write-devices>).

source: This option is refused by default by an rsync daemon.
uk: Цей параметр типово буде відкинуто фоновою службою rsync.

source: This tells rsync to treat a device on the receiving side as a regular file, allowing the writing of file data into a device.
uk: Цей параметр наказує rsync обробляти пристрій на боці отримання як звичайний файл, надаючи змогу записувати дані файла на пристрій.

source: This option implies the B<--inplace> option.
uk: Цей параметр неявним чином встановлює параметр B<--inplace>.

source: Be careful using this, as you should know what devices are present on the receiving side of the transfer, especially when running rsync as root.
uk: Будьте обережні з користуванням, оскільки вам потрібно буде знати, які пристрої є на боці отримання даних, особливо, якщо rsync запущено від імені користувача root.

source: This tells rsync to transfer modification times along with the files and update them on the remote system. Note that if this option is not used, the optimization that excludes files that have not been modified cannot be effective; in other words, a missing B<-t> (or B<-a>) will cause the next transfer to behave as if it used B<--ignore-times> (B<-I>), causing all files to be updated (though rsync's delta-transfer algorithm will make the update fairly efficient if the files haven't actually changed, you're much better off using B<-t>).
uk: Використання цього параметра наказує rsync переносити разом із файлами дані щодо часу внесення змін і оновлювати їх на віддаленій системі. Зауважте, що якщо цей параметр не використано, не можна буде скористатися і оптимізацією, яка виключає файли, які не було змінено; іншими словами, пропущений B<-t> (або B<-a>) призведе до того, що при наступному передаванні даних програма поводитиметься так, наче її використано з B<--ignore-times> (B<-I>), тобто буде оновлено усі файли (хоча алгоритм дельта-передавання rsync зробить оновлення доволі ефективним, якщо файли насправді не було змінено, вам не варто користуватися B<-t>).

source: This tells rsync to set the access (use) times of the destination files to the same value as the source files.
uk: Наказує rsync встановити часи доступу (використання) для файлів призначення такі самі, як для файлів джерела.

source: If repeated, it also sets the B<--open-noatime> option, which can help you to make the sending and receiving systems have the same access times on the transferred files without needing to run rsync an extra time after a file is transferred.
uk: Якщо повторити параметр, буде встановлено також параметр B<--open-noatime>, який може допомогти вам зробити часи доступу у системах надсилання і отримання однаковими без потреби у додатковому запуску rsync після перенесення даних файла.
