Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: This tells rsync to remove from the sending side the files (meaning non-directories) that are a part of the transfer and have been successfully duplicated on the receiving side.
uk: За допомогою цього параметра можна наказати rsync вилучати зі сторони надсилання файли (тобто елементи, які не є каталогами), дублікати яких під час перенесення було успішно створено на стороні отримання даних.

source: Note that you should only use this option on source files that are quiescent. If you are using this to move files that show up in a particular directory over to another host, make sure that the finished files get renamed into the source directory, not directly written into it, so that rsync can't possibly transfer a file that is not yet fully written. If you can't first write the files into a different directory, you should use a naming idiom that lets rsync avoid transferring files that are not yet finished (e.g. name the file "foo.new" when it is written, rename it to "foo" when it is done, and then use the option B<--exclude='*.new'> for the rsync transfer).
uk: Зауважте, що вам слід користуватися цим параметром для файлів джерела, лише якщо вони є статичними. Якщо ви користуєтеся цим для пересування файлів у певному каталозі на інший вузол зв'язку, переконайтеся, що завершені файли перейменовано у каталозі джерела, а не безпосередньо записано до нього, щоб не виникло ситуації, коли rsync переноситиме файл, який записано не повністю. Якщо ви не можете спочатку записати файли до іншого каталогу, вам слід скористатися ідіомою іменування, яка дозволить rsync уникнути перенесення файлів, запис до яких ще не було завершено (наприклад, називайте файл «щось.new», доки до нього виконується запис, перейменуйте його на «щось», коли запис буде завершено, а потім скористайтеся параметром B<--exclude='*.new'> для передавання даних rsync).

source: Starting with 3.1.0, rsync will skip the sender-side removal (and output an error) if the file's size or modify time has not stayed unchanged.
uk: Починаючи з версії 3.1.0, rsync пропускатиме вилучення на боці відправника (і виведення повідомлення про помилку), якщо розмір файла або час внесення змін до файла було змінено.

source: This tells rsync to delete extraneous files from the receiving side (ones that aren't on the sending side), but only for the directories that are being synchronized. You must have asked rsync to send the whole directory (e.g. "B<dir>" or "B<dir/>") without using a wildcard for the directory's contents (e.g. "B<dir/*>") since the wildcard is expanded by the shell and rsync thus gets a request to transfer individual files, not the files' parent directory. Files that are excluded from the transfer are also excluded from being deleted unless you use the B<--delete-excluded> option or mark the rules as only matching on the sending side (see the include/exclude modifiers in the FILTER RULES section).
uk: Наказує rsync вилучити зайві файли з боку отримання (ті файли, яких немає на боці відправника), але лише для каталогів, синхронізація яких відбувається. Вам слід наказати rsync надіслати увесь каталог (наприклад «B<каталог>» або «B<каталог/>») без використання замінника для вмісту каталогу (наприклад «B<каталог/*>»), оскільки замінник буде розгорнуто командною оболонкою, і,таким чином, rsync отримає запит щодо перенесення окремих файлів, а не батьківського каталогу цих файлів. Файли, які виключено з передавання, також буде виключено з вилучення, якщо ви не скористаєтеся параметром B<--delete-excluded> або не визначите правила, як такі, відповідність яких визначається на боці відправника (див. модифікатори включення-виключення у розділі ПРАВИЛА ФІЛЬТРУВАННЯ).

source: Prior to rsync 2.6.7, this option would have no effect unless B<--recursive> was enabled. Beginning with 2.6.7, deletions will also occur when B<--dirs> (B<-d>) is enabled, but only for directories whose contents are being copied.
uk: До версії rsync 2.6.7 цей параметр ні на що не впливав, якщо не було увімкнено B<--recursive>. Починаючи з версії 2.6.7, вилучення відбувається і якщо увімкнено B<--dirs> (B<-d>), але лише для каталогів, чи вміст копіює програма.

source: This option can be dangerous if used incorrectly! It is a very good idea to first try a run using the B<--dry-run> (B<-n>) option to see what files are going to be deleted.
uk: Цей параметр може бути небезпечним, якщо його використано не належним чином! Завжди варто спочатку спробувати скористатися параметром B<--dry-run> (B<-n>), щоб визначити, які файли буде вилучено.

source: If the sending side detects any I/O errors, then the deletion of any files at the destination will be automatically disabled. This is to prevent temporary filesystem failures (such as NFS errors) on the sending side from causing a massive deletion of files on the destination. You can override this with the B<--ignore-errors> option.
uk: Якщо на боці відправника буде виявлено якісь помилки введення-виведення, вилучення будь-яких файлів на боці призначення буде автоматично вимкнено. Так зроблено, щоб запобігти спричиненню тимчасовими помилками у файловій системі (зокрема помилками NFS) на боці надсилання масовому вилученню файлів на боці призначення. Ви можете перевизначити таку поведінку за допомогою параметра B<--ignore-errors>.

source: The B<--delete> option may be combined with one of the --delete-WHEN options without conflict, as well as B<--delete-excluded>. However, if none of the B<--delete-WHEN> options are specified, rsync will choose the B<--delete-during> algorithm when talking to rsync 3.0.0 or newer, or the B<--delete-before> algorithm when talking to an older rsync. See also B<--delete-delay> and B<--delete-after>.
uk: Параметр B<--delete> може бути поєднаного з одним із параметрів --delete-УМОВА без конфлікту, а також з параметром B<--delete-excluded>. Втім, якщо не вказано жодного параметра B<--delete-УМОВА>, rsync вибере алгоритм B<--delete-during> при обміні даними із rsync 3.0.0 або новішою версією або алгоритм B<--delete-before> при обміні даними із застарілою версією rsync. Див. також B<--delete-delay> і B<--delete-after>.

source: Request that the file-deletions on the receiving side be done before the transfer starts. See B<--delete> (which is implied) for more details on file-deletion.
uk: Вимагати, щоб вилучення файлів на боці отримання виконувалося до початку передавання даних. Див. B<--delete> (буде задано неявним чином), щоб дізнатися більше про вилучення файлів.

source: Deleting before the transfer is helpful if the filesystem is tight for space and removing extraneous files would help to make the transfer possible. However, it does introduce a delay before the start of the transfer, and this delay might cause the transfer to timeout (if B<--timeout> was specified). It also forces rsync to use the old, non-incremental recursion algorithm that requires rsync to scan all the files in the transfer into memory at once (see B<--recursive>).
uk: Вилучення до передавання даних є корисним, якщо у файловій системі доволі мало місця, і вилучення зайвих файлів допоможе зробити передавання даних можливим. Втім, воно додає затримку перед початком перенесення даних, і ця затримка може спричинити перевищення часу очікування на початок передавання даних (якщо вказано параметр B<--timeout>). Таке вилучення також примушує rsync до використання застарілого алгоритму без нарощувальної рекурсії, який потребує від rsync одночасного сканування у пам'яті усіх файлів у списку передавання (див. B<--recursive>).

source: Request that the file-deletions on the receiving side be done incrementally as the transfer happens. The per-directory delete scan is done right before each directory is checked for updates, so it behaves like a more efficient B<--delete-before>, including doing the deletions prior to any per-directory filter files being updated. This option was first added in rsync version 2.6.4. See B<--delete> (which is implied) for more details on file-deletion.
uk: Надсилає запит щодо того, щоб вилучення файлів на боці отримання виконувалося нарощувально із кожним передаванням даних. Сканування щодо вилучення для окремих каталогів виконується одразу перед перевіркою каталогу на оновлення, отже у цьому режимі програма поводиться, як із більш ефективним B<--delete-before>, включно із вилученням до оновлення будь-яких файлів фільтрування окремих каталогів. Цей параметр було вперше додано у версії rsync 2.6.4. Див. B<--delete> (буде встановлено неявним чином), щоб дізнатися більше про вилучення файлів.

source: Request that the file-deletions on the receiving side be computed during the transfer (like B<--delete-during>), and then removed after the transfer completes. This is useful when combined with B<--delay-updates> and/or B<--fuzzy>, and is more efficient than using B<--delete-after> (but can behave differently, since B<--delete-after> computes the deletions in a separate pass after all updates are done). If the number of removed files overflows an internal buffer, a temporary file will be created on the receiving side to hold the names (it is removed while open, so you shouldn't see it during the transfer). If the creation of the temporary file fails, rsync will try to fall back to using B<--delete-after> (which it cannot do if B<--recursive> is doing an incremental scan). See B<--delete> (which is implied) for more details on file-deletion.
uk: Надсилає запит щодо того, щоб перелік файлів для вилучення на боці отримання визначався під час передавання (подібно до B<--delete-during>), а потім файли було вилучено після завершення передавання даних. Корисно у поєднанні із параметрами B<--delay-updates> і/або B<--fuzzy>, і є більш ефективним за використання B<--delete-after> (але може поводитися інакше, оскільки B<--delete-after> визначає список для вилучення на окремому проході після завершення усіх оновлень). Якщо кількість вилучених файлів переповнюватиме внутрішній буфер, для зберігання назв буде створено тимчасовий файл на боці отримання (його буде вилучено після відкриття, тому ви не побачити його під час передавання даних). Якщо тимчасовий файл не вдасться створити, rsync спробує повернутися до використання B<--delete-after> (програма не зможе цього зробити, якщо B<--recursive> виконує нарощувальне сканування). Див. B<--delete> (буде встановлено неявним чином), щоб дізнатися більше про вилучення файлів.

source: Request that the file-deletions on the receiving side be done after the transfer has completed. This is useful if you are sending new per-directory merge files as a part of the transfer and you want their exclusions to take effect for the delete phase of the current transfer. It also forces rsync to use the old, non-incremental recursion algorithm that requires rsync to scan all the files in the transfer into memory at once (see B<--recursive>). See B<--delete> (which is implied) for more details on file-deletion.
uk: Надсилає запит щодо того, щоб перелік файлів для вилучення на боці отримання визначався після завершення передавання даних. Це корисно, якщо ви надсилаєте нові окремі для каталогу файли об'єднання як частину передавання даних, і ви хочете, щоб виключення окремих каталогів набували чинності на кроці вилучення поточного передавання даних. Також rsync буде примусово використано старий, не нарощувальний алгоритм рекурсії, який потребує від rsync одночасного сканування до пам'яті усіх файлів у передаванні (див. B<--recursive>). Див. B<--delete> (буде встановлено неявним чином), щоб дізнатися більше про вилучення файлів.

source: See also the B<--delete-delay> option that might be a faster choice for those that just want the deletions to occur at the end of the transfer.
uk: Див. також параметр B<--delete-delay>, який може бути швидшим варіантом для тих, хто хоче, щоб вилучення відбувалося наприкінці передавання даних.

source: In addition to deleting the files on the receiving side that are not on the sending side, this tells rsync to also delete any files on the receiving side that are excluded (see B<--exclude>). See the FILTER RULES section for a way to make individual exclusions behave this way on the receiver, and for a way to protect files from B<--delete-excluded>. See B<--delete> (which is implied) for more details on file-deletion.
uk: На додачу до вилучення на боці отримання файлів, яких немає на боці надсилання, цей параметр наказує rsync також вилучити будь-які файли, які виключено на боці отримання (див. B<--exclude>). Див. розділ ПРАВИЛА ФІЛЬТРУВАННЯ, щоб дізнатися більше про створення окремих виключень, які поводитимуться у цей спосіб на боці отримування, і спосіб захисту файлів від B<--delete-excluded>. Див. B<--delete> (буде встановлено неявним чином), щоб дізнатися більше про вилучення файлів.

source: When rsync is first processing the explicitly requested source files (e.g. command-line arguments or B<--files-from> entries), it is normally an error if the file cannot be found. This option suppresses that error, and does not try to transfer the file. This does not affect subsequent vanished-file errors if a file was initially found to be present and later is no longer there.
uk: Коли rsync спочатку обробляє явним чином вказані файли джерела (наприклад у аргументах рядка команди або записах B<--files-from>), програма вважає помилкою ситуацію, коли файл не знайдено. За допомогою цього параметра можна придушити повідомлення про такі помилки і просто не намагатися передати відповідний файл. Це не стосується наступних помилок, пов'язаних із зникненням файлів, які спочатку було виявлено, і які згодом зникли зі свого місця під час передавання даних.

source: This option takes the behavior of the (implied) B<--ignore-missing-args> option a step farther: each missing arg will become a deletion request of the corresponding destination file on the receiving side (should it exist). If the destination file is a non-empty directory, it will only be successfully deleted if B<--force> or B<--delete> are in effect. Other than that, this option is independent of any other type of delete processing.
uk: Цей параметр просуває поведінку (неявним чином встановленого) параметра B<--ignore-missing-args> ще на крок далі: кожен пропущений аргумент вважається запитом на вилучення відповідного файла призначення на боці отримувача (якщо він існує). Якщо файлом призначення є непорожній каталог, його буде успішно вилучено, лише якщо використано B<--force> або B<--delete>. Окрім цього, цей параметр є незалежним від обробки вилучення будь-яких інших типів.

source: The missing source files are represented by special file-list entries which display as a "B<*missing>" entry in the B<--list-only> output.
uk: Файли джерела, яких не вистачатиме, буде представлено особливими записами списку файлів, які буде показано як запис «B<*missing>» у виведених у відповідь на використання параметра B<--list-only> даних.

source: Tells B<--delete> to go ahead and delete files even when there are I/O errors.
uk: За допомогою цього пункту можна наказати програмі за умов використання параметра B<--delete> виконувати вилучення, навіть якщо сталися помилки вводу-виводу.

source: This option tells rsync to delete a non-empty directory when it is to be replaced by a non-directory. This is only relevant if deletions are not active (see B<--delete> for details).
uk: У разі використання цього параметра rsync вилучатиме непорожні каталоги, якщо їх слід замінити елементами, які не є каталогами. Цей параметр матиме значення, лише якщо не визначено параметрів вилучення вмісту (див. B<--delete>, щоб дізнатися більше).

source: Note for older rsync versions: B<--force> used to still be required when using B<--delete-after>, and it used to be non-functional unless the B<--recursive> option was also enabled.
uk: Зауваження щодо застарілих версій rsync: вам доведеться скористатися B<--force> при використанні B<--delete-after>, і параметр не працюватиме, якщо також не вказано B<--recursive>.

source: B<--max-delete=NUM>
uk: B<--max-delete=ЧИСЛО>

source: This tells rsync not to delete more than NUM files or directories. If that limit is exceeded, all further deletions are skipped through the end of the transfer. At the end, rsync outputs a warning (including a count of the skipped deletions) and exits with an error code of 25 (unless some more important error condition also occurred).
uk: Наказує rsync не вилучати більше, ніж ЧИСЛО файлів або каталогів. Якщо буде перевищено це обмеження, усі подальші вилучення до кінця передавання файлів буде пропущено. Наприкінці обробки rsync виведе попередження (включено із кількістю пропущених вилучень) і завершить роботу із кодом помилки 25 (якщо не станеться якась серйозніша помилка).

source: Beginning with version 3.0.0, you may specify B<--max-delete=0> to be warned about any extraneous files in the destination without removing any of them. Older clients interpreted this as "unlimited", so if you don't know what version the client is, you can use the less obvious B<--max-delete=-1> as a backward-compatible way to specify that no deletions be allowed (though really old versions didn't warn when the limit was exceeded).
uk: Починаючи з версії 3.0.0, ви можете вказати B<--max-delete=0>, щоб програма попередила вас про будь-які зайві файли у призначенні без вилучення жодного з цих файлів. Застарілі клієнти обробляють таке значення як «без обмежень», тому, якщо вам не відома версія клієнта, ви можете скористатися менш очевидним B<--max-delete=-1>, як зворотно сумісним способом вказати, що вилучати файли заборонено (хоча дуже старі версії програми не попереджали про перевищення обмеження).

source: B<--max-size=SIZE>
uk: B<--max-size=РОЗМІР>

source: This tells rsync to avoid transferring any file that is larger than the specified SIZE. A numeric value can be suffixed with a string to indicate the numeric units or left unqualified to specify bytes. Feel free to use a fractional value along with the units, such as B<--max-size=1.5m>.
uk: Наказує rsync уникати передавання будь-якого файла, який є більшим за вказаний РОЗМІР. До числового значення можна дописати суфікс із рядком, який вказує на одиниці виміру, або не вказувати суфікс, щоб вказати значення у байтах. Можете скористатися дробовим значенням із визначенням одиниць, наприклад B<--max-size=1.5m>.

source: The first letter of a units string can be B<B> (bytes), B<K> (kilo), B<M> (mega), B<G> (giga), B<T> (tera), or B<P> (peta). If the string is a single char or has "ib" added to it (e.g. "G" or "GiB") then the units are multiples of 1024. If you use a two-letter suffix that ends with a "B" (e.g. "kb") then you get units that are multiples of 1000. The string's letters can be any mix of upper and lower-case that you want to use.
uk: Першою літерою рядка одиниці може бути B<B> (байти), B<K> (кіло), B<M> (мега), B<G> (гіга), B<T> (тера) або B<P> (пета). Якщо рядок є одиничним символом або одиничним символом із додаванням «ib» (наприклад, «G» або «GiB»), одиниці будуть кратними до 1024. Якщо ви використовуєте дволітерний суфікс, що завершується на «B» (наприклад «kb»), одиниці будуть кратними до 1000. Літери рядка можуть бути будь-якою сумішшю літер верхнього і нижнього регістрів, якою ви хочете скористатися.

source: Finally, if the string ends with either "+1" or "-1", it is offset by one byte in the indicated direction. The largest possible value is usually B<8192P-1>.
uk: Нарешті, якщо рядок завершується на «+1» або «-1», він вважатиметься відступом на один байт у відповідному напрямку. Найбільшим можливим значенням, зазвичай, є B<8192P-1>.

source: Examples: B<--max-size=1.5mb-1> is 1499999 bytes, and B<--max-size=2g+1> is 2147483649 bytes.
uk: Приклади: B<--max-size=1.5mb-1> — це 1499999 байтів, а B<--max-size=2g+1> — це 2147483649 байтів.

source: Note that rsync versions prior to 3.1.0 did not allow B<--max-size=0>.
uk: Зауважте, що у версіях rsync до 3.1.0 не можна використовувати B<--max-size=0>.

source: B<--min-size=SIZE>
uk: B<--min-size=РОЗМІР>

source: This tells rsync to avoid transferring any file that is smaller than the specified SIZE, which can help in not transferring small, junk files. See the B<--max-size> option for a description of SIZE and other info.
uk: За допомогою цього пункту можна наказати rsync не переносити файли, розмір яких менший за вказане значення РОЗМІР. Таким чином можна уникнути надсилання малих зайвих файлів. Див. параметр B<--max-size>, щоб ознайомитися із описом аргументу РОЗМІР та іншими відомостями.

source: Note that rsync versions prior to 3.1.0 did not allow B<--min-size=0>.
uk: Зауважте, що у версіях rsync до 3.1.0 не можна використовувати B<--min-size=0>.

source: B<--max-alloc=SIZE>
uk: B<--max-alloc=РОЗМІР>

source: By default rsync limits an individual malloc/realloc to about 1GB in size. For most people this limit works just fine and prevents a protocol error causing rsync to request massive amounts of memory. However, if you have many millions of files in a transfer, a large amount of server memory, and you don't want to split up your transfer into multiple parts, you can increase the per-allocation limit to something larger and rsync will consume more memory.
uk: Типово, rsync обмежує окремі дії з malloc/realloc до розміру у приблизно 1 ГБ. У більшості випадків цього достатньо для запобігання помилкам протоколу, які пов'язано із тим, що rsync надсилає запит на надто великий обсяг пам'яті. Втім, якщо у вас мільйони файлів для передавання, багато пам'яті на сервері, і ви не хочете ділити ваші передавання даних на багато частин, ви можете збільшити обмеження на попереднє отримання пам'яті так, щоб програма rsync могла споживати більше пам'яті.

source: Keep in mind that this is not a limit on the total size of allocated memory. It is a sanity-check value for each individual allocation.
uk: Не забувайте, що це не обмеження на загальний об'єм отриманої пам'яті. Це просто притомне обмежувальне значення для кожного окремого запиту на отримання пам'яті.

source: See the B<--max-size> option for a description of how SIZE can be specified. The default suffix if none is given is bytes.
uk: Див. параметр B<--max-size>, щоб ознайомитися із описом того, як можна визначати РОЗМІР. Типовим суфіксом, якщо суфікс не задано, визначається розмір у байтах.

source: Beginning in 3.2.3, a value of 0 specifies no limit.
uk: Починаючи з версії 3.2.3, значення 0 знімає усі обмеження.

source: You can set a default value using the environment variable B<RSYNC_MAX_ALLOC> using the same SIZE values as supported by this option. If the remote rsync doesn't understand the B<--max-alloc> option, you can override an environmental value by specifying B<--max-alloc=1g>, which will make rsync avoid sending the option to the remote side (because "1G" is the default).
uk: Ви можете вказати типове значення за допомогою змінної середовища B<RSYNC_MAX_ALLOC>, використовуючи ті самі значення РОЗМІРУ, для яких передбачено підтримку для цього параметра. Якщо rsync на віддаленому кінці з'єднання не розуміє параметра B<--max-alloc>, ви можете перевизначити значення змінної середовища за допомогою параметра B<--max-alloc=1g>, який накаже rsync уникати надсилання параметра на віддалений бік (оскільки типовим значенням є «1G»).

source: B<--block-size=SIZE>, B<-B>
uk: B<--block-size=РОЗМІР>, B<-B>

source: This forces the block size used in rsync's delta-transfer algorithm to a fixed value. It is normally selected based on the size of each file being updated. See the technical report for details.
uk: За допомогою цього пункту можна визначити фіксований розмір блоку, який буде використано у алгоритмі дельта-передавання rsync. Докладніше про це можна дізнатися з технічного звіту.
