Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: 15 Apr 2022
uk: 15 квітня 2022 року

source: User Commands
uk: Команди користувача

source: NAME
uk: НАЗВА

source: rsync - a fast, versatile, remote (and local) file-copying tool
uk: rsync — швидкий, різнобічний, віддалений (і локальний) інструмент для копіювання файлів

source: SYNOPSIS
uk: КОРОТКИЙ ОПИС

source: Local: rsync [OPTION...] SRC... [DEST]
uk: Локально: rsync [ПАРАМЕТР...] ДЖЕРЕЛО... [ПРИЗНАЧЕННЯ]

source: Access via remote shell: Pull: rsync [OPTION...] [USER@]HOST:SRC... [DEST] Push: rsync [OPTION...] SRC... [USER@]HOST:DEST
uk: Доступ з віддаленої оболонки: Отримання: rsync [ПАРАМЕТР...] [КОРИСТУВАЧ@]ВУЗОЛ:ДЖЕРЕЛО... [ПРИЗНАЧЕННЯ] Надсилання: rsync [ПАРАМЕТР...] ДЖЕРЕЛО... [КОРИСТУВАЧ@]ВУЗОЛ:ПРИЗНАЧЕННЯ

source: Access via rsync daemon: Pull: rsync [OPTION...] [USER@]HOST::SRC... [DEST] rsync [OPTION...] rsync://[USER@]HOST[:PORT]/SRC... [DEST] Push: rsync [OPTION...] SRC... [USER@]HOST::DEST rsync [OPTION...] SRC... rsync://[USER@]HOST[:PORT]/DEST)
uk: Доступ з фонової служби rsync: Отримання: rsync [ПАРАМЕТР...] [КОРИСТУВАЧ@]ВУЗОЛ::ДЖЕРЕЛО... [ПРИЗНАЧЕННЯ] rsync [ПАРАМЕТР...] rsync://[КОРИСТУВАЧ@]ВУЗОЛ[:ПОРТ]/ДЖЕРЕЛО... [ПРИЗНАЧЕННЯ] Надсилання: rsync [ПАРАМЕТР...] ДЖЕРЕЛО... [КОРИСТУВАЧ@]ВУЗОЛ::ПРИЗНАЧЕННЯ rsync [ПАРАМЕТР...] ДЖЕРЕЛО... rsync://[КОРИСТУВАЧ@]ВУЗОЛ[:ПОРТ]/ПРИЗНАЧЕННЯ)

source: Usages with just one SRC arg and no DEST arg will list the source files instead of copying.
uk: Якщо вказано лише аргумент ДЖЕРЕЛО без аргументу ПРИЗНАЧЕННЯ, буде виведено список файлів джерела замість копіювання.

source: The online version of this manpage (that includes cross-linking of topics) is available at https://download.samba.org/pub/rsync/rsync.1.
uk: Інтернет-версія цієї сторінки підручника (із перехресними посиланнями) доступна за адресою https://download.samba.org/pub/rsync/rsync.1.

source: DESCRIPTION
uk: ОПИС

source: Rsync is a fast and extraordinarily versatile file copying tool. It can copy locally, to/from another host over any remote shell, or to/from a remote rsync daemon. It offers a large number of options that control every aspect of its behavior and permit very flexible specification of the set of files to be copied. It is famous for its delta-transfer algorithm, which reduces the amount of data sent over the network by sending only the differences between the source files and the existing files in the destination. Rsync is widely used for backups and mirroring and as an improved copy command for everyday use.
uk: Rsync є швидким і дуже різнобічним інструментом для копіювання файлів. Він може копіювати локально, на інший вузол або з іншого вузла за допомогою будь-якої віддаленої командної оболонки або з віддаленої фонової служби rsync чи до неї. Програма пропонує велику кількість параметрів, які керують усіма аспектами поведінки програми, і уможливлює дуже гнучке визначення набору файлів, які слід скопіювати. Програма відома своїм алгоритмом дельта-передавання, який зменшує обсяг даних, які передаються мережею, шляхом надсилання лише відмінностей між файлами джерела та наявними файлами призначення. Rsync широко використовують для резервного копіювання та створення дзеркал даних, як удосконалену версію команди копіювання для щоденного використання.

source: Rsync finds files that need to be transferred using a "quick check" algorithm (by default) that looks for files that have changed in size or in last-modified time. Any changes in the other preserved attributes (as requested by options) are made on the destination file directly when the quick check indicates that the file's data does not need to be updated.
uk: Rsync знаходить файли, які має бути передано, за допомогою алгоритму «швидкої перевірки» (типово), який шукає файли із різним розміром або різним часом останнього внесення змін. Усі зміни в інших збережених атрибутах (відповідно до параметрів) буде внесено до файла призначення безпосередньо, якщо швидка перевірка вказує, що дані у самому файлів не потребують оновлення.

source: Some of the additional features of rsync are:
uk: Серед додаткових можливостей rsync такі:

source: support for copying links, devices, owners, groups, and permissions
uk: підтримка копіювання посилань, пристроїв, власників, груп та прав доступу

source: exclude and exclude-from options similar to GNU tar
uk: параметри exclude і exclude-from, подібні до GNU tar

source: a CVS exclude mode for ignoring the same files that CVS would ignore
uk: режим виключення системи керування версіями (CVS) для ігнорування тих самих файлів, які ігнорує система керування версіями

source: can use any transparent remote shell, including ssh or rsh
uk: може використовувати будь-яку прозору віддалену оболонку, включно із ssh та rsh

source: does not require super-user privileges
uk: не потребує привілеїв надкористувача

source: pipelining of file transfers to minimize latency costs
uk: канальне передавання файлів для мінімізації латентності

source: support for anonymous or authenticated rsync daemons (ideal for mirroring)
uk: підтримка анонімних фонових служб та служб із розпізнаванням rsync (ідеально для створення дзеркал)

source: GENERAL
uk: ЗАГАЛЬНЕ

source: Rsync copies files either to or from a remote host, or locally on the current host (it does not support copying files between two remote hosts).
uk: Rsync копіює файли на віддалений вузол або з віддаленого вузла чи локально на поточному вузлі (підтримки копіювання файлів між двома віддаленими вузлами не передбачено).

source: There are two different ways for rsync to contact a remote system: using a remote-shell program as the transport (such as ssh or rsh) or contacting an rsync daemon directly via TCP. The remote-shell transport is used whenever the source or destination path contains a single colon (:) separator after a host specification. Contacting an rsync daemon directly happens when the source or destination path contains a double colon (::) separator after a host specification, OR when an rsync:// URL is specified (see also the USING RSYNC-DAEMON FEATURES VIA A REMOTE-SHELL CONNECTION section for an exception to this latter rule).
uk: Передбачено два різних способи зв'язку rsync із віддаленою системою: за допомогою каналу передавання даних програми віддаленої оболонки (зокрема ssh або rsh), або за допомогою встановлення зв'язку із фоновою службою rsync безпосередньо за допомогою TCP. Канал передавання даних віддаленої оболонки буде використано, якщо у записах шляхів джерела і призначення міститься двокрапка-роздільник (:) після специфікації вузла. Зв'язок із фоновою службою rsync безпосередньо відбувається, коли у записах шляхів джерела і призначення міститься роздільник — подвійна двокрапка (::) після специфікації вузла, або вказано адресу rsync:// (див. також розділ ВИКОРИСТАННЯ МОЖЛИВОСТЕЙ ФОНОВОЇ СЛУЖБИ RSYNC ЗА ДОПОМОГОЮ З'ЄДНАННЯ ВІДДАЛЕНОЇ ОБОЛОНКИ за виключенням цього останнього правила).

source: As a special case, if a single source arg is specified without a destination, the files are listed in an output format similar to "B<ls\ -l>".
uk: Окремим випадком, визначення лише аргументу джерела, без призначення. У цьому випадку буде виведено список файлів у форматі, подібному до «B<ls\ -l>».

source: As expected, if neither the source or destination path specify a remote host, the copy occurs locally (see also the B<--list-only> option).
uk: Як і слід очікувати, якщо ні шлях джерела, ні шлях призначення не вказують на віддалений вузол, копіювання виконуватиметься локально (див. також параметр B<--list-only>).

source: Rsync refers to the local side as the client and the remote side as the server. Don't confuse server with an rsync daemon. A daemon is always a server, but a server can be either a daemon or a remote-shell spawned process.
uk: У rsync локальним боком є клієнт, а віддаленим боком — сервер. Не слід плутати сервер із фоновою службою rsync. Фонова служба завжди є сервером, але сервер може бути як фоновою службою, так і породженим віддаленою оболонкою процесом.

source: SETUP
uk: НАЛАШТУВАННЯ

source: See the file README.md for installation instructions.
uk: Див. файл README.md, де наведено настанови щодо встановлення.

source: Once installed, you can use rsync to any machine that you can access via a remote shell (as well as some that you can access using the rsync daemon-mode protocol). For remote transfers, a modern rsync uses ssh for its communications, but it may have been configured to use a different remote shell by default, such as rsh or remsh.
uk: Після встановлення ви можете скористатися rsync на будь-якому комп'ютері, до якого ви маєте доступ за допомогою віддаленої оболонки (а також комп'ютері, до якого ви можете отримати доступ за допомогою протоколу режиму фонової служби rsync). Для віддаленого передавання даних у сучасній версії rsync буде використано ssh для обміну даними, але можна налаштувати типове використання іншої віддаленої оболонки, зокрема rsh або remsh.

source: You can also specify any remote shell you like, either by using the B<-e> command line option, or by setting the B<RSYNC_RSH> environment variable.
uk: Ви також можете вказати будь-яку бажану для вас віддалену оболонку за допомогою параметра командного рядка B<-e> або встановлення змінної середовища B<RSYNC_RSH>.

source: Note that rsync must be installed on both the source and destination machines.
uk: Зауважте, що rsync має бути встановлено на комп'ютерах джерела та призначення копійованих даних.

source: USAGE
uk: КОРИСТУВАННЯ

source: You use rsync in the same way you use rcp. You must specify a source and a destination, one of which may be remote.
uk: Користування rsync подібне до користування rcp. Вам слід вказати джерело і призначення, один із цих параметрів може бути віддаленим.

source: Perhaps the best way to explain the syntax is with some examples:
uk: Ймовірно, найкращим способом пояснити синтаксис команд є декілька прикладів:

source: rsync -t *.c foo:src/
uk: rsync -t *.c десь:джерело/

source: This would transfer all files matching the pattern B<*.c> from the current directory to the directory src on the machine foo. If any of the files already exist on the remote system then the rsync remote-update protocol is used to update the file by sending only the differences in the data. Note that the expansion of wildcards on the command-line (B<*.c>) into a list of files is handled by the shell before it runs rsync and not by rsync itself (exactly the same as all other Posix-style programs).
uk: Ця команда перенесе усі файли, назви яких відповідають взірцю B<*.c>, з поточного каталогу до каталогу «джерело» на комп'ютері «десь». Якщо у віддаленій файловій системі вже існують якість з копійованих файлів, буде використано протокол remote-update rsync для оновлення файлів шляхом надсилання лише відмінностей у даних, які у них зберігаються. Зауважте, що за розгортання шаблонів заміни у рядку команди (B<*.c>) до списку файлів відповідає командна оболонка, яка виконує це завдання до запуску rsync, а не сама програма rsync (так само, яке це справедливо для усіх інших програм у стилі Posix).

source: rsync -avz foo:src/bar /data/tmp
uk: rsync -avz десь:джерело/щось /data/tmp

source: This would recursively transfer all files from the directory src/bar on the machine foo into the /data/tmp/bar directory on the local machine. The files are transferred in archive mode, which ensures that symbolic links, devices, attributes, permissions, ownerships, etc. are preserved in the transfer. Additionally, compression will be used to reduce the size of data portions of the transfer.
uk: Ця команда виконає рекурсивне перенесення усіх файлів з каталогу «джерело/щось» на комп'ютері «десь» до каталогу «/data/tmp/щось» на локальному комп'ютері. Файли буде перенесено у режимі архівування, який зберігає символічні посилання, пристрої, атрибути, права доступу, права власності тощо під час перенесення. Крім того, для зменшення потоку даних буде використано стискання.

source: rsync -avz foo:src/bar/ /data/tmp
uk: rsync -avz десь:джерело/щось/ /data/tmp

source: A trailing slash on the source changes this behavior to avoid creating an additional directory level at the destination. You can think of a trailing / on a source as meaning "copy the contents of this directory" as opposed to "copy the directory by name", but in both cases the attributes of the containing directory are transferred to the containing directory on the destination. In other words, each of the following commands copies the files in the same way, including their setting of the attributes of /dest/foo:
uk: Кінцевий символ похилої риски в аргументі джерела змінює цю поведінку: у призначенні буде створено додатковий рівень каталогів. Кінцевий символ похилої риски можна розглядати як наказ «скопіювати вміст цього каталогу», замість «скопіювати каталог за назвою», але в обох випадках атрибути каталогу буде перенесено до відповідного каталогу призначення. Іншими словами, обидві наступні команди копіюють файли однаково, разом із їхнім набором атрибутів у /призначення/десь:

source: rsync -av /src/foo /dest rsync -av /src/foo/ /dest/foo
uk: rsync -av /джерело/десь /призначення rsync -av /джерело/десь/ /призначення/десь

source: Note also that host and module references don't require a trailing slash to copy the contents of the default directory. For example, both of these copy the remote directory's contents into "/dest":
uk: Зауважте також, що посилання на вузол і модуль не потребують завершальної похилої риски для копіювання вмісту типового каталогу. Наприклад, обидві ці команди скопіюють вміст віддаленого каталогу до «/призначення»:

source: rsync -av host: /dest rsync -av host::module /dest
uk: rsync -av вузол: /призначення rsync -av вузол::модуль /призначення

source: You can also use rsync in local-only mode, where both the source and destination don't have a ':' in the name. In this case it behaves like an improved copy command.
uk: Ви також можете скористатися rsync у режимі локального комп'ютера, де і у записі джерела, і у записі призначення немає «:». У цьому випадку програма поводить себе як удосконалена версія команди copy.

source: Finally, you can list all the (listable) modules available from a particular rsync daemon by leaving off the module name:
uk: Нарешті, ви можете ознайомитися зі списком усіх модулів певної фонової служби rsync, якщо не будете вказувати назви модуля:

source: rsync somehost.mydomain.com::
uk: rsync якийсь_вузол.mydomain.com::

source: See the following section for more details.
uk: Докладніше про це у наступному розділі.

source: ADVANCED USAGE
uk: ДОДАТКОВІ МОЖЛИВОСТІ

source: The syntax for requesting multiple files from a remote host is done by specifying additional remote-host args in the same style as the first, or with the hostname omitted. For instance, all these work:
uk: Синтаксична конструкція для запиту декількох файлів з віддаленого вузла є такою: слід задати додаткові аргументи віддаленого вузла у тому самому стилі, що і перший аргумент, або не вказувати назви вузла. Наприклад, працюватимуть усі такі команди:

source: rsync -aiv host:file1 :file2 host:file{3,4} /dest/ rsync -aiv host::modname/file{1,2} host::modname/extra /dest/ rsync -aiv host::modname/first ::modname/extra{1,2} /dest/
uk: rsync -aiv вузол:файл1 :файл2 вузол:файл{3,4} /призначення/ rsync -aiv вузол::назва_модуля/файл{1,2} вузол::назва_модуля/extra /призначення/ rsync -aiv вузол::назва_модуля/перший ::modname/extra{1,2} /призначення/

source: In a modern rsync, you only need to quote or backslash-escape things like spaces from the local shell but not also from the remote shell:
uk: У сучасних версіях rsync вам достатньо взяти у лапки або екранувати зворотною похилою рискою речі, подібні до пробілів з локальної оболонки, але не робити цього з віддаленої оболонки:

source: rsync -aiv host:'a simple file.pdf' /dest/
uk: rsync -aiv вузол:'простий файл.pdf' /призначення/

source: Really old versions of rsync only allowed specifying one remote-source arg, so it required the remote side to split the args at a space. You can still get this old-style arg splitting by using the B<--old-args> option:
uk: У дуже старих версіях rsync можна вказувати лише один аргумент remote-source, тому на віддаленому боці аргументи поділяються на пробілах. Ви усе ще можете скористатися цим давнім стилем поділу аргументів, якщо скористаєтеся параметром B<--old-args>:

source: rsync -ai --old-args host:'dir1/file1 dir2/file2' /dest rsync -ai --old-args host::'modname/dir1/file1 modname/dir2/file2' /dest
uk: rsync -ai --old-args вузол:'каталог1/файл1 каталог2/файл2' /призначення rsync -ai --old-args вузол::'назва_модуля/каталог1/файл1 назва_модуля/каталог2/файл2' /призначення

source: See that option's section for an environment variable that can be exported to help old scripts.
uk: Ознайомтеся із розділом щодо цього параметра, щоб дізнатися більше про змінну середовища, яку можна експортувати, щоб допомогти роботі застарілих скриптів.

source: CONNECTING TO AN RSYNC DAEMON
uk: ВСТАНОВЛЕННЯ З'ЄДНАННЯ ІЗ ФОНОВОЮ СЛУЖБОЮ RSYNC

source: It is also possible to use rsync without a remote shell as the transport. In this case you will directly connect to a remote rsync daemon, typically using TCP port 873. (This obviously requires the daemon to be running on the remote system, so refer to the STARTING AN RSYNC DAEMON TO ACCEPT CONNECTIONS section below for information on that.)
uk: Також можна скористатися rsync без віддаленої оболонки для передавання даних. У цьому випадку з'єднання із віддаленою фоновою службою rsync встановлюють безпосередньо, типово, за допомогою TCP, порт 873. (Це, очевидно, потребує запуску фонової служби у віддаленій системі, тому зверніться до розділу ЗАПУСК ФОНОВОЇ СЛУЖБИ RSYNC ДЛЯ ПРИЙНЯТТЯ З'ЄДНАНЬ, щоб дізнатися про це більше.)

source: Using rsync in this way is the same as using it with a remote shell except that:
uk: Користування rsync у цей спосіб подібне до користування програмою за допомогою віддаленої оболонки, окрім такого:

source: you either use a double colon :: instead of a single colon to separate the hostname from the path, or you use an rsync:// URL.
uk: вам слід або користуватися подвійною двокрапкою, ::, замість одинарної двокрапки для відокремлення назви вузла від шляху, або слід користуватися адресою rsync://.

source: the first word of the "path" is actually a module name.
uk: першим словом «шляху» має бути сама назва модуля.

source: the remote daemon may print a message of the day when you connect.
uk: віддалене фонова служба може виводити «повідомлення дня» при з'єднанні.

source: if you specify no path name on the remote daemon then the list of accessible paths on the daemon will be shown.
uk: якщо ви не вкажете назви шляху на віддаленій фоновій службі, буде виведено список доступних шляхів на фоновій службі.

source: if you specify no local destination then a listing of the specified files on the remote daemon is provided.
uk: якщо ви вкажете нелокальне призначення, буде виведено список вказаних файлів на віддаленій фоновій службі.

source: you must not specify the B<--rsh> (B<-e>) option (since that overrides the daemon connection to use ssh\ -- see USING RSYNC-DAEMON FEATURES VIA A REMOTE-SHELL CONNECTION below).
uk: вам не слід користуватися параметром B<--rsh> (B<-e>) (оскільки він наказує використовувати для з'єднання із фоновою службою ssh\ -- див. ВИКОРИСТАННЯ МОЖЛИВОСТЕЙ ФОНОВОЇ СЛУЖБИ RSYNC-ЗА ДОПОМОГОЮ З'ЄДНАННЯ ІЗ ВІДДАЛЕНОЮ ОБОЛОНКОЮ нижче).

source: An example that copies all the files in a remote module named "src":
uk: Приклад копіювання усіх файлів у віддаленому модулі із назвою «джерело»:

source: rsync -av host::src /dest
uk: rsync -av вузол::джерело /призначення

source: Some modules on the remote daemon may require authentication. If so, you will receive a password prompt when you connect. You can avoid the password prompt by setting the environment variable B<RSYNC_PASSWORD> to the password you want to use or using the B<--password-file> option. This may be useful when scripting rsync.
uk: Деякі модулі у віддаленій фоновій службі можуть потребувати проходження розпізнавання. Якщо ви матимете справу з таким модулем, програма покаже запит щодо пароля під час встановлення з'єднання. Ви можете уникнути запиту встановленням для змінної середовища B<RSYNC_PASSWORD> значення пароля, яким ви хочете скористатися, або додати до команди параметра B<--password-file>. Ці варіанти корисні при створенні скриптів з rsync.

source: WARNING: On some systems environment variables are visible to all users. On those systems using B<--password-file> is recommended.
uk: УВАГА! У деяких системах змінні середовища є видимими для усіх користувачів. У цих системах рекомендуємо користуватися параметром B<--password-file>.

source: You may establish the connection via a web proxy by setting the environment variable B<RSYNC_PROXY> to a hostname:port pair pointing to your web proxy. Note that your web proxy's configuration must support proxy connections to port 873.
uk: Ви можете встановити з'єднання за допомогою проксі-сервера, якщо встановите для змінної середовища B<RSYNC_PROXY> значення назва_вузла:порт, яке вказуватиме на ваш проксі-сервер. Зауважте, що у налаштуваннях вашого проксі-сервера має бути передбачено підтримку з'єднань з проксі-сервером на порту 873.

source: You may also establish a daemon connection using a program as a proxy by setting the environment variable B<RSYNC_CONNECT_PROG> to the commands you wish to run in place of making a direct socket connection. The string may contain the escape "%H" to represent the hostname specified in the rsync command (so use "%%" if you need a single "%" in your string). For example:
uk: Ви також можете встановлювати з'єднання з фоновою службою за допомогою програми, як проксі-сервера, встановленням для змінної середовища B<RSYNC_CONNECT_PROG> значення команд, які ви хочете запустити замість створення безпосереднього з'єднання із сокетом. У рядку може міститися замінник «%H», який є відповідником назви вузла, вказану у команді rsync (тому користуйтеся «%%», якщо вам потрібен одинарний символ «%» у рядку). Приклад:

source: export RSYNC_CONNECT_PROG='ssh proxyhost nc %H 873' rsync -av targethost1::module/src/ /dest/ rsync -av rsync://targethost2/module/src/ /dest/
uk: export RSYNC_CONNECT_PROG='ssh proxyhost nc %H 873' rsync -av цільовий_вузол1::модуль/джерело/ /призначення/ rsync -av rsync://цільовий_вузол2/модуль/джерело/ /призначення/

source: The command specified above uses ssh to run nc (netcat) on a proxyhost, which forwards all data to port 873 (the rsync daemon) on the targethost (%H).
uk: У вказаній вище команді використано ssh для запуску nc (netcat) на проксі-вузлі, який переспрямовує усі дані на порт 873 (фонова служба rsync) на цільовому_вузлі (%H).

source: Note also that if the B<RSYNC_SHELL> environment variable is set, that program will be used to run the B<RSYNC_CONNECT_PROG> command instead of using the default shell of the B<system()> call.
uk: Зауважте також, що якщо встановлення значення змінної середовища B<RSYNC_SHELL>, відповідну програму буде використано для запуску команди B<RSYNC_CONNECT_PROG> замість використання типової командної оболонки виклику B<system()>.

source: USING RSYNC-DAEMON FEATURES VIA A REMOTE-SHELL CONNECTION
uk: ВИКОРИСТАННЯ МОЖЛИВОСТЕЙ ФОНОВОЇ СЛУЖБИ RSYNC-ЗА ДОПОМОГОЮ З'ЄДНАННЯ ІЗ ВІДДАЛЕНОЮ ОБОЛОНКОЮ
