Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: Beginning in version 2.6.4, multiple B<--link-dest> directories may be provided, which will cause rsync to search the list in the order specified for an exact match (there is a limit of 20 such directories). If a match is found that differs only in attributes, a local copy is made and the attributes updated. If a match is not found, a basis file from one of the I<DIRs> will be selected to try to speed up the transfer.
uk: Починаючи з версії 26.4, в одній команді може бути вказано декілька каталогів B<--link-dest>, тобто наказати rsync шукати у відповідному списку каталогів за вказаним порядком точні відповідники (передбачено обмеження на 20 таких каталогів). Якщо буде знайдено відповідник, який відрізняється лише атрибутами, буде виконано локальне копіювання і оновлено атрибути. Якщо відповідника не буде знайдено, буде вибрано базовий файл з одного з I<КАТАЛОГІВ> у спробі пришвидшити передавання файлів.

source: This option works best when copying into an empty destination hierarchy, as existing files may get their attributes tweaked, and that can affect alternate destination files via hard-links. Also, itemizing of changes can get a bit muddled. Note that prior to version 3.1.0, an alternate-directory exact match would never be found (nor linked into the destination) when a destination file already exists.
uk: Цей параметр найкраще працює при копіювання до порожньої ієрархії каталогів призначення, оскільки для наявних файлів може бути скориговано атрибути, і це може вплинути на зміну файлів призначення через жорсткі посилання. Крім того, розпізнавання змін може бути дещо нечітким процесом. Зауважте, що до версії 3.1.0 точний відповідник у альтернативному каталозі не могло бути знайдено (і пов'язано із призначенням), якщо файл призначення вже існував.

source: Note that if you combine this option with B<--ignore-times>, rsync will not link any files together because it only links identical files together as a substitute for transferring the file, never as an additional check after the file is updated.
uk: Зауважте, що якщо ви поєднуєте цей параметр з B<--ignore-times>, rsync не пов'язуватиме посиланнями жодних файлів, оскільки програма пов'язує посиланнями тотожні файли, використовуючи це, як заміну передавання файла, а не як додаткову перевірку після оновлення файла.

source: If I<DIR> is a relative path, it is relative to the destination directory. See also B<--compare-dest> and B<--copy-dest>.
uk: Якщо I<КАТАЛОГ> є відносним шляхом, його буде визначено відносно каталогу призначення. Див. також B<--compare-dest> і B<--copy-dest>.

source: Note that rsync versions prior to 2.6.1 had a bug that could prevent B<--link-dest> from working properly for a non-super-user when B<--owner> (B<-o>) was specified (or implied). You can work-around this bug by avoiding the B<-o> option (or using B<--no-o>) when sending to an old rsync.
uk: Зауважте, що у версіях rsync до 2.6.1 була вада, яка могла завадити належній роботі B<--link-dest> від імені звичайного користувача, якщо було вказано B<--owner> (B<-o>) (можливо, неявним чином). Обійти цю ваду можна униканням використання параметра B<-o> (або використанням B<--no-o>) при надсиланні даних до застарілої версії rsync.

source: With this option, rsync compresses the file data as it is sent to the destination machine, which reduces the amount of data being transmitted\ -- something that is useful over a slow connection.
uk: З цим параметром rsync стискає дані файлів при надсиланні на комп'ютер призначення. Це зменшує обсяг даних при передаванні — корисно для повільних з'єднань.

source: Rsync supports multiple compression methods and will choose one for you unless you force the choice using the B<--compress-choice> (B<--zc>) option.
uk: У rsync передбачено підтримку декількох способів стискання. Програма автоматично вибере спосіб стискання, якщо ви не вкажете його явним чином за допомогою параметра B<--compress-choice> (B<--zc>).

source: Run B<rsync\ --version> to see the default compress list compiled into your version.
uk: Віддайте команду B<rsync\ --version>, щоб переглянути список типових способів стискання, підтримку яких було зібрано у вашій версії.

source: When both sides of the transfer are at least 3.2.0, rsync chooses the first algorithm in the client's list of choices that is also in the server's list of choices. If no common compress choice is found, rsync exits with an error. If the remote rsync is too old to support checksum negotiation, its list is assumed to be "zlib".
uk: Якщо на обох кінцях ланцюжка передавання даних встановлено принаймні версію 3.2.0, rsync вибиратиме перший алгоритм у списку варіантів клієнта, який є у списку варіантів сервера. Якщо не буде знайдено спільного варіанта, rsync завершить роботу повідомленням про помилку. Якщо rsync на віддаленому кінці ланцюжка передавання є надто старим для підтримки узгодження за контрольними сумами, його списком вважатиметься «zlib».

source: The default order can be customized by setting the environment variable B<RSYNC_COMPRESS_LIST> to a space-separated list of acceptable compression names. If the string contains a "B<&>" character, it is separated into the "client string & server string", otherwise the same string applies to both. If the string (or string portion) contains no non-whitespace characters, the default compress list is used. Any unknown compression names are discarded from the list, but a list with only invalid names results in a failed negotiation.
uk: Типовий порядок можна налаштувати встановленням значення змінної середовища B<RSYNC_COMPRESS_LIST>. Значенням має бути список відокремлених пробілами прийнятних назв способів стискання. Якщо рядок містить символ «B<&>», його буде розділено на «рядок клієнта & рядок сервера», якщо рядок не містить цього символу, його буде застосовано до обох. Якщо рядок (або частина рядка) не містить непробільних символів, буде використано типовий список способів стискання. Усі невідомі програмі назви способів стискання буде викинуто зі списку, але список, що складатиметься лише з некоректних записів призведе до помилки під час узгодження.

source: There are some older rsync versions that were configured to reject a B<-z> option and require the use of B<-zz> because their compression library was not compatible with the default zlib compression method. You can usually ignore this weirdness unless the rsync server complains and tells you to specify B<-zz>.
uk: Існують деякі стані версії rsync, які було налаштовано на відкидання параметра B<-z> і обов'язкове використання параметра B<-zz>, оскільки їхня бібліотека для стискання була несумісною із типовим способом стискання zlib. Зазвичай, ви можете ігнорувати ці проблеми, якщо сервер rsync не скаржиться і не повідомляє вам, що вам слід вказати B<-zz>.

source: B<--compress-choice=STR>, B<--zc=STR>
uk: B<--compress-choice=РЯДОК>, B<--zc=РЯДОК>

source: This option can be used to override the automatic negotiation of the compression algorithm that occurs when B<--compress> is used. The option implies B<--compress> unless "none" was specified, which instead implies B<--no-compress>.
uk: Цим параметром можна скористатися для перевизначення автоматичного узгодження алгоритму стискання, яке відбувається при використанні B<--compress>. Використання параметра неявним чином встановлює параметр B<--compress>, якщо не було вказано «none». Якщо вказано «none», буде неявним чином встановлено B<--no-compress>.

source: The compression options that you may be able to use are:
uk: Параметри стискання, якими ви можете скористатися, є такими:

source: Run B<rsync\ --version> to see the default compress list compiled into your version (which may differ from the list above).
uk: Віддайте команду B<rsync\ --version>, щоб переглянути список типових способів стискання, підтримку яких було зібрано у вашій версії (список може відрізнятися від наведеного вище).

source: Note that if you see an error about an option named B<--old-compress> or B<--new-compress>, this is rsync trying to send the B<--compress-choice=zlib> or B<--compress-choice=zlibx> option in a backward-compatible manner that more rsync versions understand. This error indicates that the older rsync version on the server will not allow you to force the compression type.
uk: Зауважте, що якщо ви бачите помилку щодо параметра із назвою B<--old-compress> або B<--new-compress>, це означає, що rsync намагається надіслати параметр B<--compress-choice=zlib> або B<--compress-choice=zlibx> у зворотно сумісний спосіб, який зрозумілий ширшому спектру версій rsync. Це повідомлення про помилку вказує на те, що застаріла версія rsync на сервері не дозволить вам примусово встановити тип стискання.

source: Note that the "zlibx" compression algorithm is just the "zlib" algorithm with matched data excluded from the compression stream (to try to make it more compatible with an external zlib implementation).
uk: Зауважте, що алгоритм стискання «zlibx» є простим алгоритмом «zlib» із виключенням відповідних даних з потоку стискання (щоб зробити його суміснішим із зовнішньою реалізацією zlib).

source: B<--compress-level=NUM>, B<--zl=NUM>
uk: B<--compress-level=ЧИСЛО>, B<--zl=ЧИСЛО>

source: Explicitly set the compression level to use (see B<--compress>, B<-z>) instead of letting it default. The B<--compress> option is implied as long as the level chosen is not a "don't compress" level for the compression algorithm that is in effect (e.g. zlib compression treats level 0 as "off").
uk: Встановити рівень стискання явними чином (див. B<--compress>, B<-z>), замість типового значення. Неявним чином буде встановлено параметр B<--compress>, якщо вибраним рівнем не є рівень «не стискати» для використаного алгоритму стискання (наприклад, zlib вважає рівень 0 рівнем вимикання стискання).

source: The level values vary depending on the checksum in effect. Because rsync will negotiate a checksum choice by default (when the remote rsync is new enough), it can be good to combine this option with a B<--compress-choice> (B<--zc>) option unless you're sure of the choice in effect. For example:
uk: Значення рівня залежать від вибраної контрольної суми. Оскільки rsync типово узгоджуватиме варіант контрольної суми (якщо віддалена версія rsync є достатньо новою), варто поєднати цей параметр з параметром B<--compress-choice> (B<--zc>), якщо ви не певні щодо вибраного варіанта. Приклад:

source: rsync -aiv --zc=zstd --zl=22 host:src/ dest/
uk: rsync -aiv --zc=zstd --zl=22 вузол:джерело/ призначення/

source: For zlib & zlibx compression the valid values are from 1 to 9 with 6 being the default. Specifying B<--zl=0> turns compression off, and specifying B<--zl=-1> chooses the default level of 6.
uk: Для стискань zlib і zlibx коректними значеннями є цілі числа від 1 до 9, типовим є 6. Вибір B<--zl=0> вимикає стискання, а визначення B<--zl=-1> призводить до вибору типового рівня 6.

source: For zstd compression the valid values are from -131072 to 22 with 3 being the default. Specifying 0 chooses the default of 3.
uk: Для стискання zstd коректними значеннями є цілі числа від -131072 до 22, типовим є 3. Визначення 0 призводить до вибору типового рівня 3.

source: For lz4 compression there are no levels, so the value is always 0.
uk: Для способу стискання lz4 не передбачено рівнів, отже, значенням завжди є 0.

source: If you specify a too-large or too-small value, the number is silently limited to a valid value. This allows you to specify something like B<--zl=999999999> and be assured that you'll end up with the maximum compression level no matter what algorithm was chosen.
uk: Якщо ви вкажете надто велике або надто мале значення, програма без повідомлень скоригує його до прийнятного. Ви можете вказати щось подібне до B<--zl=999999999> і бути певними, що отримаєте максимально можливий рівень, незалежно від використаного алгоритму.

source: If you want to know the compression level that is in effect, specify B<--debug=nstr> to see the "negotiated string" results. This will report something like "B<Client\ compress:\ zstd\ (level\ 3)>" (along with the checksum choice in effect).
uk: Якщо ви хочете дізнатися, яким є поточний рівень стискання, вкажіть параметр B<--debug=nstr>, щоб переглянути результати щодо «узгодженого рядка». Програма виведе щось таке: «B<Client\ compress:\ zstd\ (level\ 3)>» (разом із даними щодо вибраного варіанта контрольної суми).

source: B<--skip-compress=LIST>
uk: B<--skip-compress=СПИСОК>

source: B<NOTE:> no compression method currently supports per-file compression changes, so this option has no effect.
uk: B<ЗАУВАЖЕННЯ:> зміни способу стискання для окремих файлів у поточній версії не передбачено, тому цей параметр не працюватиме.

source: Override the list of file suffixes that will be compressed as little as possible. Rsync sets the compression level on a per-file basis based on the file's suffix. If the compression algorithm has an "off" level, then no compression occurs for those files. Other algorithms that support changing the streaming level on-the-fly will have the level minimized to reduces the CPU usage as much as possible for a matching file.
uk: Перевизначити список суфіксів назв файлів, для яких використовуватиметься якнайменше стискання. Rsync встановлює рівень стискання для окремих файлів на основі суфікса назви файла. Якщо алгоритмом стискання передбачено рівень «вимкнути», для таких файлів стискання не виконуватиметься. Для інших алгоритмів, де передбачено підтримку зміни рівня «на ходу» рівень стискання буде мінімізовано для зменшення використання процесора для відповідних файлів.

source: The B<LIST> should be one or more file suffixes (without the dot) separated by slashes (B</>). You may specify an empty string to indicate that no files should be skipped.
uk: B<СПИСОК> має складатися з одного або декількох записів суфіксів файлів (без крапки), які відокремлено один від одного символами похилої риски (B</>). Ви можете вказати порожній рядок, щоб вказати програмі, що не слід пропускати жодних файлів.

source: Simple character-class matching is supported: each must consist of a list of letters inside the square brackets (e.g. no special classes, such as "[:alpha:]", are supported, and '-' has no special meaning).
uk: Передбачено підтримку простого встановлення відповідності за класами символів: кожен запис класу має складатися зі списку літер у квадратних дужках (наприклад, не передбачено підтримки спеціальних класів, зокрема «[:alpha:]», а «-» не має особливого значення).

source: The characters asterisk (B<*>) and question-mark (B<?>) have no special meaning.
uk: Символи зірочки (B<*>) і знака питання (B<?>) не мають особливого значення.

source: Here's an example that specifies 6 suffixes to skip (since 1 of the 5 rules matches 2 suffixes):
uk: Ось приклад, який задає 6 суфіксів, які слід пропускати (оскільки перше з п'яти правил відповідає двом суфіксам):

source: The default file suffixes in the skip-compress list in this version of rsync are:
uk: Типовими суфіксами у списку вимикання стискання у цій версії rsync є такі:

source: This list will be replaced by your B<--skip-compress> list in all but one situation: a copy from a daemon rsync will add your skipped suffixes to its list of non-compressing files (and its list may be configured to a different default).
uk: Цей список буде замінено вашим списком B<--skip-compress> в усіх випадках, окрім одного: копіювання з фонової служби rsync додасть ваші суфікси для пропускання до її списку файлів, які не слід стискати (а список фонової служби можна налаштувати на інше типове значення).

source: With this option rsync will transfer numeric group and user IDs rather than using user and group names and mapping them at both ends.
uk: Якщо використано цей параметр, rsync передаватиме числові ідентифікатори групи і користувача, а не назви групи і користувача, і виконуватиме прив'язку цих значень на обох кінцях ланцюжка передавання даних.

source: By default rsync will use the username and groupname to determine what ownership to give files. The special uid 0 and the special group 0 are never mapped via user/group names even if the B<--numeric-ids> option is not specified.
uk: Типово, rsync використовуватиме назву запису користувача і назву групи для визначення прав власності, які слід надати файлам. Особливі значення ідентифікатора користувача 0 і особливу групу ніколи не буде пов'язано із назвами записів користувачів і груп, навіть якщо не вказано параметр B<--numeric-ids>.

source: If a user or group has no name on the source system or it has no match on the destination system, then the numeric ID from the source system is used instead. See also the B<use\ chroot> setting in the rsyncd.conf manpage for some comments on how the chroot setting affects rsync's ability to look up the names of the users and groups and what you can do about it.
uk: Якщо у запису користувача або групи у системі джерела немає назв або немає відповідників у системі призначення, буде використано числовий ідентифікатор з системи джерела. Див. також параметр B<use\ chroot> на сторінці підручника rsyncd.conf, де наведено коментарі щодо того, як параметр chroot впливає на можливість rsync шукати назви записів користувачів і груп, і те, що ви можете з цим зробити.

source: B<--usermap=STRING>, B<--groupmap=STRING>
uk: B<--usermap=РЯДОК>, B<--groupmap=РЯДОК>

source: These options allow you to specify users and groups that should be mapped to other values by the receiving side. The B<STRING> is one or more B<FROM>:B<TO> pairs of values separated by commas. Any matching B<FROM> value from the sender is replaced with a B<TO> value from the receiver. You may specify usernames or user IDs for the B<FROM> and B<TO> values, and the B<FROM> value may also be a wild-card string, which will be matched against the sender's names (wild-cards do NOT match against ID numbers, though see below for why a 'B<*>' matches everything). You may instead specify a range of ID numbers via an inclusive range: LOW-HIGH. For example:
uk: Ці параметри надають вам змогу вказати користувачів і групи, які має бути прив'язано до інших значень на боці отримання. Значенням B<РЯДОК> є один або декілька записів B<ЗВІДКИ>:B<КУДИ>, які відокремлено комами. Будь-яке відповідне значення B<ЗВІДКИ> з боку відправника буде замінено на значення B<КУДИ> з боку отримувача. Ви можете вказати імена користувачів або ідентифікатори, як значення B<ЗВІДКИ> і B<КУДИ>, а значенням B<ЗВІДКИ> може бути рядок із символами-замінниками, відповідність якого іменам на боці відправника встановлюватиме програма (відповідність НЕ встановлюватиметься за номерами ідентифікаторів, хоча, як зауважено нижче, «B<*>» відповідає будь-якому запису). Замість використання символів-замінників для ідентифікаторів ви можете вказати діапазон чисел ідентифікаторів із включенням значень на межі діапазону: НИЖНІЙ-ВЕРХНІЙ. Приклад:

source: The first match in the list is the one that is used. You should specify all your user mappings using a single B<--usermap> option, and/or all your group mappings using a single B<--groupmap> option.
uk: Програма використає перший же знайдений відповідник у списку. Вам слід вказати усі ваші прив'язки користувачів за допомогою одного параметра B<--usermap>, а усі ваші прив'язки груп — за допомогою одного параметра B<--groupmap>.

source: Note that the sender's name for the 0 user and group are not transmitted to the receiver, so you should either match these values using a 0, or use the names in effect on the receiving side (typically "root"). All other B<FROM> names match those in use on the sending side. All B<TO> names match those in use on the receiving side.
uk: Зауважте, що ім'я відправника для користувача і групи 0 не буде перенесено на бік отримувача. Тому вам слід або встановити відповідність цих значень з використанням ідентифікатора 0, або скористатися відповідними іменами на боці отримувача (типово, «root»). Усім іншим іменам B<ЗВІДКИ> буде поставлено у відповідність використані на боці відправника імена. Усім іменам B<КУДИ> буде поставлено у відповідність імена, які використано на боці отримання.

source: Any IDs that do not have a name on the sending side are treated as having an empty name for the purpose of matching. This allows them to be matched via a "B<*>" or using an empty name. For instance:
uk: У сенсі відповідності, будь-які ідентифікатори, яким не відповідають імена на боці надсилання, буде оброблено як порожні. Це надає змогу використовувати їх, як відповідники «B<*>» або порожнього імені. Приклад:

source: When the B<--numeric-ids> option is used, the sender does not send any names, so all the IDs are treated as having an empty name. This means that you will need to specify numeric B<FROM> values if you want to map these nameless IDs to different values.
uk: Якщо використано параметр B<--numeric-ids>, відправник не надсилатиме жодних імен, отже усі ідентифікатори вважатимуться такими, що відповідають порожньому імені. Це означає, що вам потрібно вказати числові значення B<ЗВІДКИ>, якщо ви хочете пов'язати ці безіменні ідентифікатори з іншими значеннями.

source: For the B<--usermap> option to work, the receiver will need to be running as a super-user (see also the B<--super> and B<--fake-super> options). For the B<--groupmap> option to work, the receiver will need to have permissions to set that group.
uk: Щоб параметр B<--usermap> спрацював, програму на боці отримувача має бути запущено від імені надкористувача (див. також параметри B<--super> і B<--fake-super>). Щоб спрацював параметр B<--groupmap>, програма на боці отримувача повинна мати права доступ до встановлення цієї групи.

source: Starting with rsync 3.2.4, the B<--usermap> option implies the B<--owner> (B<-o>) option while the B<--groupmap> option implies the B<--group> (B<-g>) option (since rsync needs to have those options enabled for the mapping options to work).
uk: Починаючи з версії rsync 3.2.4, параметр B<--usermap> неявним чином встановлює параметр B<--owner> (B<-o>), а параметр B<--groupmap> — параметр B<--group> (B<-g>) (оскільки rsync потрібні ці параметри для того, щоб працювали параметри прив'язки).

source: An older rsync client may need to use B<--protect-args> (B<-s>) to avoid a complaint about wildcard characters, but a modern rsync handles this automatically.
uk: Для застарілих клієнтів rsync може знадобитися використання B<--protect-args> (B<-s>), щоб уникнути скарг програми на використання символів-замінників, а сучасні версії rsync обробляють такі символи автоматично.

source: This option forces all files to be owned by USER with group GROUP. This is a simpler interface than using B<--usermap> & B<--groupmap> directly, but it is implemented using those options internally so they cannot be mixed. If either the USER or GROUP is empty, no mapping for the omitted user/group will occur. If GROUP is empty, the trailing colon may be omitted, but if USER is empty, a leading colon must be supplied.
uk: Цей параметр примусово встановлює для усіх файлів належність користувачу КОРИСТУВАЧ із групою ГРУПА. Це простіший інтерфейс, за безпосереднє використання B<--usermap> і B<--groupmap>, але його реалізовано за допомогою цих параметрів на внутрішньому рівні, тому ці параметри можна поєднувати. Якщо якесь із значень, КОРИСТУВАЧ або ГРУПА є порожнім, прив'язка для пропущеної групи або користувача не виконуватиметься. Якщо значення ГРУПА є порожнім, кінцеву двокрапку можна пропустити, але якщо порожнім є значення КОРИСТУВАЧ, початкову двокрапку слід вказувати.
