Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: NOTE: sorting the list of files in the B<--files-from> input helps rsync to be more efficient, as it will avoid re-visiting the path elements that are shared between adjacent entries. If the input is not sorted, some path elements (implied directories) may end up being scanned multiple times, and rsync will eventually unduplicate them after they get turned into file-list elements.
uk: ЗАУВАЖЕННЯ: упорядкування списку файлів на вході B<--files-from> допоможе rsync працювати ефективніше, оскільки програма уникне повторного відвідування елементів шляху, які є спільними між сусідніми записами. Якщо вхідний список не упорядковано, деякі елементи шляху (неявні каталоги) програма може сканувати декілька разів, і rsync, врешті, прибере їхнє дублювання після перетворення їх в елементи списку файлів.

source: This tells rsync that the rules/filenames it reads from a file are terminated by a null ('\e0') character, not a NL, CR, or CR+LF. This affects B<--exclude-from>, B<--include-from>, B<--files-from>, and any merged files specified in a B<--filter> rule. It does not affect B<--cvs-exclude> (since all names read from a .cvsignore file are split on whitespace).
uk: Вказує rsync, що правила і назви файлів, які програма прочитає з файла, завершуються нуль-символом («\e0»), а не NL, CR або CR+LF. Це стосується B<--exclude-from>, B<--include-from>, B<--files-from> і усіх об'єднаних файлів, які вказано у правилі B<--filter>. Це не стосується B<--cvs-exclude> (оскільки усі назви, які прочитано з файла .cvsignore, буде поділено за символом пробілу).

source: This option tells rsync to stop trying to protect the arg values on the remote side from unintended word-splitting or other misinterpretation.
uk: Цей параметр наказує rsync припинити спроби захистити значення аргументів на віддаленому боці ланцюжка передавання від ненавмисного поділу на слова та іншої небажаної обробки.

source: The default in a modern rsync is for "shell-active" characters (including spaces) to be backslash-escaped in the args that are sent to the remote shell. The wildcard characters B<*>, B<?>, B<[>, & B<]> are not escaped in filename args (allowing them to expand into multiple filenames) while being protected in option args, such as B<--usermap>.
uk: Типовим у сучасних версіях rsync є екранування «активних» символів командної оболонки (зокрема пробілів) символом зворотної похилої риски в аргументах, які буде надіслано до віддаленої оболонки. Символи-замінники, B<*>, B<?>, B<[> і B<]>, не буде екрановано у аргументах назв файлів (це уможливлює розгортання цих символів у декілька назв файлів), але їх буде захищено в аргументах параметрів, зокрема B<--usermap>.

source: If you have a script that wants to use old-style arg splitting in its filenames, specify this option once. If the remote shell has a problem with any backslash escapes at all, specify this option twice.
uk: Якщо ви маєте скрипт, який використовує поділ аргументів у назвах файлів у застарілому стилі, вкажіть цей параметр один раз. Якщо у віддаленої оболонки виникають проблеми із зникненням екранування зворотною похилою рискою, вкажіть цей параметр двічі.

source: You may also control this setting via the B<RSYNC_OLD_ARGS> environment variable. If it has the value "1", rsync will default to a single-option setting. If it has the value "2" (or more), rsync will default to a repeated-option setting. If it is "0", you'll get the default escaping behavior. The environment is always overridden by manually specified positive or negative options (the negative is B<--no-old-args>).
uk: Керувати цим параметром можна також за допомогою змінної середовища B<RSYNC_OLD_ARGS>. Якщо її значенням є «1», rsync типово працюватиме у режимі одного параметра. Якщо значенням є «2» (або більше число), rsync типово працюватиме у режимі повторення параметра. Якщо встановлено значення «0», буде використано типову поведінку щодо екранування. Значення змінної середовища завжди має нижчий пріоритет за встановлені вручну позитивні чи негативні параметри рядка команди (негативним є B<--no-old-args>).

source: This option conflicts with the B<--protect-args> option.
uk: Цей параметр конфліктує зі параметром B<--protect-args>.

source: This option sends all filenames and most options to the remote rsync without allowing the remote shell to interpret them. Wildcards are expanded on the remote host by rsync instead of the shell doing it.
uk: За допомогою цього параметра можна наказати програмі надсилати усіх назви файлів і більшість параметрів до віддаленого rsync, не дозволяючи віддаленій оболонці обробляти їх. Символи-замінники буде розгорнуто на віддаленому вузлі самою програмою rsync, замість розгортання їх командною оболонкою.

source: This is similar to the new-style backslash-escaping of args that was added in 3.2.4, but supports some extra features and doesn't rely on backslash escaping in the remote shell.
uk: Подібне до екранування аргументів символом зворотної похилої риски у новому стилі, яке було додано у версії 3.2.4, але із підтримкою деяких додаткових можливостей, і без сподівання на екранування символом зворотної похилої риски у віддаленій командній оболонці.

source: If you use this option with B<--iconv>, the args related to the remote side will also be translated from the local to the remote character-set. The translation happens before wild-cards are expanded. See also the B<--files-from> option.
uk: Якщо ви скористаєтеся цим параметром у поєднанні із B<--iconv>, аргументи, які стосуються віддаленого кінця з'єднання, буде також переведено з локального набору символів (кодування) до віддаленого набору символів. Перетворення буде виконано до розгортання символів-замінників. Див. також параметр B<--files-from>.

source: You may also control this setting via the B<RSYNC_PROTECT_ARGS> environment variable. If it has a non-zero value, this setting will be enabled by default, otherwise it will be disabled by default. Either state is overridden by a manually specified positive or negative version of this option (note that B<--no-s> and B<--no-protect-args> are the negative versions). This environment variable is also superseded by a non-zero B<RSYNC_OLD_ARGS> export.
uk: Цим параметром також можна керувати за допомогою змінної середовища B<RSYNC_PROTECT_ARGS>. Якщо ця змінна має ненульове значення, типово, параметр буде увімкнено, якщо ж змінна матиме нульове значення, параметр типово буде вимкнено. Будь-який типовий стан можна буде перевизначити вручну за допомогою позитивної або негативної версії цього параметра у рядку команди (зауважте, що негативними версіями є B<--no-s> і B<--no-protect-args>). Також цю змінну середовища можна перевизначити за допомогою експортування ненульового значення B<RSYNC_OLD_ARGS>.

source: You may need to disable this option when interacting with an older rsync (one prior to 3.0.0).
uk: Ймовірно, вам варто вимкнути цей параметр при роботі із застарілими версіями rsync (версіями до 3.0.0).

source: This option conflicts with the B<--old-args> option.
uk: Цей параметр конфліктує зі параметром B<--old-args>.

source: Note that this option is incompatible with the use of the restricted rsync script (B<rrsync>) since it hides options from the script's inspection.
uk: Зауважте, що цей параметр є несумісним із використанням скрипту обмеженого rsync (B<rrsync>), оскільки він приховує параметри від вивчення скриптом.

source: B<--copy-as=USER[:GROUP]>
uk: B<--copy-as=КОРИСТУВАЧ[:ГРУПА]>

source: This option instructs rsync to use the USER and (if specified after a colon) the GROUP for the copy operations. This only works if the user that is running rsync has the ability to change users. If the group is not specified then the user's default groups are used.
uk: Цей параметр наказує rsync використовувати записи КОРИСТУВАЧ і (якщо вказано після двокрапки) ГРУПА для дій з копіювання. Працює, лише якщо користувач запущеної версії rsync має доступ до зміни користувачів. Якщо групу не вказано, буде використано типові групи користувача.

source: This option can help to reduce the risk of an rsync being run as root into or out of a directory that might have live changes happening to it and you want to make sure that root-level read or write actions of system files are not possible. While you could alternatively run all of rsync as the specified user, sometimes you need the root-level host-access credentials to be used, so this allows rsync to drop root for the copying part of the operation after the remote-shell or daemon connection is established.
uk: За допомогою цього параметра можна знизити ризик виконання дій запущеним від імені root rsync у каталогах і з каталогів, у яких можуть відбуватися інтерактивні зміни. Також він може бути корисним для заборони дій з читання та запису загальносистемних файлів на рівні користувача root. Хоча ви можете альтернативно запустити увесь rsync від імені вказаного користувача, іноді вам потрібні будуть реєстраційні дані на рівні root для доступу до вузлів, тому цей параметр надає змогу rsync скинути привілеї root для копіювальної частини дії після встановлення з'єднання із віддаленою оболонкою або фоновою службою.

source: The option only affects one side of the transfer unless the transfer is local, in which case it affects both sides. Use the B<--remote-option> to affect the remote side, such as B<-M--copy-as=joe>. For a local transfer, the lsh (or lsh.sh) support file provides a local-shell helper script that can be used to allow a "localhost:" or "lh:" host-spec to be specified without needing to setup any remote shells, allowing you to specify remote options that affect the side of the transfer that is using the host-spec (and using hostname "lh" avoids the overriding of the remote directory to the user's home dir).
uk: Цей параметр впливатиме лише на один з кінців ланцюжка передавання даних, якщо передавання не є локальним (для локальних передавань він впливатиме на обидва кінці). Скористайтеся B<--remote-option>, щоб вплинути на віддалений кінець, наприклад, так B<-M--copy-as=joe>. Для локальних передавань у допоміжному файлі lsh (або lsh.sh) наведено код допоміжного скрипту, яким можна скористатися для уможливлення специфікації вузла «localhost:» або «lh:» без потреби у налаштовуванні віддалених оболонок. Це надає вам змогу вказати параметри на віддаленому кінці з'єднання, які впливатимуть на кінець передавання, який використовує специфікації вузла (а використання назви вузла «lh» надає змогу уникнути перевизначення віддаленого каталогу на домашній каталог користувача).

source: For example, the following rsync writes the local files as user "joe":
uk: Наприклад, вказана нижче команда rsync записує локальні файли від імені користувача «joe»:

source: This makes all files owned by user "joe", limits the groups to those that are available to that user, and makes it impossible for the joe user to do a timed exploit of the path to induce a change to a file that the joe user has no permissions to change.
uk: Робить власником усіх файлів користувача «joe», обмежує групи тими, які доступні цьому користувачу і робить неможливим для користувача «joe» використання вразливості, пов'язаної із можливістю внесення змін до файла, прав на зміну якого користувач «joe» не має.

source: The following command does a local copy into the "dest/" dir as user "joe" (assuming you've installed support/lsh into a dir on your $PATH):
uk: Вказана нижче команда виконує локальне копіювання до каталогу «призначення/» від імені користувача «joe» (припускаємо, що вами встановлено support/lsh до одного з каталогів у вашій змінній $PATH):

source: sudo rsync -aive lsh -M--copy-as=joe src/ lh:dest/
uk: sudo rsync -aive lsh -M--copy-as=joe джерело/ lh:призначення/

source: B<--temp-dir=DIR>, B<-T>
uk: B<--temp-dir=КАТАЛОГ>, B<-T>

source: This option instructs rsync to use DIR as a scratch directory when creating temporary copies of the files transferred on the receiving side. The default behavior is to create each temporary file in the same directory as the associated destination file. Beginning with rsync 3.1.1, the temp-file names inside the specified DIR will not be prefixed with an extra dot (though they will still have a random suffix added).
uk: Цей параметр наказує rsync скористатися КАТАЛОГОМ, як тимчасовим каталогом при створенні тимчасових копій файлів передавання на боці отримання. Типовою поведінку є створення кожного тимчасового файла у тому самому каталозі, що і пов'язаний файл призначення. Починаючи з rsync 3.1.1, назви тимчасових файлів у вказаному КАТАЛОЗІ не матимуть додаткового префікса-крапки (хоча програма і додаватиме до їхніх назв випадковий суфікс).

source: This option is most often used when the receiving disk partition does not have enough free space to hold a copy of the largest file in the transfer. In this case (i.e. when the scratch directory is on a different disk partition), rsync will not be able to rename each received temporary file over the top of the associated destination file, but instead must copy it into place. Rsync does this by copying the file over the top of the destination file, which means that the destination file will contain truncated data during this copy. If this were not done this way (even if the destination file were first removed, the data locally copied to a temporary file in the destination directory, and then renamed into place) it would be possible for the old file to continue taking up disk space (if someone had it open), and thus there might not be enough room to fit the new version on the disk at the same time.
uk: Цим параметром найчастіше користуються, якщо на розділу диска отримання даних недостатньо вільного місця для зберігання копії найбільшого файла у передаванні даних. У цьому випадку (тобто, якщо тимчасовий каталог перебуває на іншому розділі диска) програма rsync не зможе перейменувати кожен отриманий тимчасовий файл на місце пов'язаного файла призначення, а повинна буде скопіювати його на місце. Програма rsync виконує це завдання шляхом копіювання файла на місце файла призначення, що означає, що під час копіювання у файлі призначення міститиметься лише частина даних. Якщо цього не зробити (навіть якщо спочатку вилучити файл призначення, дані було локально скопійовано до тимчасового файла у каталозі призначення з наступним перейменуванням), старий файл може продовжувати займати місце на диску (якщо його відкриє якась програма), і на диску може не вистачити місця для одночасного зберігання нової версії цього файла.

source: If you are using this option for reasons other than a shortage of disk space, you may wish to combine it with the B<--delay-updates> option, which will ensure that all copied files get put into subdirectories in the destination hierarchy, awaiting the end of the transfer. If you don't have enough room to duplicate all the arriving files on the destination partition, another way to tell rsync that you aren't overly concerned about disk space is to use the B<--partial-dir> option with a relative path; because this tells rsync that it is OK to stash off a copy of a single file in a subdir in the destination hierarchy, rsync will use the partial-dir as a staging area to bring over the copied file, and then rename it into place from there. (Specifying a B<--partial-dir> with an absolute path does not have this side-effect.)
uk: Якщо ви користуєтеся цим параметром з причин, не пов'язаних із браком місця на диску, вам варто поєднати його із параметром B<--delay-updates>, що забезпечить розміщення усіх скопійованих файлів у підкаталогах ієрархії призначення в очікуванні кінця передавання. Якщо у вас недостатньо місця для дублювання усіх отримуваних файлів на розділі призначення, іншим способом вказати rsync, що ви не переймаєтеся заощадженням місця на диску, є використання параметра B<--partial-dir> із відносним шляхом; оскільки це повідомляє rsync, що можна збирати копію окремого файла у підкаталозі ієрархії призначення, rsync використовуватиме частковий каталог, як тимчасову область для збирання скопійованого файла, а потім перейменовуватиме файл відповідним чином, щоб він потрапив на місце. (Визначення B<--partial-dir> із абсолютним шляхом не має цього побіжного ефекту.)

source: This option tells rsync that it should look for a basis file for any destination file that is missing. The current algorithm looks in the same directory as the destination file for either a file that has an identical size and modified-time, or a similarly-named file. If found, rsync uses the fuzzy basis file to try to speed up the transfer.
uk: Цей параметр повідомляє програмі rsync, що вона має шукати базовий файл для будь-якого файла призначення, якого не вистачає. У поточній реалізації алгоритму програма виконує пошук у тому самому каталозі, що і файл призначення, шукаючи файл, який або має такий самий розмір і час внесення змін, або файл із подібною назвою. Якщо файл буде знайдено, rsync використає неточний базовий файл у спробі пришвидшити передавання даних.

source: If the option is repeated, the fuzzy scan will also be done in any matching alternate destination directories that are specified via B<--compare-dest>, B<--copy-dest>, or B<--link-dest>.
uk: Якщо цей параметр буде повторено, неточне сканування також буде виконано у будь-яких відповідних альтернативних каталогах призначення, які вказано за допомогою B<--compare-dest>, B<--copy-dest> або B<--link-dest>.

source: Note that the use of the B<--delete> option might get rid of any potential fuzzy-match files, so either use B<--delete-after> or specify some filename exclusions if you need to prevent this.
uk: Зауважте, що використання параметра B<--delete> може призвести до втрати потенційних неточно відповідних файлів, тому або скористайтеся B<--delete-after>, або вкажіть якісь виключення для назв файлів, якщо хочете запобігти такому вилученню.

source: B<--compare-dest=DIR>
uk: B<--compare-dest=КАТАЛОГ>

source: This option instructs rsync to use I<DIR> on the destination machine as an additional hierarchy to compare destination files against doing transfers (if the files are missing in the destination directory). If a file is found in I<DIR> that is identical to the sender's file, the file will NOT be transferred to the destination directory. This is useful for creating a sparse backup of just files that have changed from an earlier backup. This option is typically used to copy into an empty (or newly created) directory.
uk: Цей параметр наказує rsync використовувати I<КАТАЛОГ> на комп'ютері призначення як додаткову ієрархію для порівняння файли призначення із набором передавання (якщо у каталозі призначення не вистачає якихось файлів). Якщо буде виявлено файл у I<КАТАЛОЗІ>, який є тотожним до файла на боці відправника, цей файл НЕ буде передано до каталогу призначення. Корисно для створення розрідженої резервної копії, яка складається лише з файлів, які було змінено з моменту попереднього резервного копіювання. Цим параметром типово користуються для копіювання до порожнього (або новоствореного) каталогу.

source: Beginning in version 2.6.4, multiple B<--compare-dest> directories may be provided, which will cause rsync to search the list in the order specified for an exact match. If a match is found that differs only in attributes, a local copy is made and the attributes updated. If a match is not found, a basis file from one of the I<DIRs> will be selected to try to speed up the transfer.
uk: Починаючи з версії 2.6.4, в одній команді може бути вказано декілька каталогів B<--compare-dest>, тобто наказати rsync шукати у відповідному списку каталогів за вказаним порядком точні відповідники. Якщо буде знайдено відповідник, який відрізняється лише атрибутами, буде виконано локальне копіювання і оновлено атрибути. Якщо відповідника не буде знайдено, буде вибрано базовий файл з одного з I<КАТАЛОГІВ> у спробі пришвидшити передавання файлів.

source: If I<DIR> is a relative path, it is relative to the destination directory. See also B<--copy-dest> and B<--link-dest>.
uk: Якщо I<КАТАЛОГ> є відносним шляхом, його буде визначено відносно каталогу призначення. Див. також B<--copy-dest> і B<--link-dest>.

source: NOTE: beginning with version 3.1.0, rsync will remove a file from a non-empty destination hierarchy if an exact match is found in one of the compare-dest hierarchies (making the end result more closely match a fresh copy).
uk: ЗАУВАЖЕННЯ: починаючи з версії 3.1.0, rsync вилучатиме файл з непорожньої ієрархії каталогів призначення, якщо буде знайдено точний відповідник в одній із ієрархій каталогів порівняння (роблячи кінцевий результат ближчим до свіжої копії).

source: B<--copy-dest=DIR>
uk: B<--copy-dest=КАТАЛОГ>

source: This option behaves like B<--compare-dest>, but rsync will also copy unchanged files found in I<DIR> to the destination directory using a local copy. This is useful for doing transfers to a new destination while leaving existing files intact, and then doing a flash-cutover when all files have been successfully transferred.
uk: Використання цього параметра призводить до поведінки, подібної до поведінки при використанні B<--compare-dest>, але rsync також скопіює незмінені файли, які виявлено у I<КАТАЛОЗІ> до каталогу призначення за допомогою локального копіювання. Це корисно для виконання передавання даних до нового призначення без внесення змін до наявних файлів із наступним виконанням миттєвого переведення на нову основу, коли усі файли буде успішно перенесено.

source: Multiple B<--copy-dest> directories may be provided, which will cause rsync to search the list in the order specified for an unchanged file. If a match is not found, a basis file from one of the I<DIRs> will be selected to try to speed up the transfer.
uk: В одній команді може бути вказано декілька каталогів B<--copy-dest>, тобто наказати rsync шукати у відповідному списку каталогів за вказаним порядком незмінені файли. Якщо відповідника не буде знайдено, буде вибрано базовий файл з одного з I<КАТАЛОГІВ> у спробі пришвидшити передавання файлів.

source: If I<DIR> is a relative path, it is relative to the destination directory. See also B<--compare-dest> and B<--link-dest>.
uk: Якщо I<КАТАЛОГ> є відносним шляхом, його буде визначено відносно каталогу призначення. Див. також B<--compare-dest> і B<--link-dest>.

source: B<--link-dest=DIR>
uk: B<--link-dest=КАТАЛОГ>

source: This option behaves like B<--copy-dest>, but unchanged files are hard linked from I<DIR> to the destination directory. The files must be identical in all preserved attributes (e.g. permissions, possibly ownership) in order for the files to be linked together. An example:
uk: Використання цього параметра призводить до поведінки, подібної до поведінки при використанні B<--copy-dest>, але незмінені файли буде пов'язано жорсткими посиланнями з I<КАТАЛОГУ> до каталогу призначення. Файли мають бути тотожними в усіх збережених атрибутах (зокрема правах доступу, можливо, власниках), щоб файли було пов'язано посиланнями. Приклад:

source: rsync -av --link-dest=$PWD/prior_dir host:src_dir/ new_dir/
uk: rsync -av --link-dest=$PWD/попередній_каталог вузол:каталог_джерела/ новий_каталог/

source: If files aren't linking, double-check their attributes. Also check if some attributes are getting forced outside of rsync's control, such a mount option that squishes root to a single user, or mounts a removable drive with generic ownership (such as OS X's "Ignore ownership on this volume" option).
uk: Якщо файли не пов'язуються, ретельно перевірте їхні атрибути. Також перевірте, чи не встановлюються примусово атрибути ззовні від rsync, зокрема пошукайте параметри монтування, які можуть змінювати root на окремого користувача або встановлювати для файлів на портативному носії загальні правила власності (зокрема параметр OS X «Ігнорувати права власності на цьому томі»).
