Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: You can include and exclude files by specifying patterns using the "+", "-", etc. filter rules (as introduced in the FILTER RULES section above). The include/exclude rules each specify a pattern that is matched against the names of the files that are going to be transferred. These patterns can take several forms:
uk: Ви можете включати і виключати файли, вказуючи взірці за допомогою правил фільтрування «+», «-» тощо (початковий опис наведено у розділі ПРАВИЛА ФІЛЬТРУВАННЯ вище). Кожне правило включення/виключення вказує взірець, порівняння його виконується за назвами файлів, які має бути передано. Ці взірці можуть мати декілька форм:

source: if the pattern starts with a B</> then it is anchored to a particular spot in the hierarchy of files, otherwise it is matched against the end of the pathname. This is similar to a leading B<^> in regular expressions. Thus B</foo> would match a name of "foo" at either the "root of the transfer" (for a global rule) or in the merge-file's directory (for a per-directory rule). An unqualified B<foo> would match a name of "foo" anywhere in the tree because the algorithm is applied recursively from the top down; it behaves as if each path component gets a turn at being the end of the filename. Even the unanchored "sub/foo" would match at any point in the hierarchy where a "foo" was found within a directory named "sub". See the section on ANCHORING INCLUDE/EXCLUDE PATTERNS for a full discussion of how to specify a pattern that matches at the root of the transfer.
uk: якщо взірець починається з B</>, його буде прив'язано до певного місця у ієрархії файлів, інакше його буде зіставлено із кінцем шляху. Це подібне до початкового B<^> у формальних виразах. Таким чином, B</щось> відповідає назві «щось» або у «кореневій теці передавання» (для загального правила), або у каталозі файла об'єднання (для правила на рівні каталогу). Просте B<щось> відповідає назві «щось» будь-де у ієрархії каталогів, оскільки алгоритм буде застосовано рекурсивно згори вниз; програма поводить себе так, наче кожен компонент шляху працює наприкінці назви файла. Навіть неприв'язаний запис «підкаталог/щось» відповідає у будь-якій точці в ієрархії, де «щось» було знайдено у каталозі із назвою «підкаталог». Див. розділ ПРИВ'ЯЗКА ВЗІРЦІВ ВКЛЮЧЕННЯ/ВИКЛЮЧЕННЯ, щоб ознайомитися із повним обговоренням того, як вказати взірець, який відповідає кореневій теці передавання.

source: if the pattern ends with a B</> then it will only match a directory, not a regular file, symlink, or device.
uk: якщо взірець завершується на B</>, він відповідатиме лише каталогу, не звичайному файлу, символічному посиланню або пристрою.

source: rsync chooses between doing a simple string match and wildcard matching by checking if the pattern contains one of these three wildcard characters: \&'B<*>', 'B<?>', and 'B<[>' .
uk: rsync вибирає між виконанням простого порівняння рядків і порівнянням рядка із рядком із символами-замінниками, де взірці містять один із таких символів-замінників: «B<*>», «B<?>» і «B<[>».

source: a 'B<*>' matches any path component, but it stops at slashes.
uk: «B<*>» відповідає будь-якому компоненту шляху, але без включення символів похилої риски.

source: use 'B<**>' to match anything, including slashes.
uk: скористайтеся «B<**>» для встановлення відповідності будь-якій частині рядка, включено із символами похилої риски.

source: a 'B<?>' matches any character except a slash (B</>).
uk: «B<?>» відповідає будь-якому символу, окрім символу похилої риски (B</>).

source: a 'B<[>' introduces a character class, such as B<[a-z]> or B<[[:alpha:]]>.
uk: «B<[>» вставляє клас символів, зокрема B<[a-z]> або B<[[:alpha:]]>.

source: in a wildcard pattern, a backslash can be used to escape a wildcard character, but it is matched literally when no wildcards are present. This means that there is an extra level of backslash removal when a pattern contains wildcard characters compared to a pattern that has none. e.g. if you add a wildcard to "B<foo\ebar>" (which matches the backslash) you would need to use "B<foo\e\ebar*>" to avoid the "B<\eb>" becoming just "b".
uk: у взірці із символами-замінниками символ зворотної похилої риски можна використати для екранування символу-замінника. Після екранування символи буде оброблено як звичайні символи. це означає, що існує додатковий рівень вилучення зворотних похилих рисок, коли взірець містить символи-замінники, порівняно із взірцем, яких їх не містить. Наприклад, якщо ви додаєте символ-замінник до «B<щось\eдесь>» (який відповідає зворотній похилій рисці), вам слід скористатися "B<щось\e\eдесь*>», щоб уникнути варіанта, коли «B<\eд>» стане просто «д».

source: if the pattern contains a B</> (not counting a trailing /) or a "B<**>", then it is matched against the full pathname, including any leading directories. If the pattern doesn't contain a B</> or a "B<**>", then it is matched only against the final component of the filename. (Remember that the algorithm is applied recursively so "full filename" can actually be any portion of a path from the starting directory on down.)
uk: якщо взірець містить B</> (без кінцевого /) або «B<**>», він відповідатиме повній назві файла, включно із усіма початковими записами каталогів. Якщо взірець не містить B</> або «B<**>», він відповідатиме лише останньому компоненту назви файла. (Пам'ятайте, що алгоритм буде застосовано рекурсивно, отже, «повна назва файла» може насправді бути будь-якою частиною шляху від початкового каталогу униз ієрархією.)

source: a trailing "B<dir_name/***>" will match both the directory (as if "dir_name/" had been specified) and everything in the directory (as if "B<dir_name/**>" had been specified). This behavior was added in version 2.6.7.
uk: кінцеве «B<назва_каталогу/***>» відповідатиме одразу каталогу (наче було вказано «назва_каталогу/») і усе у каталозі (наче було вказано «B<назва_каталогу/**>»). Таку поведінку було додано у версії 2.6.7.

source: Note that, when using the B<--recursive> (B<-r>) option (which is implied by B<-a>), every subdir component of every path is visited left to right, with each directory having a chance for exclusion before its content. In this way include/exclude patterns are applied recursively to the pathname of each node in the filesystem's tree (those inside the transfer). The exclude patterns short-circuit the directory traversal stage as rsync finds the files to send.
uk: Зауважте, що при використанні параметра B<--recursive> (B<-r>) (який встановлюється неявним чином B<-a>), будь-який компонент підкаталогу будь-якого шляху буде оброблено зліва праворуч, кожен каталог може бути виключено до його вмісту. У цей спосіб взірці включення/виключення буде застосовано рекурсивно до назви шляху кожного вузла в ієрархії файлової системи (всередині каталогу передавання). Взірці виключення замикають обробку на стадії обходу, коли rsync шукає файли для надсилання.

source: For instance, to include "B</foo/bar/baz>", the directories "B</foo>" and "B</foo/bar>" must not be excluded. Excluding one of those parent directories prevents the examination of its content, cutting off rsync's recursion into those paths and rendering the include for "B</foo/bar/baz>" ineffectual (since rsync can't match something it never sees in the cut-off section of the directory hierarchy).
uk: Наприклад, щоб було включено «B</щось/десь/тут>», каталоги «B</щось>» і «B</щось/десь>» має бути не виключено. Виключення одного з цих батьківських каталогів забороняє вивчення її вмісту, обрізаючи рекурсію rsync у цих шляхах і усуваючи включення «B</щось/десь/тут>» (оскільки у rsync не встановлюється відповідність і програма ніколи не заглядатиме до обрізаної гілки в ієрархії каталогів).

source: The concept path exclusion is particularly important when using a trailing 'B<*>' rule. For instance, this won't work:
uk: Концепція виключення шляхів є частково важливою при використанні кінцевого правила «B<*>». Наприклад, це не працюватиме:

source: + /some/path/this-file-will-not-be-found + /file-is-included - *
uk: + /якийсь/шлях/цей-файл-не-буде-знайдено + /файл-включено - *

source: This fails because the parent directory "some" is excluded by the 'B<*>' rule, so rsync never visits any of the files in the "some" or "some/path" directories. One solution is to ask for all directories in the hierarchy to be included by using a single rule: "B<+\ */>" (put it somewhere before the "B<-\ *>" rule), and perhaps use the B<--prune-empty-dirs> option. Another solution is to add specific include rules for all the parent dirs that need to be visited. For instance, this set of rules works fine:
uk: Це не працюватиме, оскільки батьківський каталог «якийсь» буде виключено правилом «B<*>», отже rsync ніколи не бачитиме файлів у каталогах «якийсь» та «якийсь/шлях». Одним із вирішень цієї проблеми є включення усіх каталогів в ієрархії за допомогою єдиного правила включення: «B<+\ */>» (розташуйте його десь до правила «B<-\ *>»), і, можливо, скористайтеся параметром B<--prune-empty-dirs>. Іншим рішенням є додавання специфічних правил включення для усіх батьківських каталогів, які слід обробити. Наприклад, цей набір правил працює:

source: + /some/ + /some/path/ + /some/path/this-file-is-found + /file-also-included - *
uk: + /якийсь/ + /якийсь/шлях/ + /якийсь/шлях/цей-файл-знайдено + /також-включений-файл - *

source: Here are some examples of exclude/include matching:
uk: Ось декілька прикладів включення/виключення зі встановленням відповідності:

source: "B<-\ *.o>" would exclude all names matching B<*.o>
uk: «B<-\ *.o>» призведе до виключення усіх назв, які відповідають взірцю B<*.o>

source: "B<-\ /foo>" would exclude a file (or directory) named foo in the transfer-root directory
uk: «B<-\ /щось>» виключить файл (або каталог) із назвою «щось» у кореневому каталозі передавання

source: "B<-\ foo/>" would exclude any directory named foo
uk: «B<-\ щось/>» виключить будь-який каталог із назвою «щось»

source: "B<-\ /foo/*/bar>" would exclude any file named bar which is at two levels below a directory named foo in the transfer-root directory
uk: «B<-\ /щось/*/десь>» виключить будь-який файл із назвою «десь», який перебуває на два рівні нижче каталогу із назвою «щось» у кореневому каталозі передавання

source: "B<-\ /foo/**/bar>" would exclude any file named bar two or more levels below a directory named foo in the transfer-root directory
uk: «B<-\ /щось/**/десь>» виключить будь-який файл із назвою «десь», який перебуває на два рівні або більше рівнів нижче каталогу із назвою «щось» у кореневому каталозі передавання

source: The combination of "B<+\ */>", "B<+\ *.c>", and "B<-\ *>" would include all directories and C source files but nothing else (see also the B<--prune-empty-dirs> option)
uk: Поєднання «B<+\ */>», «B<+\ *.c>» і «B<-\ *>» включить усі каталоги і усі файли початкового коду C, але ніяких інших об'єктів (див. також параметр B<--prune-empty-dirs>)

source: The combination of "B<+\ foo/>", "B<+\ foo/bar.c>", and "B<-\ *>" would include only the foo directory and foo/bar.c (the foo directory must be explicitly included or it would be excluded by the "B<*>")
uk: Комбінація «B<+\ щось/>», «B<+\ щось/десь.c>» і «B<-\ *>» призведе до включення лише каталогу «щось» і «щось/десь.c» (каталог «щось» має бути явним чином включено, інакше його будеи виключено правилом «B<*>»)

source: The following modifiers are accepted after a "B<+>" or "B<->":
uk: Після «B<+>» або «B<->» можна використовувати такі модифікатори:

source: A B</> specifies that the include/exclude rule should be matched against the absolute pathname of the current item. For example, "B<-/\ /etc/passwd>" would exclude the passwd file any time the transfer was sending files from the "/etc" directory, and "-/ subdir/foo" would always exclude "foo" when it is in a dir named "subdir", even if "foo" is at the root of the current transfer.
uk: B</> вказує, що правило включення/виключення слід застосовувати до абсолютного шляху поточного запису. Наприклад, «B<-/\ /etc/passwd>» виключить файл passwd, коли під час передавання надсилатимуться з каталогу «/etc», а «-/ підкаталог/щось» завжди виключає «щось», коли цей об'єкт перебуває у каталозі із назвою «підкаталог», навіть якщо «щось» перебуває у кореневому каталозі поточного передавання.

source: A B<!> specifies that the include/exclude should take effect if the pattern fails to match. For instance, "B<-!\ */>" would exclude all non-directories.
uk: B<!> вказує, що включення/виключення має відбутися, якщо взірець не відповідатиме знайденому файлу. Наприклад, «B<-!\ */>» призведе до виключення усіх об'єктів, які не є каталогами.

source: A B<C> is used to indicate that all the global CVS-exclude rules should be inserted as excludes in place of the "-C". No arg should follow.
uk: B<C> використовують для позначення того, що усі загальні правила виключення CVS має бути вставлено як виключення на місце «-C». Аргументів після вказувати не можна.

source: An B<s> is used to indicate that the rule applies to the sending side. When a rule affects the sending side, it prevents files from being transferred. The default is for a rule to affect both sides unless B<--delete-excluded> was specified, in which case default rules become sender-side only. See also the hide (H) and show (S) rules, which are an alternate way to specify sending-side includes/excludes.
uk: B<s> використовують для позначення того, що правило слід застосовувати на боці надсилання. Якщо правило стосується боку надсилання, воно запобігає передаванню файлів. Типово, правило стосуватиметься обох кінців з'єднання, якщо не вказано B<--delete-excluded>. Якщо ж цей параметр вказано, типові правила стосуватимуться лише відправника. Див. також правила приховування (H) і показу (S), які є альтернативним способом вказати включення/виключення на боці відправника.

source: An B<r> is used to indicate that the rule applies to the receiving side. When a rule affects the receiving side, it prevents files from being deleted. See the B<s> modifier for more info. See also the protect (P) and risk (R) rules, which are an alternate way to specify receiver-side includes/excludes.
uk: B<r> використовують для позначення того, що правило застосовується до кінця отримувача. Якщо правило стосується кінця отримання, воно забороняє вилучення файлів. Див. модифікатор B<s>, щоб дізнатися більше. Див. також правила захисту (P) і ризику (R), які є альтернативним способом вказати включення/виключення на боці отримувача.

source: A B<p> indicates that a rule is perishable, meaning that it is ignored in directories that are being deleted. For instance, the B<--cvs-exclude> (B<-C>) option's default rules that exclude things like "CVS" and "B<*.o>" are marked as perishable, and will not prevent a directory that was removed on the source from being deleted on the destination.
uk: B<p> вказує, що правило є тимчасовим, що означає, що його буде проігноровано у каталогах, які вилучаються. Наприклад, типові правила параметра B<--cvs-exclude> (B<-C>), які виключають об'єкти, подібні до «CVS» і «B<*.o>» буде позначено як тимчасове, і воно не запобігатиме від вилучення каталогу, який вилучено у джерелі, на боці призначення.

source: An B<x> indicates that a rule affects xattr names in xattr copy/delete operations (and is thus ignored when matching file/dir names). If no xattr-matching rules are specified, a default xattr filtering rule is used (see the B<--xattrs> option).
uk: B<x> вказує, що правило стосується назв xattr у діях з копіювання/вилучення (і таким чином його буде проігноровано при встановленні відповідності назв файлів/каталогів). Якщо правил із встановленням відповідності за xattr не вказано, буде використано типове правило фільтрування за xattr (див. параметр B<--xattrs>).

source: MERGE-FILE FILTER RULES
uk: ПРАВИЛА ФІЛЬТРУВАННЯ ІЗ ОБ'ЄДНАННЯМ ФАЙЛІВ

source: You can merge whole files into your filter rules by specifying either a merge (.) or a dir-merge (:) filter rule (as introduced in the FILTER RULES section above).
uk: Ви можете об'єднати з вашими правилами фільтрування цілі файли, якщо вкажете правило фільтрування об'єднання (.) або об'єднання каталогів (:) (як їх представлено у розділі ПРАВИЛА ФІЛЬТРУВАННЯ вище).

source: There are two kinds of merged files\ -- single-instance ('.') and per-directory (':'). A single-instance merge file is read one time, and its rules are incorporated into the filter list in the place of the "." rule. For per-directory merge files, rsync will scan every directory that it traverses for the named file, merging its contents when the file exists into the current list of inherited rules. These per-directory rule files must be created on the sending side because it is the sending side that is being scanned for the available files to transfer. These rule files may also need to be transferred to the receiving side if you want them to affect what files don't get deleted (see PER-DIRECTORY RULES AND DELETE below).
uk: Існує два типи об'єднаних файлів\ -- для окремих екземплярів («.») і для окремих каталогів («:»). Файл об'єднання для окремих екземплярів буде прочитано один раз, а його правила буде вбудовано до списку фільтрування замість правила «.». Для файлів об'єднання для окремих каталогів rsync, шукаючи іменований файл, виконуватиме сканування кожного каталогу, об'єднуючи вміст файла, якщо файл існує у поточному списку успадкованих правил. Ці файли правил для окремих каталогів має бути створено на боці відправника, оскільки сканування щодо доступних для передавання файлів виконуватиметься на боці відправника. Ці файли правил можуть потребувати передавання на бік отримувача, якщо ви хочете, щоб вони впливали на те, які файли не слід вилучати (див. ОКРЕМІ ДЛЯ КАТАЛОГІВ ПРАВИЛА І ВИЛУЧЕННЯ нижче).

source: Some examples:
uk: Декілька прикладів:

source: The following modifiers are accepted after a merge or dir-merge rule:
uk: Приймаються такі модифікатори після правила об'єднання або об'єднання каталогів:

source: A B<-> specifies that the file should consist of only exclude patterns, with no other rule-parsing except for in-file comments.
uk: B<-> вказує, що файл складається лише зі взірців виключення; без іншої обробки правил, окрім коментарів у файлі.

source: A B<+> specifies that the file should consist of only include patterns, with no other rule-parsing except for in-file comments.
uk: B<+> вказує, що файл складається лише зі взірців включення; без іншої обробки правил, окрім коментарів у файлі.

source: A B<C> is a way to specify that the file should be read in a CVS-compatible manner. This turns on 'n', 'w', and '-', but also allows the list-clearing token (!) to be specified. If no filename is provided, ".cvsignore" is assumed.
uk: B<C> є способом вказати, що файл має бути прочитано у спосіб, сумісний із CVS. Вмикає «n», «w» і «-», але також уможливлює визначення мітки спорожнення списку (!). Якщо не вказано назви файла, буде використано назву «.cvsignore».

source: A B<e> will exclude the merge-file name from the transfer; e.g. "dir-merge,e \&.rules" is like "dir-merge .rules" and "- .rules".
uk: B<e> виключить назву файла об'єднання зі списку передавання; наприклад, «dir-merge,e \&.rules» є тим самим, що і «dir-merge .rules» і «- .rules».

source: An B<n> specifies that the rules are not inherited by subdirectories.
uk: B<n> визначає, що правила не успадковуються підкаталогами.

source: A B<w> specifies that the rules are word-split on whitespace instead of the normal line-splitting. This also turns off comments. Note: the space that separates the prefix from the rule is treated specially, so "- foo + bar" is parsed as two rules (assuming that prefix-parsing wasn't also disabled).
uk: B<w> вказує, що правила слід розділяти на слова за пробілами, а не звичайним поділом за рядками. Також вимикає коментарі. Зауваження: пробіл, який відокремлює префікс від правила, буде оброблено особливим чином, отже «- щось + десь» буде оброблено як два правила (припускаємо, що не було також вимкнено обробку префіксів).

source: You may also specify any of the modifiers for the "+" or "-" rules (above) in order to have the rules that are read in from the file default to having that modifier set (except for the B<!> modifier, which would not be useful). For instance, "merge,-/ .excl" would treat the contents of .excl as absolute-path excludes, while "dir-merge,s .filt" and ":sC" would each make all their per-directory rules apply only on the sending side. If the merge rule specifies sides to affect (via the B<s> or B<r> modifier or both), then the rules in the file must not specify sides (via a modifier or a rule prefix such as B<hide>).
uk: Ви також можете вказати будь-які модифікатори для правил «+» або «-» (вище), щоб усі правила, які буде прочитано з файла, типово мали встановлений модифікатор (окрім модифікатора B<!>, який не матиме сенсу). Наприклад, «merge,-/ .excl» наказує обробляти вміст .excl, як виключення за абсолютними шляхами, а «dir-merge,s .filt» і «:sC» кожне призведуть до застосування їхніх правил для окремих каталогів на боці відправника. Якщо правила об'єднання вказують кінці передавання, яких вони стосуються (за допомогою модифікатора B<s> або B<r> чи обох модифікаторів), правила у файлі не повинні містити визначення кінця передавання (за допомогою модифікатора або префікса правил, зокрема B<hide>).

source: Per-directory rules are inherited in all subdirectories of the directory where the merge-file was found unless the 'n' modifier was used. Each subdirectory's rules are prefixed to the inherited per-directory rules from its parents, which gives the newest rules a higher priority than the inherited rules. The entire set of dir-merge rules are grouped together in the spot where the merge-file was specified, so it is possible to override dir-merge rules via a rule that got specified earlier in the list of global rules. When the list-clearing rule ("!") is read from a per-directory file, it only clears the inherited rules for the current merge file.
uk: Правила для окремих каталогів успадковуються в усіх підкаталогах каталогу, де було знайдено файл об'єднання, якщо не було використано модифікатор «n». Правила для окремих підкаталогів буде дописано до успадкованих правил для окремих каталогів з його батьківських каталогів, що дає найновішим правилам вищий пріоритет за успадковані правила. Увесь набір правила об'єднання каталогів буде згруповано у місці, Де було вказано файли об'єднання, тому можна перевизначити правила об'єднання каталогів за допомогою правила, яке вказано раніше у списку загальних правил. Якщо з файла для окремих каталогів буде прочитано правило спорожнення списку («!»), воно спорожнюватиме лише успадковані правила для поточного файла об'єднання.

source: Another way to prevent a single rule from a dir-merge file from being inherited is to anchor it with a leading slash. Anchored rules in a per-directory merge-file are relative to the merge-file's directory, so a pattern "/foo" would only match the file "foo" in the directory where the dir-merge filter file was found.
uk: Іншим способом запобігти успадкуванню окремого правила з файла об'єднання каталогів є його прив'язування за допомогою початкового символу похилої риски. Прив'язані правила у файлів об'єднання для окремих каталогів є відносними до каталогу файла об'єднання, тому взірець «/щось» відповідатиме лише файлу «щось» у каталозі, де буде знайдено файл фільтрування об'єднання каталогів.

source: Here's an example filter file which you'd specify via B<--filter=".\ file":>
uk: Ось приклад файла фільтрування, який можна вказати за допомогою B<--filter=".\ file":>

source: merge /home/user/.global-filter - *.gz dir-merge .rules + *.[ch] - *.o - foo*
uk: merge /home/user/.global-filter - *.gz dir-merge .rules + *.[ch] - *.o - щось*
