Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: This will merge the contents of the /home/user/.global-filter file at the start of the list and also turns the ".rules" filename into a per-directory filter file. All rules read in prior to the start of the directory scan follow the global anchoring rules (i.e. a leading slash matches at the root of the transfer).
uk: У результаті на початок списку буде внесено вміст файла /home/user/.global-filter, а також визначено назву файла «.rules» для файла фільтрування для окремих каталогів. Усі правила, які буде прочитано перед початком сканування каталогів, підлягатимуть загальним правилам прив'язки (тобто початковий символ похилої риски відповідатиме кореневому каталогу передавання даних).

source: If a per-directory merge-file is specified with a path that is a parent directory of the first transfer directory, rsync will scan all the parent dirs from that starting point to the transfer directory for the indicated per-directory file. For instance, here is a common filter (see B<-F>):
uk: Якщо вказано файл об'єднання для окремих каталогів із шляхом, який є батьківським шляхом першого каталогу передавання, rsync буде сканувати усі батьківські каталоги з початкової точки для передавання каталогу для вказаного файла окремих каталогів. Наприклад, ось типове фільтрування (див. B<-F>):

source: That rule tells rsync to scan for the file .rsync-filter in all directories from the root down through the parent directory of the transfer prior to the start of the normal directory scan of the file in the directories that are sent as a part of the transfer. (Note: for an rsync daemon, the root is always the same as the module's "path".)
uk: Це правило наказує rsync сканувати файл .rsync-filter в усіх каталогах від кореневого через батьківський каталог передавання до початку звичайного сканування каталогів файла у каталогах, які буде надіслано як частину передавання. (Зауваження: для фонової служби rsync кореневим каталогом завжди буде той самий каталог, що і «шлях» модуля.)

source: Some examples of this pre-scanning for per-directory files:
uk: Декілька прикладів цього попереднього сканування для файлів окремих каталогів:

source: rsync -avF /src/path/ /dest/dir rsync -av --filter=': ../../.rsync-filter' /src/path/ /dest/dir rsync -av --filter=': .rsync-filter' /src/path/ /dest/dir
uk: rsync -avF /джерело/шлях/ /призначення/каталог rsync -av --filter=': ../../.rsync-filter' /джерело/шлях/ /призначення/каталог rsync -av --filter=': .rsync-filter' /джерело/шлях/ /призначення/каталог

source: The first two commands above will look for ".rsync-filter" in "/" and "/src" before the normal scan begins looking for the file in "/src/path" and its subdirectories. The last command avoids the parent-dir scan and only looks for the ".rsync-filter" files in each directory that is a part of the transfer.
uk: Перші дві команди вище призведуть до пошуку «.rsync-filter» у «/» і «/src» перед початком звичайного сканування. Буде виконано пошук файла у «/джерело/шлях» і його підкаталогах. Остання команда призведе до уникання сканування батьківського каталогу і дасть пошук файлів «.rsync-filter» лише у кожному каталозі, який є частиною передавання.

source: If you want to include the contents of a ".cvsignore" in your patterns, you should use the rule ":C", which creates a dir-merge of the .cvsignore file, but parsed in a CVS-compatible manner. You can use this to affect where the B<--cvs-exclude> (B<-C>) option's inclusion of the per-directory \&.cvsignore file gets placed into your rules by putting the ":C" wherever you like in your filter rules. Without this, rsync would add the dir-merge rule for the .cvsignore file at the end of all your other rules (giving it a lower priority than your command-line rules). For example:
uk: Якщо ви хочете включити вміст «.cvsignore» до ваших взірців, вам слід скористатися правилом «:C», яке створює об'єднання каталогів файла .cvsignore, але із обробкою у сумісний із CVS спосіб. Ви можете скористатися цим для того, щоб вплинути на те, де відбуватиметься включення параметра B<--cvs-exclude> (B<-C>) файла \&.cvsignore для окремих каталогів до ваших правил, за допомогою розташування «:C» там, де ви хочете розмістити ваші правила фільтрування. Без цього, rsync додаватиме правило об'єднання каталогів для файла .cvsignore наприкінці усіх ваших інших правил (що надаватиме йому нижчої пріоритетності за правила у рядку команди). Приклад:

source: cat E<lt>E<lt>EOT | rsync -avC --filter='. -' a/ b + foo.o :C - *.old EOT rsync -avC --include=foo.o -f :C --exclude='*.old' a/ b
uk: cat E<lt>E<lt>EOT | rsync -avC --filter='. -' a/ b + щось.o :C - *.old EOT rsync -avC --include=щось.o -f :C --exclude='*.old' a/ b

source: Both of the above rsync commands are identical. Each one will merge all the per-directory .cvsignore rules in the middle of the list rather than at the end. This allows their dir-specific rules to supersede the rules that follow the :C instead of being subservient to all your rules. To affect the other CVS exclude rules (i.e. the default list of exclusions, the contents of $HOME/.cvsignore, and the value of $CVSIGNORE) you should omit the B<-C> command-line option and instead insert a "-C" rule into your filter rules; e.g. "B<--filter=-C>".
uk: Обидві наведені вище команди rsync є тотожними. Кожна з них об'єднуватиме усі правила .cvsignore для окремих каталогів всередині списку, а не у його кінці. Це надає змогу його правилам для окремих каталогів мати вищий пріоритет за правила, які описано після :C, а не бути перевизначеними усіма вашими правилами. Щоб вплинути на інші правила виключення CVS (тобто типовий список виключень, вміст $HOME/.cvsignore та значення $CVSIGNORE), вам слід уникати використання параметра командного рядка B<-C>, а замість цього вставити правило «-C» до ваших правил фільтрування; наприклад, «B<--filter=-C>».

source: LIST-CLEARING FILTER RULE
uk: ПРАВИЛО ФІЛЬТРУВАННЯ СПОРОЖНЕННЯ СПИСКУ

source: You can clear the current include/exclude list by using the "!" filter rule (as introduced in the FILTER RULES section above). The "current" list is either the global list of rules (if the rule is encountered while parsing the filter options) or a set of per-directory rules (which are inherited in their own sub-list, so a subdirectory can use this to clear out the parent's rules).
uk: Ви можете спорожнити поточний список включення/виключення за допомогою правила фільтрування «!» (як про це згадано у розділі ПРАВИЛА ФІЛЬТРУВАННЯ вище). «Поточним» вважається список, який є або загальним списком правил (якщо правило було виявлено під час обробки параметрів фільтрування), або набір правил для окремих каталогів (які успадковуються у своєму власному підписку, отже, на рівні підкаталогу цим можна скористатися для спорожнення правил батьківського каталогу).

source: ANCHORING INCLUDE/EXCLUDE PATTERNS
uk: ПРИВ'ЯЗКА ВЗІРЦІВ ВКЛЮЧЕННЯ/ВИКЛЮЧЕННЯ

source: As mentioned earlier, global include/exclude patterns are anchored at the "root of the transfer" (as opposed to per-directory patterns, which are anchored at the merge-file's directory). If you think of the transfer as a subtree of names that are being sent from sender to receiver, the transfer-root is where the tree starts to be duplicated in the destination directory. This root governs where patterns that start with a / match.
uk: Як вже згадувалося раніше, загальні взірці включення/виключення буде прив'язано до «кореневого каталогу передавання» (на відміну від взірців окремих каталогів, які прив'язано до каталогу файла об'єднання). Якщо розглядати передавання, які підієрархію назв, які буде надіслано від відправника до отримувача, кореневим каталогом передавання є каталог, де починається ієрархія, яку слід здублювати у каталозі призначення. Цей кореневий каталог керує тим, де встановлюватиметься відповідність взірців, які починаються з /.

source: Because the matching is relative to the transfer-root, changing the trailing slash on a source path or changing your use of the B<--relative> option affects the path you need to use in your matching (in addition to changing how much of the file tree is duplicated on the destination host). The following examples demonstrate this.
uk: Оскільки відповідність є відносною до кореневого каталогу передавання, зміна кінцевого символу похилої риски у шляху джерела або зміна вашого використання параметра B<--relative> впливає на шлях, яким вам слід скористатися у вашій відповідності (на додачу до зміни того, наскільки ієрархію файлів буде здубльовано на вузлі призначення). Це демонструють наведені нижче приклади.

source: Let's say that we want to match two source files, one with an absolute path of "/home/me/foo/bar", and one with a path of "/home/you/bar/baz". Here is how the various command choices differ for a 2-source transfer:
uk: Припустімо, що ви хочете встановити відповідність двох файлів джерела, одного із абсолютним шляхом «/home/я/щось/десь», і одного зі шляхом «/home/ви/десь/тут». Ось, як відрізняються різні варіанти команди для передавання із 2 джерелами:

source: Example cmd: rsync -a /home/me /home/you /dest +/- pattern: /me/foo/bar +/- pattern: /you/bar/baz Target file: /dest/me/foo/bar Target file: /dest/you/bar/baz
uk: Приклад команди: rsync -a /home/я /home/ви /призначення +/- pattern: /я/щось/десь +/- pattern: /ви/десь/тут Файл цілі: /призначення/я/щось/десь Файл цілі: /призначення/ви/десь/тут

source: Example cmd: rsync -a /home/me/ /home/you/ /dest +/- pattern: /foo/bar (note missing "me") +/- pattern: /bar/baz (note missing "you") Target file: /dest/foo/bar Target file: /dest/bar/baz
uk: Приклад команди: rsync -a /home/я/ /home/ви/ /призначення +/- pattern: /щось/десь (зауважте пропущене «я») +/- pattern: /десь/тут (зауважте пропущене «ви») Файл цілі: /призначення/щось/десь Файл цілі: /призначення/десь/тут

source: Example cmd: rsync -a --relative /home/me/ /home/you /dest +/- pattern: /home/me/foo/bar (note full path) +/- pattern: /home/you/bar/baz (ditto) Target file: /dest/home/me/foo/bar Target file: /dest/home/you/bar/baz
uk: Приклад команди: rsync -a --relative /home/я/ /home/ви /призначення +/- pattern: /home/я/щось/десь (зауважте повний шлях) +/- pattern: /home/ви/десь/тут (те саме) Файл цілі: /призначення/home/я/щось/десь Файл цілі: /призначення/home/ви/десь/тут

source: Example cmd: cd /home; rsync -a --relative me/foo you/ /dest +/- pattern: /me/foo/bar (starts at specified path) +/- pattern: /you/bar/baz (ditto) Target file: /dest/me/foo/bar Target file: /dest/you/bar/baz
uk: Приклад команди: cd /home; rsync -a --relative я/щось ви/ /призначення +/- pattern: /я/щось/десь (починається з вказаного шляху) +/- pattern: /ви/десь/тут (те саме) Файл цілі: /призначення/я/щось/десь Файл цілі: /призначення/ви/десь/тут

source: The easiest way to see what name you should filter is to just look at the output when using B<--verbose> and put a / in front of the name (use the B<--dry-run> option if you're not yet ready to copy any files).
uk: Найпростішим способом перегляду, яку назву вам слід фільтрувати, є проста обробка виведення при використанні B<--verbose> і додавання / перед назвою (скористайтеся параметром B<--dry-run>, якщо ви не готові до копіювання якихось файлів).

source: PER-DIRECTORY RULES AND DELETE
uk: ПРАВИЛА ДЛЯ ОКРЕМИХ КАТАЛОГІВ ТА ВИЛУЧЕННЯ

source: Without a delete option, per-directory rules are only relevant on the sending side, so you can feel free to exclude the merge files themselves without affecting the transfer. To make this easy, the 'e' modifier adds this exclude for you, as seen in these two equivalent commands:
uk: Без параметра вилучення правила для окремих каталогів є дієвими лише на боці відправника, ви можете виключити самі файли об'єднання без впливу на передавання. Щоб спростити це, це виключення додає модифікатор «e», як це можна бачити у цих двох тотожних командах:

source: rsync -av --filter=': .excl' --exclude=.excl host:src/dir /dest rsync -av --filter=':e .excl' host:src/dir /dest
uk: rsync -av --filter=': .excl' --exclude=.excl вузол:джерело/каталог /призначення rsync -av --filter=':e .excl' вузол:джерело/каталог /призначення

source: However, if you want to do a delete on the receiving side AND you want some files to be excluded from being deleted, you'll need to be sure that the receiving side knows what files to exclude. The easiest way is to include the per-directory merge files in the transfer and use B<--delete-after>, because this ensures that the receiving side gets all the same exclude rules as the sending side before it tries to delete anything:
uk: Втім, якщо ви хочете виконати вилучення на боці отримання І ви хочете виключити якісь файли зі списку вилучення, вам потрібно бути певними, що на боці отримання було відомо, які файли слід виключити. Найпростішим способом є включення файлів об'єднання окремих каталогів у передаванні і використання B<--delete-after>, оскільки це забезпечує те, що кінець отримання отримає ті самі правила виключення, що маємо на боці відправника, перш ніж буде зроблено спробу щось вилучити:

source: rsync -avF --delete-after host:src/dir /dest
uk: rsync -avF --delete-after вузол:джерело/каталог /призначення

source: However, if the merge files are not a part of the transfer, you'll need to either specify some global exclude rules (i.e. specified on the command line), or you'll need to maintain your own per-directory merge files on the receiving side. An example of the first is this (assume that the remote .rules files exclude themselves):
uk: Втім, якщо файли об'єднання не є частиною передавання даних, вам слід або вказати якісь загальні правила виключення (тобто правила, які вказано у рядку команди), або вам доведеться супроводжувати ваші власні файли об'єднання окремих каталогів на боці отримання. Прикладом першого є таке (припускаємо, що віддалені файли .rules виключають самі себе):

source: rsync -av --filter=': .rules' --filter='. /my/extra.rules' --delete host:src/dir /dest
uk: rsync -av --filter=': .rules' --filter='. /my/extra.rules' --delete вузол:джерело/каталог /призначення

source: In the above example the extra.rules file can affect both sides of the transfer, but (on the sending side) the rules are subservient to the rules merged from the .rules files because they were specified after the per-directory merge rule.
uk: У наведеному вище прикладі файл extra.rules може стосуватися обох боків передавання, але (на боці відправника) правила є підлеглими щодо правил, які об'єднано з файлів .rules, оскільки їх було вказано після правила об'єднання окремих каталогів.

source: In one final example, the remote side is excluding the .rsync-filter files from the transfer, but we want to use our own .rsync-filter files to control what gets deleted on the receiving side. To do this we must specifically exclude the per-directory merge files (so that they don't get deleted) and then put rules into the local files to control what else should not get deleted. Like one of these commands:
uk: В останньому прикладі віддалений бік виключає файли .rsync-filter з передавання, але ми хочемо скористатися нашими власними файлами .rsync-filter для керування тим, що буде вилучено на боці отримання. Щоб зробити це, ми маємо спеціально виключити файли об'єднання окремих каталогів (отже, їх не буде вилучено), а потім записати правила до локальних файлів для керування тим, що ще не має бути вилучено. Як одна з цих команд:

source: rsync -av --filter=':e /.rsync-filter' --delete \e host:src/dir /dest rsync -avFF --delete host:src/dir /dest
uk: rsync -av --filter=':e /.rsync-filter' --delete \e вузол:джерело/каталог /призначення rsync -avFF --delete вузол:джерело/каталог /призначення

source: BATCH MODE
uk: ПАКЕТНИЙ РЕЖИМ

source: Batch mode can be used to apply the same set of updates to many identical systems. Suppose one has a tree which is replicated on a number of hosts. Now suppose some changes have been made to this source tree and those changes need to be propagated to the other hosts. In order to do this using batch mode, rsync is run with the write-batch option to apply the changes made to the source tree to one of the destination trees. The write-batch option causes the rsync client to store in a "batch file" all the information needed to repeat this operation against other, identical destination trees.
uk: Пакетним режимом можна скористатися для застосування того самого набору оновлень до багатьох тотожних систем. Припустімо, що маємо ієрархію, яка відтворюється на значній кількості вузлів. Тепер, припустімо, що до ієрархії джерела було внесено якісь зміни, і ці зміни має бути поширено на інші вузли. Для того, щоб виконати це завдання за допомогою пакетного режиму, rsync запускають із параметром пакетного запису для застосування змін, які внесено до ієрархії джерела, до ієрархій призначення. Параметр пакетного запису (write-batch) наказує клієнту rsync зберігати у «пакетному файлі» усі дані, які потрібні для повторення цих дій із іншими, тотожними, ієрархіями призначення.

source: Generating the batch file once saves having to perform the file status, checksum, and data block generation more than once when updating multiple destination trees. Multicast transport protocols can be used to transfer the batch update files in parallel to many hosts at once, instead of sending the same data to every host individually.
uk: Одноразове створення пакетного файла заощаджує час на перевірку стану файлів, контрольних сум та створення блоку даних при оновленні декількох ієрархій призначення. Можна використати протоколи трансляції даних для паралельного одночасного передавання файлів пакетного оновлення на багато вузлів, замість надсилання тих самих даних кожному вузлу окремо.

source: To apply the recorded changes to another destination tree, run rsync with the read-batch option, specifying the name of the same batch file, and the destination tree. Rsync updates the destination tree using the information stored in the batch file.
uk: Щоб застосувати записані зміни до іншої ієрархії призначення, запустіть rsync із параметром пакетного читання (read-batch), вказавши назву того самого пакетного файла і ієрархію призначення. Rsync оновить ієрархію призначення на основі відомостей, які збережено у пакетному файлі.

source: Examples:
uk: Приклади:

source: $ rsync --write-batch=foo -a host:/source/dir/ /adest/dir/ $ scp foo* remote: $ ssh remote ./foo.sh /bdest/dir/
uk: $ rsync --write-batch=щось -a вузол:/джерело/каталог/ /aпризначення/каталог/ $ scp щось* remote: $ ssh remote ./щось.sh /bпризначення/каталог/

source: $ rsync --write-batch=foo -a /source/dir/ /adest/dir/ $ ssh remote rsync --read-batch=- -a /bdest/dir/ E<lt>foo
uk: $ rsync --write-batch=щось -a /джерело/каталог/ /aпризначення/каталог/ $ ssh remote rsync --read-batch=- -a /bпризначення/каталог/ E<lt>щось

source: The first example shows that the initial copy doesn't have to be local\ -- you can push or pull data to/from a remote host using either the remote-shell syntax or rsync daemon syntax, as desired.
uk: Перший приклад показує, що початкове копіювання не має бути обов'язково локальним\ -- ви можете, за потреби, записати або отримати дані до/з віддаленого вузла за допомогою або синтаксису віддаленої оболонки, або синтаксису фонової служби rsync.

source: The first example uses the created "foo.sh" file to get the right rsync options when running the read-batch command on the remote host.
uk: У першому прикладі використано створений файл «щось.sh» для отримання належних параметрів rsync при запуску команди пакетного читання на віддаленому вузлі.

source: Caveats:
uk: Застереження:

source: The original batch mode in rsync was based on "rsync+", but the latest version uses a new implementation.
uk: Початкова версія пакетного режиму у rsync було засновано на «rsync+», але у найсвіжішій версії використано нову реалізацію.

source: SYMBOLIC LINKS
uk: СИМВОЛІЧНІ ПОСИЛАННЯ

source: If B<--copy-links> is specified, then symlinks are "collapsed" by copying their referent, rather than the symlink.
uk: Якщо вказано B<--copy-links>, символічні посилання буде «згорнуто» копіюванням того, на що вони посилаються, а не самого символічного посилання.

source: Turn all unsafe symlinks into files and create all safe symlinks.
uk: Перетворити усі небезпечні символічні посилання на файли і створити усі безпечні символічні посилання.

source: Turn all unsafe symlinks into files, noisily skip all safe symlinks.
uk: Перетворити усі небезпечні символічні посилання на файли і з повідомленнями пропустити усі безпечні символічні посилання.

source: Create all symlinks.
uk: Створити усі символічні посилання.

source: For the effect of B<--munge-links>, see the discussion in that option's section.
uk: Щоб дізнатися про роботу B<--munge-links>, див. обговорення у розділі цього параметра.

source: DIAGNOSTICS
uk: ДІАГНОСТИКА

source: EXIT VALUES
uk: ЗНАЧЕННЯ ВИХОДУ

source: B<0> - Success
uk: B<0> — успіх

source: B<1> - Syntax or usage error
uk: B<1> — синтаксична помилка або помилка використання

source: B<2> - Protocol incompatibility
uk: B<2> — несумісність протоколів

source: B<3> - Errors selecting input/output files, dirs
uk: B<3> — помилки вибору вхідних-вихідних файлів, каталоги

source: B<4> - Requested action not supported. Either:
uk: B<4> — підтримки бажаної дії не передбачено. Варіанти дій:

source: an attempt was made to manipulate 64-bit files on a platform that cannot support them
uk: зроблено спробу керування 64-бітовими файлами на платформі, де не передбачено їхньої підтримки

source: an option was specified that is supported by the client and not by the server
uk: вказано параметр, підтримку якого передбачено на клієнті, але не на сервері

source: B<5> - Error starting client-server protocol
uk: B<5> — помилка під час запуску протоколу клієнт-сервер

source: B<6> - Daemon unable to append to log-file
uk: B<6> — фоновій службі не вдалося дописати дані до файла журналу

source: B<10> - Error in socket I/O
uk: B<10> — помилка у введенні-виведенні із сокета

source: B<11> - Error in file I/O
uk: B<11> — помилка у введенні-виведенні до файла

source: B<12> - Error in rsync protocol data stream
uk: B<12> — помилка у потоці даних протоколу rsync

source: B<13> - Errors with program diagnostics
uk: B<13> — помилки у діагностиці програми

source: B<14> - Error in IPC code
uk: B<14> — помилка у коді IPC

source: B<20> - Received SIGUSR1 or SIGINT
uk: B<20> — отримано SIGUSR1 або SIGINT

source: B<21> - Some error returned by B<waitpid()>
uk: B<21> — B<waitpid()> повернуто якусь помилку

source: B<22> - Error allocating core memory buffers
uk: B<22> — помилка розподілу буферів пам'яті ядра

source: B<23> - Partial transfer due to error
uk: B<23> — часткове передавання через помилку

source: B<24> - Partial transfer due to vanished source files
uk: B<24> — часткове передавання через зникнення початкових файлів

source: B<25> - The --max-delete limit stopped deletions
uk: B<25> — зупинення вилучень через обмеження --max-delete

source: B<30> - Timeout in data send/receive
uk: B<30> — перевищення часу очікування під час надсилання-отримання даних

source: B<35> - Timeout waiting for daemon connection
uk: B<35> — перевищення часу очікування на з'єднання з фоновою службою

source: ENVIRONMENT VARIABLES
uk: ЗМІННІ СЕРЕДОВИЩА

source: First supported in 3.2.4.
uk: Вперше реалізовано підтримку у 3.2.4.

source: First supported in 3.1.0. Starting in 3.2.4, this variable is ignored if B<RSYNC_OLD_ARGS> is set to a non-zero value.
uk: Вперше реалізовано підтримку у версії 3.1.0. Починаючи з 3.2.4, цю змінну буде проігноровано, якщо встановлено ненульове значення для B<RSYNC_OLD_ARGS>.

source: B<USER> or B<LOGNAME>
uk: B<USER> або B<LOGNAME>
