Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: This does not interfere with the updating of a file's non-content attributes (e.g. permissions, ownership, etc.) when the file does not need to be transferred, nor does it affect the updating of any directories or non-regular files.
uk: Цей параметр не заважатиме оновленню не пов'язаних із вмістом атрибутів файлів (наприклад, прав доступу, прав власності тощо), якщо дані файла не потрібно передавати. Також він не стосується оновлення каталогів або файлів, які є особливими.

source: This special copy mode works like B<--append> except that all the data in the file is included in the checksum verification (making it less efficient but also potentially safer). This option B<can be dangerous> if you aren't 100% sure that all the files in the transfer are shared, growing files. See the B<--append> option for more details.
uk: Цей особливий режим копіювання працює подібно до режиму B<--append>, але для обчислення контрольної суми буде використано усі дані у файлі (це робить його менш ефективним, але, потенційно, безпечнішим). Використання цього параметра B<може бути небезпечним>, якщо немає 100% гарантії, що розмір усіх файлів, дані яких буде передано, зростає. Див. параметр B<--append>, щоб дізнатися більше.

source: Note: prior to rsync 3.0.0, the B<--append> option worked like B<--append-verify>, so if you are interacting with an older rsync (or the transfer is using a protocol prior to 30), specifying either append option will initiate an B<--append-verify> transfer.
uk: Зауваження: до версії rsync 3.0.0 параметр B<--append> працював як B<--append-verify>, тому якщо ви працюєте із застарілою версією rsync (або під час передавання використано протокол до версії 30), використання будь-якого з цих параметрів призведе до започаткування передавання даних у режимі B<--append-verify>.

source: Tell the sending side to include any directories that are encountered. Unlike B<--recursive>, a directory's contents are not copied unless the directory name specified is "." or ends with a trailing slash (e.g. ".", "dir/.", "dir/", etc.). Without this option or the B<--recursive> option, rsync will skip all directories it encounters (and output a message to that effect for each one). If you specify both B<--dirs> and B<--recursive>, B<--recursive> takes precedence.
uk: Наказати включити на боці надсилання усі знайдені каталоги. На відміну від B<--recursive>, вміст каталогів скопійовано не буде, якщо назву каталогу не вказано як «.» або назва не завершується символом похилої риски (наприклад, «.», «каталог/.», «каталог/» тощо). Без цього параметра або параметра B<--recursive> rsync пропустить усі каталоги, які буде знайдено (і виведе повідомлення про вплив на кожен запис). Якщо ви вкажете одразу B<--dirs> і B<--recursive>, перевагу буде надано B<--recursive>.

source: The B<--dirs> option is implied by the B<--files-from> option or the B<--list-only> option (including an implied B<--list-only> usage) if B<--recursive> wasn't specified (so that directories are seen in the listing). Specify B<--no-dirs> (or B<--no-d>) if you want to turn this off.
uk: Параметр B<--dirs> неявним чином встановлюється параметр B<--files-from> або параметр B<--list-only> (разом із неявним використанням B<--list-only>), якщо не вказано B<--recursive> (отже каталоги видно у списку). Вкажіть B<--no-dirs> (або B<--no-d>), якщо ви хочете вимкнути цю поведінку.

source: There is also a backward-compatibility helper option, B<--old-dirs> (B<--old-d>) that tells rsync to use a hack of B<-r\ --exclude='/*/*'> to get an older rsync to list a single directory without recursing.
uk: Також передбачено допоміжний параметр для забезпечення зворотної сумісності, B<--old-dirs> (B<--old-d>). Він наказує rsync скористатися B<-r\ --exclude='/*/*'> для отримання списку вмісту окремого каталогу без рекурсії, як у старому rsync.

source: Create a missing path component of the destination arg. This allows rsync to create multiple levels of missing destination dirs and to create a path in which to put a single renamed file. Keep in mind that you'll need to supply a trailing slash if you want the entire destination path to be treated as a directory when copying a single arg (making rsync behave the same way that it would if the path component of the destination had already existed).
uk: Створити пропущену частину компоненти шляху в аргументі призначення. Це уможливлює для rsync створення декількох рівнів пропущених каталогів призначення і створення шляху, за яким слід зберегти окремий перейменований файл. Пам'ятайте, що вам слід вказати кінцевий символ похилої риски, якщо хочете, щоб програма вважала шлях каталогом при копіюванні одинарного аргументу (наказавши rsync поводитися так само, як програма поводилася б, якщо б компонент шляху призначення вже існував).

source: For example, the following creates a copy of file foo as bar in the sub/dir directory, creating dirs "sub" and "sub/dir" if either do not yet exist:
uk: Наприклад, вказана нижче команда створить копію файла «щось» як «десь» у каталозі «під/каталог», створивши каталоги «під» і «під/каталог», якщо якогось із них ще не існує:

source: rsync -ai --mkpath foo sub/dir/bar
uk: rsync -ai --mkpath щось під/каталог/десь

source: If you instead ran the following, it would have created file foo in the sub/dir/bar directory:
uk: Якщо ж ви замість цієї команди скористаєтеся наступною командою, буде створено файл «щось» у каталозі «під/каталог/десь»:

source: rsync -ai --mkpath foo sub/dir/bar/
uk: rsync -ai --mkpath щось під/каталог/десь/

source: Add symlinks to the transferred files instead of noisily ignoring them with a "non-regular file" warning for each symlink encountered. You can alternately silence the warning by specifying B<--info=nonreg0>.
uk: Додати символічні посилання до переданих файлів замість ігнорування цих файлів з повідомленням «не є звичайним файлом» для кожного знайденого символічного посилання. Ви також можете придушити попередження за допомогою параметра B<--info=nonreg0>.

source: The default handling of symlinks is to recreate each symlink's unchanged value on the receiving side.
uk: Типовою обробкою символічних посилань передбачено повторне створення кожного незмінного значення символічного посилання на боці отримувача.

source: See the SYMBOLIC LINKS section for multi-option info.
uk: Див. розділ СИМВОЛІЧНІ ПОСИЛАННЯ, щоб дізнатися більше про поєднання параметрів.

source: The sender transforms each symlink encountered in the transfer into the referent item, following the symlink chain to the file or directory that it references. If a symlink chain is broken, an error is output and the file is dropped from the transfer.
uk: Відправник перетворює кожне знайдене символічне посилання на запис, на який це посилання посилається, переходячи ланцюжком символічних посилань до файла або каталогу, на які воно посилається. Якщо ланцюжок символічних посилань пошкоджено, буде виведено повідомлення про помилку, а відповідний файл виключено з передавання.

source: This option supersedes any other options that affect symlinks in the transfer, since there are no symlinks left in the transfer.
uk: Цей параметр перевизначає значення усіх інших параметрів, які стосуються символічних посилань у передаванні даних, оскільки у даних, які буде передано, вже не буде символічних посилань.

source: This option does not change the handling of existing symlinks on the receiving side, unlike versions of rsync prior to 2.6.3 which had the side-effect of telling the receiving side to also follow symlinks. A modern rsync won't forward this option to a remote receiver (since only the sender needs to know about it), so this caveat should only affect someone using an rsync client older than 2.6.7 (which is when B<-L> stopped being forwarded to the receiver).
uk: Цей параметр не змінює обробку наявних символічних посилань на боці отримувача, на відміну від версій rsync до 2.6.3, у яких його використання мало побіжний ефект, який полягав у тому, що програма переходила за символічними посиланнями і на боці отримувача. Сучасні версії rsync не передають цей параметр на віддалені отримувачі (оскільки про нього має знати лише відправник), тому ця проблема може виникнути лише у тих, хто користується клієнтом rsync версії, старішої за 2.6.7 (версії, коли B<-L> перестали передавати на бік отримувача).

source: See the B<--keep-dirlinks> (B<-K>) if you need a symlink to a directory to be treated as a real directory on the receiving side.
uk: Див. B<--keep-dirlinks> (B<-K>), якщо вам потрібне, щоб символічне посилання на каталог було оброблено як справжній каталог на боці отримання.

source: This tells rsync to copy the referent of symbolic links that point outside the copied tree. Absolute symlinks are also treated like ordinary files, and so are any symlinks in the source path itself when B<--relative> is used.
uk: Наказує rsync копіювати те, на що посилається символічне посилання, якщо об'єкт посилання перебуває поза ієрархією копіювання. Абсолютні символічні посилання також вважаються звичайними файлами, так само, як усі посилання у самому шляху джерела, якщо використано B<--relative>.

source: Note that the cut-off point is the top of the transfer, which is the part of the path that rsync isn't mentioning in the verbose output. If you copy "/src/subdir" to "/dest/" then the "subdir" directory is a name inside the transfer tree, not the top of the transfer (which is /src) so it is legal for created relative symlinks to refer to other names inside the /src and /dest directories. If you instead copy "/src/subdir/" (with a trailing slash) to "/dest/subdir" that would not allow symlinks to any files outside of "subdir".
uk: Зауважте, що точку обрізання розташовано на верхній позиції передавання, тобто частині шляху, яку rsync не згадує у докладних повідомленнях. Якщо ви скопіюєте «/джерело/підкаталог» до «/призначення/» каталог «підкаталог» буде назвою усередині ієрархії передавання, а не на верхній позиції передавання (тобто у /джерело), тому для створених символічних посилань буде коректним посилатися на інші об'єкти всередині каталогів /джерело і /призначення. Якщо ж ви скопіюєте «/джерело/підкаталог/» (із кінцевою похилою рискою) до «/призначення/підкаталог», символічні посилання на будь-які файли поза «підкаталог» будуть некоректними.

source: Note that safe symlinks are only copied if B<--links> was also specified or implied. The B<--copy-unsafe-links> option has no extra effect when combined with B<--copy-links>.
uk: Зауважте, що безпечні символічні посилання буде скопійовано, лише якщо було вказано явно чи неявно B<--links>. Параметр B<--copy-unsafe-links> не матиме додаткового впливу на обробку, якщо його поєднати із B<--copy-links>.

source: This tells the receiving rsync to ignore any symbolic links in the transfer which point outside the copied tree. All absolute symlinks are also ignored.
uk: За допомогою цього параметра можна наказати rsync на боці отримання даних ігнорувати всі символічні посилання у межах ієрархії тек, яка копіюється. Всі абсолютні символічні посилання буде також проігноровано.

source: Since this ignoring is happening on the receiving side, it will still be effective even when the sending side has munged symlinks (when it is using B<--munge-links>). It also affects deletions, since the file being present in the transfer prevents any matching file on the receiver from being deleted when the symlink is deemed to be unsafe and is skipped.
uk: Оскільки це ігнорування відбуватиметься на боці отримання, воно діятиме, навіть якщо на боці надсилання є зіпсовані символічні посилання (коли використано B<--munge-links>). Також це вплине на вилучення, оскільки наявність файл у списку передавання запобігає вилученню будь-якого відповідного файла на боці отримувача, якщо символічне посилання визнано небезпечним і пропущено.

source: This option must be combined with B<--links> (or B<--archive>) to have any symlinks in the transfer to conditionally ignore. Its effect is superseded by B<--copy-unsafe-links>.
uk: Цей параметр має бути поєднано з B<--links> (або B<--archive>), щоб якісь символічні посилання при передаванні було умовно проігноровано. Його результат буде перевизначено B<--copy-unsafe-links>.

source: Using this option in conjunction with B<--relative> may give unexpected results.
uk: Використання цього параметра разом з параметром B<--relative> може призвести до небажаних результатів.

source: This option affects just one side of the transfer and tells rsync to munge symlink values when it is receiving files or unmunge symlink values when it is sending files. The munged values make the symlinks unusable on disk but allows the original contents of the symlinks to be recovered.
uk: Цей параметр стосується лише одного кінця передавання і наказує rsync зіпсувати значення символічних посилань при отриманні файлів або відновити значення символічних посилань при надсиланні файлів. Зіпсовані значення зроблять символічні посилання непридатними на диску, але уможливлять відновлення початкового вмісту символічних посилань.

source: The server-side rsync often enables this option without the client's knowledge, such as in an rsync daemon's configuration file or by an option given to the rrsync (restricted rsync) script. When specified on the client side, specify the option normally if it is the client side that has/needs the munged symlinks, or use B<-M--munge-links> to give the option to the server when it has/needs the munged symlinks. Note that on a local transfer, the client is the sender, so specifying the option directly unmunges symlinks while specifying it as a remote option munges symlinks.
uk: Rsync на боці сервера часто вмикає цей параметр без додаткового повідомлення для клієнта, подібно до використання параметра у файлі налаштувань фонової служби rsync або параметра, який передано у скрипті rrsync (обмеженого rsync). Якщо параметр вказано на боці клієнта, вказуйте його, якщо на клієнтському боці є/потрібні зіпсовані символічні посилання, або скористайтеся B<-M--munge-links>, щоб передати парметр на сервер, якщо той має/потребує зіпсованих символічних посилань. Зауважте, що при локальному копіюванні клієнт є відправником, тому задання параметра безпосередньо скасовує псування символічних посилань, а задання його, як віддаленого параметра, псує символічні посилання.

source: This option has no affect when sent to a daemon via B<--remote-option> because the daemon configures whether it wants munged symlinks via its "B<munge\ symlinks>" parameter.
uk: Цей параметр ні на що не вплине, якщо надіслати його до фонової служби за допомогою B<--remote-option>, оскільки фонову службу налаштовують на те, чи бажаними є зіпсовані посилання, за допомогою її параметра «B<munge\ symlinks>».

source: The symlink value is munged/unmunged once it is in the transfer, so any option that transforms symlinks into non-symlinks occurs prior to the munging/unmunging B<except> for B<--safe-links>, which is a choice that the receiver makes, so it bases its decision on the munged/unmunged value. This does mean that if a receiver has munging enabled, that using B<--safe-links> will cause all symlinks to be ignored (since they are all absolute).
uk: Значення символічного посилання буде зіпсовано/відновлено, щойно воно потрапить до передавання, тому будь-який параметр, який перетворює символічні посилання на щось, що не є символічним посиланням, має передувати псуванню/відновленню, B<окрім> параметра B<--safe-links>, значення якого є вибором отримувача, на якому буде засновано рішення щодо псування або відновлення. Це означає, що якщо для отримувача увімкнено псування, використання B<--safe-links> призведе до ігнорування усіх символічних посилань (оскільки усі вони будуть абсолютними).

source: The method that rsync uses to munge the symlinks is to prefix each one's value with the string "/rsyncd-munged/". This prevents the links from being used as long as the directory does not exist. When this option is enabled, rsync will refuse to run if that path is a directory or a symlink to a directory (though it only checks at startup). See also the "munge-symlinks" python script in the support directory of the source code for a way to munge/unmunge one or more symlinks in-place.
uk: Спосіб, у який rsync виконує псування символічних посилань, полягає у дописуванні до кожного значення префікса «/rsyncd-munged/». Це заважає використанню посилань, якщо каталогу не існує. Якщо цей параметр увімкнено, rsync відмовиться запускатися, якщо шлях є каталогом або символічним посиланням на каталог (хоча перевірка цього виконуватиметься лише під час запуску програми). Див. також скрипт мовою Python «munge-symlinks» у каталозі «support» початкового коду, щоб дізнатися більше про спосіб псування/відновлення одного або декількох посилань на місці.

source: This option causes the sending side to treat a symlink to a directory as though it were a real directory. This is useful if you don't want symlinks to non-directories to be affected, as they would be using B<--copy-links>.
uk: Позначення цього пункту призведе до того, що програма оброблятиме символічні посилання на каталоги на боці надсилання даних так, наче ці посилання є справжніми каталогами Це корисно, якщо вам потрібно, щоб символічні посилання на об'єкти, відмінні від каталогів, не було змінено так, як це було б зроблено унаслідок використання B<--copy-links>.

source: Without this option, if the sending side has replaced a directory with a symlink to a directory, the receiving side will delete anything that is in the way of the new symlink, including a directory hierarchy (as long as B<--force> or B<--delete> is in effect).
uk: Без цього параметра, якщо на боці надсилання каталог було замінено символічним посиланням на каталог, на боці отримання буде вилучено усе, що стоїть на заваді новому символічному посиланню, включно із ієрархією каталогів (якщо працюють B<--force> або B<--delete>).

source: See also B<--keep-dirlinks> for an analogous option for the receiving side.
uk: Див. також B<--keep-dirlinks> щодо аналогічного параметра на боці отримання.

source: B<--copy-dirlinks> applies to all symlinks to directories in the source. If you want to follow only a few specified symlinks, a trick you can use is to pass them as additional source args with a trailing slash, using B<--relative> to make the paths match up right. For example:
uk: B<--copy-dirlinks> застосовується до усіх символічних посилань на каталоги у джерелі. Якщо ви хочете, щоб програма переходила лише за декількома вказаними символічними посиланнями, ви можете передати їх, як додаткові аргументи джерела із кінцевим символом похилої риски, за допомогою параметра B<--relative>, щоб встановити належну відповідність шляхів. Приклад:

source: rsync -r --relative src/./ src/./follow-me/ dest/
uk: rsync -r --relative джерело/./ джерело/./перейди-за-мною/ призначення/

source: This works because rsync calls B<lstat>(2) on the source arg as given, and the trailing slash makes B<lstat>(2) follow the symlink, giving rise to a directory in the file-list which overrides the symlink found during the scan of "src/./".
uk: Це працює, бо rsync викликає B<lstat>(2) для аргументу джерела, як його задано, а кінцевий символ похилої риски наказує B<lstat>(2) перейти за символічним посиланням, піднімаючи каталог у списку файлів і перевизначаючи символічне посилання, яке буде виявлено під час сканування «джерело/./».

source: This option causes the receiving side to treat a symlink to a directory as though it were a real directory, but only if it matches a real directory from the sender. Without this option, the receiver's symlink would be deleted and replaced with a real directory.
uk: Позначення цього пункту призведе до того, що програма оброблятиме символічні посилання на каталоги на стороні отримання даних так, наче ці посилання є справжніми каталогами. Цей параметр працюватиме, лише якщо символічне посилання відповідає справжньому каталогу на стороні надсилання. Якщо параметр не буде використано, символічне посилання на стороні отримання даних буде вилучено і замінено справжнім каталогом.

source: For example, suppose you transfer a directory "foo" that contains a file "file", but "foo" is a symlink to directory "bar" on the receiver. Without B<--keep-dirlinks>, the receiver deletes symlink "foo", recreates it as a directory, and receives the file into the new directory. With B<--keep-dirlinks>, the receiver keeps the symlink and "file" ends up in "bar".
uk: Наприклад, припустімо, що ви передаєте каталог «щось», який містить файл «файл», але «щось» є символічним посиланням на каталог «десь» на боці отримувача. Без B<--keep-dirlinks> на боці отримувача буде вилучено символічне посилання «щось» і повторно створено його як каталог, а потім отримано файл до нового каталогу. З B<--keep-dirlinks> на боці отримувача символічне посилання буде збережено, а «файл» буде записано до «десь».

source: One note of caution: if you use B<--keep-dirlinks>, you must trust all the symlinks in the copy or enable the B<--munge-links> option on the receiving side! If it is possible for an untrusted user to create their own symlink to any real directory, the user could then (on a subsequent copy) replace the symlink with a real directory and affect the content of whatever directory the symlink references. For backup copies, you are better off using something like a bind mount instead of a symlink to modify your receiving hierarchy.
uk: Одне попередження: якщо ви користуєтеся B<--keep-dirlinks>, вам слід або довіритися усім символічним посиланням у копії, або увімкнути параметр B<--munge-links> на боці отримувача! Якщо недовірений користувач матиме змогу створювати власні символічні посилання на будь-який справжній каталог, цей користувач потім зможе (при наступному копіюванні) замінити символічне посилання справжнім каталогом і вплинути на вміст будь-якого каталогу, на який посилається символічне посилання. Для резервного копіювання вам краще не користуватися чимось подібним до пов'язувального монтування, замість символічного посилання, для внесення змін до вашої ієрархії отримання днаих.

source: See also B<--copy-dirlinks> for an analogous option for the sending side.
uk: Див. також B<--copy-dirlinks> щодо аналогічного параметра на боці надсилання.

source: This tells rsync to look for hard-linked files in the source and link together the corresponding files on the destination. Without this option, hard-linked files in the source are treated as though they were separate files.
uk: За допомогою цього пункту можна наказати rsync виявляти жорсткі посилання у джерелі і створювати відповідні жорсткі посилання на боці призначення. Якщо цей пункт не буде позначено, обробка жорстко пов'язаних файлів джерела відбуватиметься так, наче ці файли є окремими файлами.

source: This option does NOT necessarily ensure that the pattern of hard links on the destination exactly matches that on the source. Cases in which the destination may end up with extra hard links include the following:
uk: Цей параметр НЕ обов'язково забезпечує точну відповідність взірця жорстких посилань у призначенні жорстким посиланням у джерелі. Випадки, у яких у призначенні можуть з'явитися зайві жорсткі посилання:
