Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: These statistics can be misleading if rsync's delta-transfer algorithm is in use. For example, if the sender's file consists of the basis file followed by additional data, the reported rate will probably drop dramatically when the receiver gets to the literal data, and the transfer will probably take much longer to finish than the receiver estimated as it was finishing the matched part of the file.
uk: Ці статистичні дані можуть бути оманливими, якщо використано алгоритм дельта-передавання rsync. Наприклад, якщо файл відправника складається з базового файла із додатковими даними, повідомлена програмою швидкість, ймовірно, значно впаде, коли отримувач отримає буквальні дані, а передавання, ймовірно, триватиме набагато довше, чим оцінка отримувача, оскільки оцінка враховує лише завершення відповідної частини файла.

source: When the file transfer finishes, rsync replaces the progress line with a summary line that looks like this:
uk: Коли завершується передавання файлів, rsync замінює рядок поступу рядком резюме, який виглядає ось так:

source: In this example, the file was 1,238,099 bytes long in total, the average rate of transfer for the whole file was 146.38 kilobytes per second over the 8 seconds that it took to complete, it was the 5th transfer of a regular file during the current rsync session, and there are 169 more files for the receiver to check (to see if they are up-to-date or not) remaining out of the 396 total files in the file-list.
uk: У цьому прикладі файл має загальний розмір 1238099 байтів, середня швидкість передавання файла склала 146,38 кілобайтів за секунду, передавання тривало 8 секунд, це було 5-е передавання звичайного файла під час поточного сеансу rsync, і лишилося ще 169 файлів, які отримувач має перевірити (щоб дізнатися, чи є вони актуальними), із загального списку у 396 файлів.

source: In an incremental recursion scan, rsync won't know the total number of files in the file-list until it reaches the ends of the scan, but since it starts to transfer files during the scan, it will display a line with the text "ir-chk" (for incremental recursion check) instead of "to-chk" until the point that it knows the full size of the list, at which point it will switch to using "to-chk". Thus, seeing "ir-chk" lets you know that the total count of files in the file list is still going to increase (and each time it does, the count of files left to check will increase by the number of the files added to the list).
uk: Під час нарощувального сканування загальна кількість файлів у файловому списку буде невідомою rsync, аж доки програма не завершить сканування, але оскільки вона починає передавання файлів під час сканування, буде показано рядок з текстом «ir-chk» (нарощувальна рекурсивна перевірка), замість «to-chk», аж до моменту, коли програмі стане відомим загальний розмір списку і програма зможе перемкнутися на використання «to-chk». Отже, якщо ви бачите «ir-chk», це означає, що загальна кількість файлів у списку ще зростатиме (і кожного разу, коли таке траплятиметься, зростатиме і кількість файлів, які слід буде перевірити на кількість файлів, які додано до списку).

source: The B<-P> option is equivalent to "B<--partial> B<--progress>". Its purpose is to make it much easier to specify these two options for a long transfer that may be interrupted.
uk: Параметр B<-P> є тотожним до «B<--partial> B<--progress>». Його призначенням значне спрощення визначення двох цих параметрів для довгих передавань, які може бути перервано.

source: There is also a B<--info=progress2> option that outputs statistics based on the whole transfer, rather than individual files. Use this flag without outputting a filename (e.g. avoid B<-v> or specify B<--info=name0>) if you want to see how the transfer is doing without scrolling the screen with a lot of names. (You don't need to specify the B<--progress> option in order to use B<--info=progress2>.)
uk: Також передбачено параметр B<--info=progress2>, використання якого призводить до виведення статистичних даних на основі усього передавання даних, а не передавання окремих файлів. Скористайтеся цим прапорцем без виведення назв файлів (наприклад, уникайте B<-v> або вкажіть B<--info=name0>), якщо вам потрібно бачити дані щодо поступу передавання без гортання екрана через велику кількість назв. (Вам не потрібно вказувати параметр B<--progress>, щоб скористатися B<--info=progress2>.)

source: Finally, you can get an instant progress report by sending rsync a signal of either SIGINFO or SIGVTALRM. On BSD systems, a SIGINFO is generated by typing a Ctrl+T (Linux doesn't currently support a SIGINFO signal). When the client-side process receives one of those signals, it sets a flag to output a single progress report which is output when the current file transfer finishes (so it may take a little time if a big file is being handled when the signal arrives). A filename is output (if needed) followed by the B<--info=progress2> format of progress info. If you don't know which of the 3 rsync processes is the client process, it's OK to signal all of them (since the non-client processes ignore the signal).
uk: Нарешті, ви можете отримати миттєвий звіт щодо поступу надсиланням rsync сигналу SIGINFO або SIGVTALRM. У системах BSD SIGINFO можна створити натисканням комбінації клавіш Ctrl+T (у поточній версії Linux не передбачено підтримки сигналу SIGINFO). Коли процес на боці клієнта отримує один з цих сигналів, він встановлює прапорець для виведення єдиного звіту щодо поступу, який буде виведено по завершенню передавання поточного файла (тому можлива невеличка затримка, якщо під час надсилання сигналу буде виконуватися передавання великого файла). Буде виведено назву файла (якщо потрібно) із наступним форматом B<--info=progress2> даних щодо поступу. Якщо ви не знаєте, який з 3 процесів rsync є клієнтським, можна надіслати сигнал усім процесам (оскільки неклієнтські процес ігнорують сигнал).

source: CAUTION: sending SIGVTALRM to an older rsync (pre-3.2.0) will kill it.
uk: ПОПЕРЕДЖЕННЯ: надсилання SIGVTALRM до застарілого rsync (до 3.2.0) призведе до завершення роботи rsync.

source: B<--password-file=FILE>
uk: B<--password-file=ФАЙЛ>

source: This option allows you to provide a password for accessing an rsync daemon via a file or via standard input if B<FILE> is B<->. The file should contain just the password on the first line (all other lines are ignored). Rsync will exit with an error if B<FILE> is world readable or if a root-run rsync command finds a non-root-owned file.
uk: За допомогою цього параметра ви можете вказати пароль для доступу до фонової служби rsync, скориставшись файлом або стандартним джерелом вхідних даних, якщо замість аргументу B<ФАЙЛ> вказано B<->. Файл має містити лише пароль у першому рядку (усі інші рядки буде проігноровано). Rsync завершить роботу повідомленням про помилку, якщо B<ФАЙЛ> буде придатним до читання від імені довільного користувача, або якщо запущена від імені root програма rsync виявить файл, власником якого не є користувач root.

source: This option does not supply a password to a remote shell transport such as ssh; to learn how to do that, consult the remote shell's documentation. When accessing an rsync daemon using a remote shell as the transport, this option only comes into effect after the remote shell finishes its authentication (i.e. if you have also specified a password in the daemon's config file).
uk: Цей параметр не надсилає пароль до обробника даних віддаленої оболонки, зокрема ssh. Щоб дізнатися, як виконати таку дію, зверніться до документації з віддаленої оболонки. При доступу до фонової служби rsync за допомогою віддаленої оболонки як засобу передавання даних, цей параметр спрацює, лише після завершення процедури розпізнавання у віддаленій оболонці (тобто, якщо ви також вкажете пароль у файлі налаштувань фонової служби).

source: B<--early-input=FILE>
uk: B<--early-input=ФАЙЛ>

source: This option allows rsync to send up to 5K of data to the "early exec" script on its stdin. One possible use of this data is to give the script a secret that can be used to mount an encrypted filesystem (which you should unmount in the the "post-xfer exec" script).
uk: За допомогою цього параметра можна дозволити rsync надсилати до 5 кілобайтів даних до скрипту «early exec» до його стандартного джерела вхідних даних. Одним із можливих використань цих даних є передавання скрипту реєстраційних даних, якими можна скористатися для монтування шифрованої файлової системи (яку слід демонтувати у скрипті «post-xfer exec»).

source: The daemon must be at least version 3.2.1.
uk: Версією фонової служби має бути принаймні 3.2.1.

source: This option will cause the source files to be listed instead of transferred. This option is inferred if there is a single source arg and no destination specified, so its main uses are:
uk: Використання цього параметра призведе до виведення списку файлів джерела, замість передавання цих файлів. Цей параметр буде використано неявним чином, якщо вказано одинарний аргумент джерела і жодного призначення, тому його основним призначенням є таке:

source: to turn a copy command that includes a destination arg into a file-listing command, or
uk: перетворення команди копіювання, до якої включено аргумент призначення, на команду виведення списку файлів або

source: to be able to specify more than one source arg. Note: be sure to include the destination.
uk: уможливлення визначення декількох аргументів джерел. Зауваження: не забудьте включити до команди призначення.

source: CAUTION: keep in mind that a source arg with a wild-card is expanded by the shell into multiple args, so it is never safe to try to list such an arg without using this option. For example:
uk: ПОПЕРЕДЖЕННЯ: пам'ятайте, що аргумент джерела із символами-замінниками буде розгорнуто командною оболонкою у декілька аргументів, тому ніколи не буде безпечною спроба використати аргумент-список без використання цього параметра. Приклад:

source: rsync -av --list-only foo* dest/
uk: rsync -av --list-only щось* призначення/

source: Starting with rsync 3.1.0, the sizes output by B<--list-only> are affected by the B<--human-readable> option. By default they will contain digit separators, but higher levels of readability will output the sizes with unit suffixes. Note also that the column width for the size output has increased from 11 to 14 characters for all human-readable levels. Use B<--no-h> if you want just digits in the sizes, and the old column width of 11 characters.
uk: Починаючи з версії rsync 3.1.0, на виведення розмірів параметром B<--list-only> впливає параметр B<--human-readable>. Типово, у значеннях розмірів містяться десяткові розділювачі, але за вищих рівнів зручності читання, програма починає виводити розміри із суфіксами одиниць. Зауважте, що ширину стовпчика для виведення розміру для усіх зручних для читання рівнів збільшено з 11 до 14 символів. Скористайтеся параметром B<--no-h>, якщо вам потрібні лише цифри у розмірах і стара ширина стовпчика у 11 символів.

source: Compatibility note: when requesting a remote listing of files from an rsync that is version 2.6.3 or older, you may encounter an error if you ask for a non-recursive listing. This is because a file listing implies the B<--dirs> option w/o B<--recursive>, and older rsyncs don't have that option. To avoid this problem, either specify the B<--no-dirs> option (if you don't need to expand a directory's content), or turn on recursion and exclude the content of subdirectories: B<-r\ --exclude='/*/*'>.
uk: Зауваження щодо сумісності: при надсиланні запиту щодо списку файлів на віддаленому боці з'єднання до rsync версії 2.6.3 або давнішої у вас можуть виникнути проблеми, якщо побудова списку буде нерекурсивною. Причиною є те, що під час побудови списку файлів неявним чином встановлюється параметр B<--dirs> без параметра B<--recursive>, а у старіших версіях rsync цього параметра немає. Щоб уникнути цієї проблеми або вкажіть параметр B<--no-dirs> (якщо вам не потрібне розгортання вмісту каталогів), або увімкніть рекурсію і виключіть вміст підкаталогів: B<-r\ --exclude='/*/*'>.

source: B<--bwlimit=RATE>
uk: B<--bwlimit=ШВИДКІСТЬ>

source: This option allows you to specify the maximum transfer rate for the data sent over the socket, specified in units per second. The RATE value can be suffixed with a string to indicate a size multiplier, and may be a fractional value (e.g. B<--bwlimit=1.5m>). If no suffix is specified, the value will be assumed to be in units of 1024 bytes (as if "K" or "KiB" had been appended). See the B<--max-size> option for a description of all the available suffixes. A value of 0 specifies no limit.
uk: За допомогою цього параметра ви можете вказати максимальну швидкість надсилання даних крізь сокет, вказавши її в одиницях за секунду. До значення ШВИДКІСТЬ можна дописати суфікс — рядок, який вказуватиме на множник розміру, можна також вказати дробове значення (приклад: B<--bwlimit=1.5m>). Якщо суфікс не вказано, програма припускатиме, що одиницями є блоки по 1024 байтів (так, наче вказано суфікс «K» або «KiB»). Див. параметр B<--max-size>, щоб ознайомитися із описом усіх доступних суфіксів. Значення 0 знімає обмеження на швидкість.

source: For backward-compatibility reasons, the rate limit will be rounded to the nearest KiB unit, so no rate smaller than 1024 bytes per second is possible.
uk: З міркувань зворотної сумісності обмеження на швидкість буде округлено до найближчої одиниці КіБ, тому використання швидкостей, менших за 1024 байтів за секунду, неможливе.

source: Rsync writes data over the socket in blocks, and this option both limits the size of the blocks that rsync writes, and tries to keep the average transfer rate at the requested limit. Some burstiness may be seen where rsync writes out a block of data and then sleeps to bring the average rate into compliance.
uk: Rsync записує дані крізь сокет блоками, а цей параметр одночасно обмежує розмір блоків, які записує rsync, і намагається зберегти середню швидкість передавання на вказаному рівні. Під час передавання може бути створено розриви, коли rsync записує великий блок даних, а потім бездіяльно очікує, щоб зберегти середню швидкість.

source: Due to the internal buffering of data, the B<--progress> option may not be an accurate reflection on how fast the data is being sent. This is because some files can show up as being rapidly sent when the data is quickly buffered, while other can show up as very slow when the flushing of the output buffer occurs. This may be fixed in a future version.
uk: Через внутрішню буферизацію даних параметр B<--progress> може бути неточним відтворенням того, наскільки швидко надсилатимуться дані. Причиною цього є те, що програма може показувати, що якісь дані миттєво надіслано, коли дані просто швидко буферизуються, а швидкість надсилання інших даних може бути показана як дуже низька, коли програма намагається спорожнити буфер виведення. Можливо, цю проблему буде розв'язано у майбутніх версіях.

source: See also the daemon version of the B<--bwlimit> option.
uk: Див. також версію для фонової служби параметра B<--bwlimit>.

source: B<--stop-after=MINS>, (B<--time-limit=MINS>)
uk: B<--stop-after=ХВИЛИНИ>, (B<--time-limit=ХВИЛИНИ>)

source: This option tells rsync to stop copying when the specified number of minutes has elapsed.
uk: Використання цього параметра наказує rsync припинити копіювання, якщо процедура триватиме вказану кількість хвилин.

source: For maximal flexibility, rsync does not communicate this option to the remote rsync since it is usually enough that one side of the connection quits as specified. This allows the option's use even when only one side of the connection supports it. You can tell the remote side about the time limit using B<--remote-option> (B<-M>), should the need arise.
uk: Заради максимальної гнучкості, rsync не передає цей параметр до віддаленого rsync, оскільки, зазвичай, для завершення процедури достатньо розірвання з'єднання з одного боку. Таким чином, параметром можна скористатися, навіть якщо його підтримку передбачено лише на одному боці з'єднання. Ви можете повідомити віддаленому кінцю з'єднання про обмеження часу за допомогою параметра B<--remote-option> (B<-M>), якщо у цьому виникне потреба.

source: The B<--time-limit> version of this option is deprecated.
uk: Версія B<--time-limit> цього параметра є застарілою.

source: This option tells rsync to stop copying when the specified point in time has been reached. The date & time can be fully specified in a numeric format of year-month-dayThour:minute (e.g. 2000-12-31T23:59) in the local timezone. You may choose to separate the date numbers using slashes instead of dashes.
uk: Використання цього параметра наказує rsync зупинити копіювання, коли буде досягнуто вказану часову позначку. Дату і час можна повністю вказати у числовому форматі рік-місяць-деньTгодина:хвилина (наприклад 2000-12-31T23:59) у місцевому часовому поясі. Ви можете наказати програмі відокремлювати числа у даті за допомогою символів похилої риски, замість дефісів.

source: The value can also be abbreviated in a variety of ways, such as specifying a 2-digit year and/or leaving off various values. In all cases, the value will be taken to be the next possible point in time where the supplied information matches. If the value specifies the current time or a past time, rsync exits with an error.
uk: Значення може бути скорочено у декілька способів, зокрема визначенням 2-цифрового року і/або пропусканням різних значень. Що б там не було, значенням буде наступна можлива часова позначка, якій відповідають надані дані. Якщо значення вказує поточний час або момент часу у минулому, rsync завершить роботу повідомленням про помилку.

source: For example, "1-30" specifies the next January 30th (at midnight local time), "14:00" specifies the next 2 P.M., "1" specifies the next 1st of the month at midnight, "31" specifies the next month where we can stop on its 31st day, and ":59" specifies the next 59th minute after the hour.
uk: Наприклад, «1-30» вказує на наступне 30 січня (опівночі на місцевим часом), «14:00» вказує на наступну другу годину дня, «1» задає наступне 1-е число місяця опівночі, «31» задає наступний місяць, де є 31-й день, а «:59» задає наступну 59-у хвилину за годину.

source: For maximal flexibility, rsync does not communicate this option to the remote rsync since it is usually enough that one side of the connection quits as specified. This allows the option's use even when only one side of the connection supports it. You can tell the remote side about the time limit using B<--remote-option> (B<-M>), should the need arise. Do keep in mind that the remote host may have a different default timezone than your local host.
uk: Заради максимальної гнучкості, rsync не передає цей параметр до віддаленого rsync, оскільки, зазвичай, для завершення процедури достатньо розірвання з'єднання з одного боку. Таким чином, параметром можна скористатися, навіть якщо його підтримку передбачено лише на одному боці з'єднання. Ви можете повідомити віддаленому кінцю з'єднання про обмеження часу за допомогою параметра B<--remote-option> (B<-M>), якщо у цьому виникне потреба. Пам'ятайте, що на віддаленому вузлі може бути встановлено інший типовий часовий пояс, ніж на локальному вузлі.

source: Cause the receiving side to fsync each finished file. This may slow down the transfer, but can help to provide peace of mind when updating critical files.
uk: Наказує виконати fsync на боці отримання для кожного файла, передавання якого буде завершено. Це може уповільнити передавання, але може допомогти убезпечити оновлення критичних файлів.

source: B<--write-batch=FILE>
uk: B<--write-batch=ФАЙЛ>

source: Record a file that can later be applied to another identical destination with B<--read-batch>. See the "BATCH MODE" section for details, and also the B<--only-write-batch> option.
uk: Записати файл, який можна буде згодом застосувати для іншого ідентичного призначення за допомогою B<--read-batch>. Див. розділ «ПАКЕТНИЙ РЕЖИМ», щоб дізнатися більше, а також параметр B<--only-write-batch>.

source: This option overrides the negotiated checksum & compress lists and always negotiates a choice based on old-school md5/md4/zlib choices. If you want a more modern choice, use the B<--checksum-choice> (B<--cc>) and/or B<--compress-choice> (B<--zc>) options.
uk: Цей параметр перевизначає узгоджені контрольні суми і списки стискання, а також узгоджує вибір на основі давніх варіантів md5, md4, zlib. Якщо ви хочете сучасніших варіантів, скористайтеся параметрами B<--checksum-choice> (B<--cc>) і/або B<--compress-choice> (B<--zc>).

source: B<--only-write-batch=FILE>
uk: B<--only-write-batch=ФАЙЛ>

source: Works like B<--write-batch>, except that no updates are made on the destination system when creating the batch. This lets you transport the changes to the destination system via some other means and then apply the changes via B<--read-batch>.
uk: Працює як B<--write-batch>, але без виконання оновлень у системі призначення при створенні пакетного файла. Це надає вам змогу передавати зміни до системи призначення в інші способи, а потім застосувати зміни за допомогою B<--read-batch>.

source: Note that you can feel free to write the batch directly to some portable media: if this media fills to capacity before the end of the transfer, you can just apply that partial transfer to the destination and repeat the whole process to get the rest of the changes (as long as you don't mind a partially updated destination system while the multi-update cycle is happening).
uk: Зауважте, що ви можете записувати пакетні файли безпосередньо на деякі портативні носії даних: якщо цей носій буде заповнено до максимальної місткості до завершення передавання даних, ви можете просто застосувати часткове передавання на призначення і повторити усю процедуру, щоб отримати решту змін (якщо ви не проти часткового оновлення системи призначення під час циклу із багатьма оновленнями).

source: Also note that you only save bandwidth when pushing changes to a remote system because this allows the batched data to be diverted from the sender into the batch file without having to flow over the wire to the receiver (when pulling, the sender is remote, and thus can't write the batch).
uk: Також зауважте, що ви лише заощадите потужності каналу передавання даних при записі змін до віддаленої системи, оскільки це надасть змогу відхилити пакетні дані з боку відправника до пакетного файла без переповнення каналу до отримувача (при отриманні даних відправник є віддаленим боком, і отже, не може записувати пакетні дані).

source: B<--read-batch=FILE>
uk: B<--read-batch=ФАЙЛ>

source: Apply all of the changes stored in FILE, a file previously generated by B<--write-batch>. If I<FILE> is B<->, the batch data will be read from standard input. See the "BATCH MODE" section for details.
uk: Застосувати усі зміни, які зберігаються у ФАЙЛІ, файлі, який раніше було створено B<--write-batch>. Якщо значенням I<ФАЙЛ> є B<->, пакетні дані буде прочитано зі стандартного джерела вхідних даних. Див. розділ «ПАКЕТНИЙ РЕЖИМ», щоб дізнатися більше.

source: B<--protocol=NUM>
uk: B<--protocol=ЧИСЛО>
