Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: --verbose, -v increase verbosity --info=FLAGS fine-grained informational verbosity --debug=FLAGS fine-grained debug verbosity --stderr=e|a|c change stderr output mode (default: errors) --quiet, -q suppress non-error messages --no-motd suppress daemon-mode MOTD --checksum, -c skip based on checksum, not mod-time & size --archive, -a archive mode is -rlptgoD (no -A,-X,-U,-N,-H) --no-OPTION turn off an implied OPTION (e.g. --no-D) --recursive, -r recurse into directories --relative, -R use relative path names --no-implied-dirs don't send implied dirs with --relative --backup, -b make backups (see --suffix & --backup-dir) --backup-dir=DIR make backups into hierarchy based in DIR --suffix=SUFFIX backup suffix (default ~ w/o --backup-dir) --update, -u skip files that are newer on the receiver --inplace update destination files in-place --append append data onto shorter files --append-verify --append w/old data in file checksum --dirs, -d transfer directories without recursing --old-dirs, --old-d works like --dirs when talking to old rsync --mkpath create the destination's path component --links, -l copy symlinks as symlinks --copy-links, -L transform symlink into referent file/dir --copy-unsafe-links only "unsafe" symlinks are transformed --safe-links ignore symlinks that point outside the tree --munge-links munge symlinks to make them safe & unusable --copy-dirlinks, -k transform symlink to dir into referent dir --keep-dirlinks, -K treat symlinked dir on receiver as dir --hard-links, -H preserve hard links --perms, -p preserve permissions --executability, -E preserve executability --chmod=CHMOD affect file and/or directory permissions --acls, -A preserve ACLs (implies --perms) --xattrs, -X preserve extended attributes --owner, -o preserve owner (super-user only) --group, -g preserve group --devices preserve device files (super-user only) --copy-devices copy device contents as a regular file --write-devices write to devices as files (implies --inplace) --specials preserve special files -D same as --devices --specials --times, -t preserve modification times --atimes, -U preserve access (use) times --open-noatime avoid changing the atime on opened files --crtimes, -N preserve create times (newness) --omit-dir-times, -O omit directories from --times --omit-link-times, -J omit symlinks from --times --super receiver attempts super-user activities --fake-super store/recover privileged attrs using xattrs --sparse, -S turn sequences of nulls into sparse blocks --preallocate allocate dest files before writing them --dry-run, -n perform a trial run with no changes made --whole-file, -W copy files whole (w/o delta-xfer algorithm) --checksum-choice=STR choose the checksum algorithm (aka --cc) --one-file-system, -x don't cross filesystem boundaries --block-size=SIZE, -B force a fixed checksum block-size --rsh=COMMAND, -e specify the remote shell to use --rsync-path=PROGRAM specify the rsync to run on remote machine --existing skip creating new files on receiver --ignore-existing skip updating files that exist on receiver --remove-source-files sender removes synchronized files (non-dir) --del an alias for --delete-during --delete delete extraneous files from dest dirs --delete-before receiver deletes before xfer, not during --delete-during receiver deletes during the transfer --delete-delay find deletions during, delete after --delete-after receiver deletes after transfer, not during --delete-excluded also delete excluded files from dest dirs --ignore-missing-args ignore missing source args without error --delete-missing-args delete missing source args from destination --ignore-errors delete even if there are I/O errors --force force deletion of dirs even if not empty --max-delete=NUM don't delete more than NUM files --max-size=SIZE don't transfer any file larger than SIZE --min-size=SIZE don't transfer any file smaller than SIZE --max-alloc=SIZE change a limit relating to memory alloc --partial keep partially transferred files --partial-dir=DIR put a partially transferred file into DIR --delay-updates put all updated files into place at end --prune-empty-dirs, -m prune empty directory chains from file-list --numeric-ids don't map uid/gid values by user/group name --usermap=STRING custom username mapping --groupmap=STRING custom groupname mapping --chown=USER:GROUP simple username/groupname mapping --timeout=SECONDS set I/O timeout in seconds --contimeout=SECONDS set daemon connection timeout in seconds --ignore-times, -I don't skip files that match size and time --size-only skip files that match in size --modify-window=NUM, -@ set the accuracy for mod-time comparisons --temp-dir=DIR, -T create temporary files in directory DIR --fuzzy, -y find similar file for basis if no dest file --compare-dest=DIR also compare destination files relative to DIR --copy-dest=DIR ... and include copies of unchanged files --link-dest=DIR hardlink to files in DIR when unchanged --compress, -z compress file data during the transfer --compress-choice=STR choose the compression algorithm (aka --zc) --compress-level=NUM explicitly set compression level (aka --zl) --skip-compress=LIST skip compressing files with suffix in LIST --cvs-exclude, -C auto-ignore files in the same way CVS does --filter=RULE, -f add a file-filtering RULE -F same as --filter='dir-merge /.rsync-filter' repeated: --filter='- .rsync-filter' --exclude=PATTERN exclude files matching PATTERN --exclude-from=FILE read exclude patterns from FILE --include=PATTERN don't exclude files matching PATTERN --include-from=FILE read include patterns from FILE --files-from=FILE read list of source-file names from FILE --from0, -0 all *-from/filter files are delimited by 0s --old-args disable the modern arg-protection idiom --protect-args, -s no space-splitting; wildcard chars only --copy-as=USER[:GROUP] specify user & optional group for the copy --address=ADDRESS bind address for outgoing socket to daemon --port=PORT specify double-colon alternate port number --sockopts=OPTIONS specify custom TCP options --blocking-io use blocking I/O for the remote shell --outbuf=N|L|B set out buffering to None, Line, or Block --stats give some file-transfer stats --8-bit-output, -8 leave high-bit chars unescaped in output --human-readable, -h output numbers in a human-readable format --progress show progress during transfer -P same as --partial --progress --itemize-changes, -i output a change-summary for all updates --remote-option=OPT, -M send OPTION to the remote side only --out-format=FORMAT output updates using the specified FORMAT --log-file=FILE log what we're doing to the specified FILE --log-file-format=FMT log updates using the specified FMT --password-file=FILE read daemon-access password from FILE --early-input=FILE use FILE for daemon's early exec input --list-only list the files instead of copying them --bwlimit=RATE limit socket I/O bandwidth --stop-after=MINS Stop rsync after MINS minutes have elapsed --stop-at=y-m-dTh:m Stop rsync at the specified point in time --fsync fsync every written file --write-batch=FILE write a batched update to FILE --only-write-batch=FILE like --write-batch but w/o updating dest --read-batch=FILE read a batched update from FILE --protocol=NUM force an older protocol version to be used --iconv=CONVERT_SPEC request charset conversion of filenames --checksum-seed=NUM set block/file checksum seed (advanced) --ipv4, -4 prefer IPv4 --ipv6, -6 prefer IPv6 --version, -V print the version + other info and exit --help, -h (*) show this help (* -h is help only on its own)
uk: --verbose, -v збільшити докладність --info=ПРАПОРЦІ точне керування докладністю відомостей --debug=ПРАПОРЦІ точне керування докладністю діагностики --stderr=e|a|c змінити режим виведення stderr (типовий рівень: errors, помилки) --quiet, -q придушити повідомлення, які не є помилками --no-motd придушити MOTD режиму фонової служби --checksum, -c пропускати на основі контрольної суми, а не часу змін та розміру --archive, -a режим архівування -rlptgoD (не -A,-X,-U,-N,-H) --no-ПАРАМЕТР вимкнути ПАРАМЕТР (наприклад, --no-D) --recursive, -r рекурсивно обробляти каталоги --relative, -R використовувати відносні шляхи --no-implied-dirs не надсилати неявні каталоги з --relative --backup, -b створювати резервні копії (див. --suffix і --backup-dir) --backup-dir=КАТАЛОГ створювати резервні копії до ієрархії на основі КАТАЛОГУ --suffix=СУФІКС суфікс резервних копій (типово ~ без --backup-dir) --update, -u пропускати файли, які є новішими на боці отримувача --inplace оновити файли призначення на місці --append дописати дані до коротших файлів --append-verify --append зі старими даними у контрольній сумі файла --dirs, -d передавати каталоги без рекурсії --old-dirs, --old-d працює як --dirs при роботі зі старим rsync --mkpath створити компонент шляху призначення --links, -l копіювати символічні посилання як символічні посилання --copy-links, -L перетворити символічні посилання на відповідні файли/каталоги --copy-unsafe-links перетворювати лише «небезпечні» символічні посилання --safe-links ігнорувати символічні посилання, які вказують на об'єкти поза ієрархією --munge-links псувати символічні посилання, щоб зробити їх безпечними і непридатними --copy-dirlinks, -k перетворювати символічні посилання на каталог на відповідний каталог --keep-dirlinks, -K вважати символічне посилання на каталог на боці отримувача каталогом --hard-links, -H зберігати жорсткі посилання --perms, -p зберігати права доступу --executability, -E зберігати права на виконання --chmod=РЕЖИМ змінювати права доступу на файл і/або каталог на вказані --acls, -A зберігати ACL (неявно встановлює --perms) --xattrs, -X зберігати розширені атрибути --owner, -o зберігати власника (лише для надкористувача) --group, -g зберігати групу --devices зберігати файли пристроїв (лише для надкористувача) --copy-devices копіювати вміст пристрою як звичайний файл --write-devices записувати на пристрої, як у файли (неявно встановлює --inplace) --specials зберігати спеціальні файли -D те саме, що і --devices --specials --times, -t зберігати час внесення змін --atimes, -U зберігати час доступу (використання) --open-noatime уникати зміни atime для відкрити файлів --crtimes, -N зберігати час створення (новизну) --omit-dir-times, -O пропустити directories from --times --omit-link-times, -J пропустити symlinks from --times --super отримувач намагається виконати дії надкористувача --fake-super зберігати/відновлювати привілейовані атрибути за допомогою xattrs --sparse, -S перетворити послідовності нулів на розріджені блоки --preallocate отримувати пам'ять для файлів призначення до запису їх --dry-run, -n виконати тестовий запуск без внесення змін --whole-file, -W копіювати файли цілком (без алгоритму delta-xfer) --checksum-choice=РЯДОК вибрати алгоритм контрольної суми (альтернатива --cc) --one-file-system, -x не виходити за межі файлової системи --block-size=РОЗМІР, -B примусово використати фіксований розмір блоку контрольної суми --rsh=КОМАНДА, -e вказати віддалену оболонку, якою слід скористатися --rsync-path=ПРОГРАМА вказати rsync програму для запуску на віддаленому комп'ютері --existing пропустити створення файлів на боці отримувача --ignore-existing пропустити оновлення файлів, які існують на боці отримувача --remove-source-files відправник вилучає синхронізовані файли (не каталоги) --del альтернатива --delete-during --delete вилучити сторонні файли з каталогів призначення --delete-before отримувач вилучає до xfer, а не у процесі --delete-during отримувач вилучає під час перенесення --delete-delay знаходити об'єкти вилучення у процесі, вилучити після --delete-after отримувач вилучає дані після перенесення, а не у процесі --delete-excluded також вилучити виключені файли з каталогів призначення --ignore-missing-args ігнорувати пропущені аргументи джерела без помилки --delete-missing-args вилучити пропущені аргументи джерела з призначення --ignore-errors вилучити, навіть якщо стануться помилки введення-виведення --force примусове вилучення каталогів, навіть якщо вони не порожні --max-delete=ЧИСЛО не вилучати більше, ніж ЧИСЛО файлів --max-size=РОЗМІР не переносити файли, більші за РОЗМІР --min-size=РОЗМІР не переносити файли, менші за РОЗМІР --max-alloc=РОЗМІР змінити обмеження щодо отримання пам'яті --partial зберігати частково перенесені файли --partial-dir=КАТАЛОГ розміщувати частково перенесені файли до КАТАЛОГУ --delay-updates розміщувати усі оновлені файли на кінцевому місці --prune-empty-dirs, -m витирати порожні ланцюжки каталогів зі списку файлів --numeric-ids не пов'язувати значення uid/gid з назвами користувачів і груп --usermap=РЯДОК нетипова прив'язка до імені користувача --groupmap=РЯДОК нетипова прив'язка до назви групи --chown=КОРИСТУВАЧ:ГРУПА проста прив'язка до користувача і групи --timeout=СЕКУНДИ встановити час очікування на введення-виведення у секундах --contimeout=СЕКУНДИ встановити час очікування на з'єднання із фоновою службою --ignore-times, -I не пропускати файли, у яких збігаються розмір і час --size-only пропускати файли, для яких збігається розмір --modify-window=N, -@ встановити точність порівнянь часу внесення змін --temp-dir=КАТАЛОГ, -T створити тимчасові файли у каталозі КАТАЛОГ --fuzzy, -y знаходити подібні файли, якщо немає файла призначення --compare-dest=КАТАЛОГ також порівняти файли призначення відносно КАТАЛОГУ --copy-dest=КАТАЛОГ ... і включити копії незмінених файлів --link-dest=КАТАЛОГ створювати жорсткі посилання на файли у КАТАЛОЗІ, якщо не змінено --compress, -z стискати дані файла під час перенесення --compress-choice=РЯДОК вибрати алгоритм стискання (альтернатива --zc) --compress-level=ЧИСЛО явно встановити рівень стискання (альтернатива --zl) --skip-compress=СПИСОК пропустити стиснуті файли із суфіксом зі СПИСКУ --cvs-exclude, -C автоматично ігнорувати файли у спосіб, який використано у CVS --filter=ПРАВИЛО, -f додати ПРАВИЛО фільтрування файлів -F те саме, що і --filter='dir-merge /.rsync-filter' повторно: --filter='- .rsync-filter' --exclude=ВЗІРЕЦЬ виключити файли, які відповідають ВЗІРЦЮ --exclude-from=ФАЙЛ прочитати взірці виключення з файла ФАЙЛ --include=ВЗІРЕЦЬ не виключати файли, які відповідають ВЗІРЦЮ --include-from=ФАЙЛ прочитати взірці включення з файла ФАЙЛ --files-from=ФАЙЛ прочитати список назв файлів джерела з файла ФАЙЛ --from0, -0 записи усіх файлів *-from/filter відокремлено 0-символами --old-args вимкнути сучасну ідіому захисту аргументів --protect-args, -s без поділу пробілами; лише символи-замінники --copy-as=КОРИСТУВАЧ[:ГРУПА] вказати користувача і необов'язкову групу для копії --address=АДРЕСА пов'язати адресу для вихідного сокета до фонової служби --port=ПОРТ вказати альтернативний номер порту через подвійну двокрапку --sockopts=ПАРАМЕТРИ вказати нетипові параметри TCP --blocking-io використати блокувальне введення-виведення для віддаленої оболонки --outbuf=N|L|B встановити буферизацію у None (немає), Line (рядок) або Block (блок) --stats надати деяку статистику передавання файлів --8-bit-output, -8 лишити символи з верхніми бітами без екранування у виведенні --human-readable, -h вивести числа у зручному для читання форматі --progress показувати поступ під час перенесення -P те саме, що і --partial --progress --itemize-changes, -i вивести резюме змін для усіх оновлень --remote-option=ПАР, -M надіслати параметр ПАР лише на віддалений бік --out-format=ФОРМАТ вивести оновлення з використанням вказаного ФОРМАТУ --log-file=ФАЙЛ записати журнал дій до вказаного ФАЙЛА --log-file-format=ФОРМАТ записати оновлення за допомогою вказаного ФОРМАТУ --password-file=ФАЙЛ прочитати пароль доступу до фонової служби з файла ФАЙЛ --early-input=ФАЙЛ використати ФАЙЛ для раннього введення виконання фонової служби --list-only вивести список файлів замість їхнього копіювання --bwlimit=ШВИДКІСТЬ обмежити ширину каналу введення-виведення сокетом --stop-after=ХВИЛИНИ зупинити rsync після роботи протягом вказаної кількості ХВИЛИН --stop-at=р-м-дTг:х зупинити rsync у вказаний момент часу --fsync fsync для кожного записаного файла --write-batch=ФАЙЛ записувати пакетне оновлення до ФАЙЛ --only-write-batch=ФАЙЛ подібне до --write-batch, але без оновлення призначення --read-batch=ФАЙЛ прочитати пакетне оновлення з ФАЙЛ --protocol=ЧИСЛО примусово використати стару версію протоколу --iconv=СПЕЦ_ПЕРЕТВ виконати перетворення наборів символів у назвах файлів --checksum-seed=ЧИСЛО встановити базу для контрольних сум блоків/файлів (додатково) --ipv4, -4 пріоритет IPv4 --ipv6, -6 пріоритет IPv6 --version, -V вивести дані щодо версії та іншого і завершити роботу --help, -h (*) показати цю довідку (* -h, лише якщо він є єдиним параметром)

source: Rsync can also be run as a daemon, in which case the following options are accepted:
uk: Rsync також можна запустити як фонову службу. У цьому випадку прийнятними є такі параметри:

source: --daemon run as an rsync daemon --address=ADDRESS bind to the specified address --bwlimit=RATE limit socket I/O bandwidth --config=FILE specify alternate rsyncd.conf file --dparam=OVERRIDE, -M override global daemon config parameter --no-detach do not detach from the parent --port=PORT listen on alternate port number --log-file=FILE override the "log file" setting --log-file-format=FMT override the "log format" setting --sockopts=OPTIONS specify custom TCP options --verbose, -v increase verbosity --ipv4, -4 prefer IPv4 --ipv6, -6 prefer IPv6 --help, -h show this help (when used with --daemon)
uk: --daemon запустити як фонову службу rsync --address=АДРЕСА прив'язатися до вказаної адреси --bwlimit=ШВИДКІСТЬ обмежити передавання сокетом --config=ФАЙЛ вказати альтернативний файл rsyncd.conf --dparam=ПЕРЕВИЗНАЧЕННЯ, -M перевизначити загальний параметр налаштування фонової служби --no-detach не від'єднуватися від батьківського процесу --port=ПОРТ очікувати на дані на порті з альтернативним номером --log-file=ФАЙЛ перевизначити параметр «файл журналу» --log-file-format=ФОРМАТ перевизначити параметр «формат журналу» --sockopts=ПАРАМЕТРИ вказати нетипові параметри TCP --verbose, -v збільшити докладність --ipv4, -4 пріоритет IPv4 --ipv6, -6 пріоритет IPv6 --help, -h показати цю довідку (при використанні з --daemon)

source: OPTIONS
uk: ПАРАМЕТРИ

source: Rsync accepts both long (double-dash + word) and short (single-dash + letter) options. The full list of the available options are described below. If an option can be specified in more than one way, the choices are comma-separated. Some options only have a long variant, not a short. If the option takes a parameter, the parameter is only listed after the long variant, even though it must also be specified for the short. When specifying a parameter, you can either use the form B<--option=param> or replace the '=' with whitespace. The parameter may need to be quoted in some manner for it to survive the shell's command-line parsing. Keep in mind that a leading tilde (B<~>) in a filename is substituted by your shell, so B<--option=~/foo> will not change the tilde into your home directory (remove the '=' for that).
uk: Rsync приймає і довгі (подвійний дефіс + слово) і короткі (одинарний дефіс + літера) параметри. Повний список доступних параметрів описано нижче. Якщо параметр можна вказати у декілька способів, варіанти відокремлено комами. У деяких параметрів є лише довгий варіант, але немає короткого. Якщо параметр приймає аргумент, аргумент вказано після довгого варіанта, хоча його можна також вказувати і після короткого. При визначенні параметра ви можете скористатися або формою B<--параметр=аргумент>, або замінити «=» пробілом. Аргумент може потребувати певного екранування, щоб його можна було правильно розібрати після обробки командного рядка оболонкою. Слід пам'ятати, що початкову тильду (B<~>) у назві файла буде замінено вашою командною оболонкою, отже, у B<--параметр=~/щось> тильду не буде замінено на адресу вашого домашнього каталогу (для цього слід прибрати «=»).

source: Print a short help page describing the options available in rsync and exit. You can also use B<-h> for B<--help> when it is used without any other options (since it normally means B<--human-readable>).
uk: Вивести коротку довідкову сторінку з описом параметрів, які доступні у rsync, і завершити роботу. Ви також можете скористатися B<-h> замість B<--help>, якщо параметр використано без інших параметрів (оскільки, зазвичай, він означає B<--human-readable>).

source: Print the rsync version plus other info and exit.
uk: Вивести дані щодо версії rsync та інші відомості і завершити роботу програми.

source: The output includes the default list of checksum algorithms, the default list of compression algorithms, a list of compiled-in capabilities, a link to the rsync web site, and some license/copyright info.
uk: Серед виведених даних буде типовий список алгоритмів обчислення контрольних сум, типовий список алгоритмів стискання, список зібраних можливостей, посилання на сайт rsync і деякі відомості щодо ліцензування та авторських прав.

source: This option increases the amount of information you are given during the transfer. By default, rsync works silently. A single B<-v> will give you information about what files are being transferred and a brief summary at the end. Two B<-v> options will give you information on what files are being skipped and slightly more information at the end. More than two B<-v> options should only be used if you are debugging rsync.
uk: Цей параметр збільшує обсяг відомостей, які буде надано під час передавання даних. Типово, rsync працює без повідомлень. Одинарне B<-v> надасть вам відомості щодо того, які файли передаються і коротке резюме наприкінці. Два параметри B<-v> нададуть вам відомості щодо того, які файли пропущено і трохи більше даних наприкінці. Більше, ніж два параметри B<-v>, слід використовувати, лише якщо ви виконуєте діагностику rsync.

source: The end-of-run summary tells you the number of bytes sent to the remote rsync (which is the receiving side on a local copy), the number of bytes received from the remote host, and the average bytes per second of the transferred data computed over the entire length of the rsync run. The second line shows the total size (in bytes), which is the sum of all the file sizes that rsync considered transferring. It also shows a "speedup" value, which is a ratio of the total file size divided by the sum of the sent and received bytes (which is really just a feel-good bigger-is-better number). Note that these byte values can be made more (or less) human-readable by using the B<--human-readable> (or B<--no-human-readable>) options.
uk: У кінцевому резюме програма повідомить вам про кількість надісланих байтів до віддаленого rsync (який є боком отримання при локальному копіюванні), кількість байтів, отриманих від віддаленого вузла і середню кількість байтів переданих даних за секунду, обчислену за увесь час роботи rsync. У другому рядку буде показано загальний розмір (у байтах) даних, який є сумою усіх розмірів файлів, які rsync розглядала для передавання. Також буде показано значення «пришвидшення», яким є відношення загального розміру файлів до суми надісланих і отриманих байтів (тобто просто числовою оцінкою «більше-краще»). Зауважте, що ці значення у байтах можна зробити зручнішими (або менш зручними) для читання за допомогою параметра B<--human-readable> (або B<--no-human-readable>).
