Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: If you specify "B<--chown=foo:bar>", this is exactly the same as specifying "B<--usermap=*:foo\ --groupmap=*:bar>", only easier (and with the same implied B<--owner> and/or B<--group> options).
uk: Якщо ви вкажете «B<--chown=щось:десь>», це буде точно те саме, що вказати «B<--usermap=*:щось\ --groupmap=*:десь>», але простіше (із тим самим неявним встановленням параметрів B<--owner> і/або B<--group>).

source: B<--timeout=SECONDS>
uk: B<--timeout=СЕКУНДИ>

source: This option allows you to set a maximum I/O timeout in seconds. If no data is transferred for the specified time then rsync will exit. The default is 0, which means no timeout.
uk: За допомогою цього параметра ви можете встановити максимальний час очікування на введення-виведення у секундах. Якщо протягом вказаного проміжку часу не відбуватиметься передавання даних, rsync завершить роботу. Типовим значенням є 0 — тобто, ніякого часу очікування.

source: B<--contimeout=SECONDS>
uk: B<--contimeout=СЕКУНДИ>

source: This option allows you to set the amount of time that rsync will wait for its connection to an rsync daemon to succeed. If the timeout is reached, rsync exits with an error.
uk: За допомогою цього параметра ви можете встановити час, протягом якого rsync очікуватиме на встановлення з'єднання із фоновою службою rsync. Якщо буде перевищено час очікування, rsync завершить роботу із повідомленням про помилку.

source: B<--address=ADDRESS>
uk: B<--address=АДРЕСА>

source: By default rsync will bind to the wildcard address when connecting to an rsync daemon. The B<--address> option allows you to specify a specific IP address (or hostname) to bind to.
uk: Типово, rsync виконуватиме прив'язку до адреси із символами-замінниками при з'єднанні із фоновою службою rsync. Параметр B<--address> надає вам змогу вказати певну IP-адресу (або назву вузла), до якої слід прив'язатися.

source: See also the daemon version of the B<--address> option.
uk: Див. також версію для фонової служби параметра B<--address>.

source: B<--port=PORT>
uk: B<--port=ПОРТ>

source: This specifies an alternate TCP port number to use rather than the default of 873. This is only needed if you are using the double-colon (::) syntax to connect with an rsync daemon (since the URL syntax has a way to specify the port as a part of the URL).
uk: Цей параметр визначає альтернативний номер порту TCP, яким слід скористатися замість типового порту 873. Цей параметр може знадобитися, лише якщо ви користуєтеся синтаксичною конструкцією із подвійною двокрапкою (::) для встановлення з'єднання із фоновою службою rsync (оскільки у синтаксичній конструкції із адресою можна вказати порт, як частину адреси).

source: See also the daemon version of the B<--port> option.
uk: Див. також версію для фонової служби параметра B<--port>.

source: B<--sockopts=OPTIONS>
uk: B<--sockopts=ПАРАМЕТРИ>

source: This option can provide endless fun for people who like to tune their systems to the utmost degree. You can set all sorts of socket options which may make transfers faster (or slower!). Read the manpage for the B<setsockopt()> system call for details on some of the options you may be able to set. By default no special socket options are set. This only affects direct socket connections to a remote rsync daemon.
uk: Цей параметр має відкрити нескінченні можливості для тих, хто намагається скоригувати роботу своєї системи так, щоб усе працювало ідеально. Ви можете встановити будь-які параметри сокета, які можуть зробити передавання даних швидшим (або повільнішим!). Ознайомтеся із сторінкою підручника щодо системного виклику B<setsockopt()>, щоб дізнатися більше про деякі параметри сокета, які ви можете встановити. Типово, ніяких особливих параметрів сокета програма не встановлює. Цей параметр впливає лише на безпосередні з'єднання сокетом із віддаленою фоновою службою rsync.

source: See also the daemon version of the B<--sockopts> option.
uk: Див. також версію для фонової служби параметра B<--sockopts>.

source: This tells rsync to use blocking I/O when launching a remote shell transport. If the remote shell is either rsh or remsh, rsync defaults to using blocking I/O, otherwise it defaults to using non-blocking I/O. (Note that ssh prefers non-blocking I/O.)
uk: Цей параметр наказує rsync скористатися введенням-виведенням із блокуванням при запуску передавання даних до віддаленої командної оболонки. Якщо віддаленою оболонкою є rsh або remsh, rsync типово використовуватиме введення-виведення із блокуванням. Якщо ж це не так, типово буде використано введення-виведення без блокування. (Зауважте, що пріоритетним у ssh є введення-виведення без блокування.)

source: B<--outbuf=MODE>
uk: B<--outbuf=РЕЖИМ>

source: This sets the output buffering mode. The mode can be None (aka Unbuffered), Line, or Block (aka Full). You may specify as little as a single letter for the mode, and use upper or lower case.
uk: Встановлює режим буферизації виведення. Значенням режиму може бути None (без буферизації або Unbuffered), Line або Block (або повна буферизація або Full). Ви можете вказати одну літеру для визначення режиму, у верхньому або нижньому регістрі.

source: The main use of this option is to change Full buffering to Line buffering when rsync's output is going to a file or pipe.
uk: Основним призначенням цього параметра є зміна повної буферизації на буферизацію рядків (Line), коли виведення rsync відбувається до файла або каналу передавання даних.

source: Requests a simple itemized list of the changes that are being made to each file, including attribute changes. This is exactly the same as specifying B<--out-format='%i\ %n%L'>. If you repeat the option, unchanged files will also be output, but only if the receiving rsync is at least version 2.6.7 (you can use B<-vv> with older versions of rsync, but that also turns on the output of other verbose messages).
uk: Надсилає запит щодо простого списку змін, які було внесено до кожного з файлів, включно зі зміною атрибутів. Це те саме, що вказати B<--out-format='%i\ %n%L'>. Якщо повторити параметр в одному рядку команди, буде також виведено список файлів, які не було змінено, але лише якщо версією rsync на боці отримувача є принаймні 2.6.7 (ви можете скористатися B<-vv> зі старішими версіями rsync, але це також увімкне виведення інших докладних повідомлень).

source: The "%i" escape has a cryptic output that is 11 letters long. The general format is like the string B<YXcstpoguax>, where B<Y> is replaced by the type of update being done, B<X> is replaced by the file-type, and the other letters represent attributes that may be output if they are being modified.
uk: Екранована послідовність «%i» дає не зовсім зрозумілий результат, який складається з 11 літер. Загальний формат подібний до рядка B<YXcstpoguax>, де B<Y> буде замінено на тип виконаного оновлення, B<X> буде замінено на тип файла, а інші літери відповідають атрибутам, які може бути виведено, якщо їх було змінено.

source: The update types that replace the B<Y> are as follows:
uk: Типи оновлень, які замінюють B<Y>, є такими:

source: A B<E<lt>> means that a file is being transferred to the remote host (sent).
uk: B<E<lt>> означає, що файл передається на віддалений вузол (надіслано).

source: A B<E<gt>> means that a file is being transferred to the local host (received).
uk: B<E<gt>> означає, що файл передається на локальний вузол (отримано).

source: A B<c> means that a local change/creation is occurring for the item (such as the creation of a directory or the changing of a symlink, etc.).
uk: B<c> означає, що із об'єктом відбулися локальні зміни/створення (зокрема створення каталогу або зміна символічного посилання тощо).

source: A B<h> means that the item is a hard link to another item (requires B<--hard-links>).
uk: B<h> означає, що об'єкт є жорстким посиланням на інших об'єкт (потребує B<--hard-links>).

source: A B<.> means that the item is not being updated (though it might have attributes that are being modified).
uk: B<.> означає, що об'єкт не було оновлено (хоча, можливо, його атрибути було змінено).

source: A B<*> means that the rest of the itemized-output area contains a message (e.g. "deleting").
uk: B<*> означає, що решта виведення у пункті є повідомленням (наприклад, «deleting» (вилучаємо)).

source: The file-types that replace the B<X> are: B<f> for a file, a B<d> for a directory, an B<L> for a symlink, a B<D> for a device, and a B<S> for a special file (e.g. named sockets and fifos).
uk: Типами файлів, які замінюють B<X>, є такі: B<f> — файл, B<d> — каталог, B<L> — символічне посилання, B<D> — пристрій і B<S> — особливий файл (наприклад іменований сокет або fifo).

source: The other letters in the string indicate if some attributes of the file have changed, as follows:
uk: Інші літери у рядку вказують на те, чи було змінено якість атрибути файла, ось так:

source: "B<.>" - the attribute is unchanged.
uk: «B<.>» — атрибут не було змінено.

source: "B<+>" - the file is newly created.
uk: «B<+>» — файл було створено наново.

source: "B<\ >" - all the attributes are unchanged (all dots turn to spaces).
uk: «B<\ >» — усі атрибути лишатимуться незмінними (усі крапки буде перетворено на пробіли).

source: "B<?>" - the change is unknown (when the remote rsync is old).
uk: «B<?>» — зміна є невідомою (якщо віддалений rsync є застарілим).

source: A letter indicates an attribute is being updated.
uk: Літера вказує на оновлення атрибута.

source: The attribute that is associated with each letter is as follows:
uk: Атрибути, які пов'язано із кожною з літер, є такими:

source: A B<c> means either that a regular file has a different checksum (requires B<--checksum>) or that a symlink, device, or special file has a changed value. Note that if you are sending files to an rsync prior to 3.0.1, this change flag will be present only for checksum-differing regular files.
uk: B<c> означає або те, що звичайний файл має іншу контрольну суму (потребує B<--checksum>), або що символічне посилання, пристрій або особливий файл має змінене значення. Зауважте, що якщо ви надсилаєте файли до rsync до версії 3.0.1, цей прапорець зміни буде показано лише для звичайних файлів із іншою контрольною сумою.

source: A B<s> means the size of a regular file is different and will be updated by the file transfer.
uk: B<s> означає, що розмір звичайного файла відрізняється, і його буде оновлено під час передавання файла.

source: A B<t> means the modification time is different and is being updated to the sender's value (requires B<--times>). An alternate value of B<T> means that the modification time will be set to the transfer time, which happens when a file/symlink/device is updated without B<--times> and when a symlink is changed and the receiver can't set its time. (Note: when using an rsync 3.0.0 client, you might see the B<s> flag combined with B<t> instead of the proper B<T> flag for this time-setting failure.)
uk: B<t> означає різні часи внесення змін із оновленням на значення з боку відправника (потребує B<--times>). Альтернативне значення B<T> означає, що для часу внесення змін буде встановлено значення моменту передавання даних, що трапляється при оновленні файла, символічного посилання або пристрою без B<--times> і коли символічне посилання змінено, а отримувач не може встановити його час. (Зауваження: при використанні клієнта rsync 3.0.0, ви можете побачити поєднання прапорця B<s> із B<t>, замість належного прапорця B<T> для цієї помилки при встановленні часу.)

source: A B<p> means the permissions are different and are being updated to the sender's value (requires B<--perms>).
uk: B<p> означає, що різними є права доступу, і їх буде оновлено за значенням відправника (потребує B<--perms>).

source: An B<o> means the owner is different and is being updated to the sender's value (requires B<--owner> and super-user privileges).
uk: B<o> означає, що різними є власники, і їх записи буде оновлено за значенням відправника (потребує B<--owner> і прав доступу надкористувача).

source: A B<g> means the group is different and is being updated to the sender's value (requires B<--group> and the authority to set the group).
uk: B<g> означає, що група є різною, і її буде оновлено за значенням з боку відправника (потребує B<--group> і уповноваження на встановлення групи).

source: A B<u>|B<n>|B<b> indicates the following information:
uk: B<u>|B<n>|B<b> вказує на такі відомості:

source: B<u> means the access (use) time is different and is being updated to the sender's value (requires B<--atimes>)
uk: B<u> означає, що різним є час доступу (використання), і цей час буде оновлено за значенням з боку відправника (потребує B<--atimes>)

source: B<n> means the create time (newness) is different and is being updated to the sender's value (requires B<--crtimes>)
uk: B<n> означає, що різним є час створення (новизна), і цей час буде оновлено за значенням з боку відправника (потребує B<--crtimes>)

source: B<b> means that both the access and create times are being updated
uk: B<b> означає, що різними є як час доступу, так і час створення, і обидва ці значення буде оновлено

source: The B<a> means that the ACL information is being changed.
uk: B<a> означає, що буде змінено дані ACL.

source: The B<x> means that the extended attribute information is being changed.
uk: B<x> означає, що буде змінено дані розширених атрибутів.

source: One other output is possible: when deleting files, the "%i" will output the string "B<*deleting>" for each item that is being removed (assuming that you are talking to a recent enough rsync that it logs deletions instead of outputting them as a verbose message).
uk: Можливим є інше виведення: при вилученні файлів результатом застосування «%i» є виведення рядка «B<*deleting>» для кожного об'єкта, який вилучають (припускаємо, що обговорюємо досттаньо нову версію rsync, яка записує до журналу вилучення замість виведення повідомлень про них у докладному режимі повідомлень).

source: B<--out-format=FORMAT>
uk: B<--out-format=ФОРМАТ>

source: This allows you to specify exactly what the rsync client outputs to the user on a per-update basis. The format is a text string containing embedded single-character escape sequences prefixed with a percent (%) character. A default format of "%n%L" is assumed if either B<--info=name> or B<-v> is specified (this tells you just the name of the file and, if the item is a link, where it points). For a full list of the possible escape characters, see the B<log\ format> setting in the rsyncd.conf manpage.
uk: Надає вам змогу вказати точно, що клієнт rsync виводитиме до користувача для окремих оновлень. ФОРМАТ — текстовий рядок, що містить вбудовані однолітерні керівні послідовності із префіксом — символом відсотків (%). Типовий формат «%n%L» буде використано, якщо буде вказано або B<--info=назва>, або B<-v> (дає вам лише назву файла і, якщо це посилання, на що воно вказує). Із повним списком можливих керівних символів можна ознайомитися в описів параметра B<log\ format> на сторінці підручника rsyncd.conf.

source: Specifying the B<--out-format> option implies the B<--info=name> option, which will mention each file, dir, etc. that gets updated in a significant way (a transferred file, a recreated symlink/device, or a touched directory). In addition, if the itemize-changes escape (%i) is included in the string (e.g. if the B<--itemize-changes> option was used), the logging of names increases to mention any item that is changed in any way (as long as the receiving side is at least 2.6.4). See the B<--itemize-changes> option for a description of the output of "%i".
uk: Визначення параметра B<--out-format> неявним чином встановлює параметр B<--info=назва>, який призведе до виведення даних для кожного файла, каталогу тощо, які було значно оновлено (переданий файл, повторно створене символічне посилання або пристрій, змінений каталог). Крім того, якщо до рядка буде включено керівну послідовність списку змін (%i) (наприклад, якщо було використано параметр B<--itemize-changes>), обсяг запису до журналу буде збільшено шляхом додавання усіх записів, які було хоч якось змінено (якщо на боці отримання встановлено принаймні версію 2.6.4 програми). Див. параметр B<--itemize-changes>, щоб ознайомитися із описом виведення «%i».

source: Rsync will output the out-format string prior to a file's transfer unless one of the transfer-statistic escapes is requested, in which case the logging is done at the end of the file's transfer. When this late logging is in effect and B<--progress> is also specified, rsync will also output the name of the file being transferred prior to its progress information (followed, of course, by the out-format output).
uk: Rsync виводитиме рядок форматування виведення до передавання файла, якщо не використано одну з керівних послідовностей статистики передавання. Якщо таку послідовність використано, запис до журналу буде виконано наприкінці передавання файла. Якщо працює це пізнє записування до журналу, і також вказано B<--progress>, rsync також виводитиме назву файла, який передається, до даних щодо поступу передавання (звичайно ж, із наступним виведенням у форматуванні виведення).

source: B<--log-file=FILE>
uk: B<--log-file=ФАЙЛ>

source: This option causes rsync to log what it is doing to a file. This is similar to the logging that a daemon does, but can be requested for the client side and/or the server side of a non-daemon transfer. If specified as a client option, transfer logging will be enabled with a default format of "%i %n%L". See the B<--log-file-format> option if you wish to override this.
uk: Використання цього параметра призведе до запису до журналу дій щодо файла, які виконує rsync. Записування подібне до того, яке виконує фонова служба, але запит щодо нього можна надсилати з блоку клієнта і/або сервера для передавання, не пов'язаного із фоновою службою. Якщо вказано як параметр клієнта, запис передавання до журналу буде увімкнено із типовим форматуванням «%i %n%L». Див. параметр B<--log-file-format>, якщо хочете перевизначити цю поведінку.

source: Here's a example command that requests the remote side to log what is happening:
uk: Ось приклад команди, яка просить віддалений кінець з'єднання записувати до журналу події, які відбуваються:

source: rsync -av --remote-option=--log-file=/tmp/rlog src/ dest/
uk: rsync -av --remote-option=--log-file=/tmp/rlog джерело/ призначення/

source: This is very useful if you need to debug why a connection is closing unexpectedly.
uk: Це дуже корисно, якщо вам потрібно дізнатися, чому з'єднання неочікувано розірвано.

source: See also the daemon version of the B<--log-file> option.
uk: Див. також версію для фонової служби параметра B<--log-file>.

source: B<--log-file-format=FORMAT>
uk: B<--log-file-format=ФОРМАТ>

source: This allows you to specify exactly what per-update logging is put into the file specified by the B<--log-file> option (which must also be specified for this option to have any effect). If you specify an empty string, updated files will not be mentioned in the log file. For a list of the possible escape characters, see the B<log\ format> setting in the rsyncd.conf manpage.
uk: Надає вам змогу вказати точно, що буде записано до журналу у файлі, вказаному за допомогою параметра B<--log-file> (який також має бути встановлено, щоб цей параметр запрацював). Якщо ви вкажете порожній рядок, оновлені файли не буде згадано у файлі журналу. Щоб ознайомитися зі списком можливих керівних символів, зверніться до опису параметра B<log\ format> на сторінці підручника щодо rsyncd.conf.

source: The default FORMAT used if B<--log-file> is specified and this option is not is '%i %n%L'.
uk: Типовий ФОРМАТ, якщо вказано B<--log-file> і значенням цього параметра не є «%i %n%L».

source: See also the daemon version of the B<--log-file-format> option.
uk: Див. також версію для фонової служби параметра B<--log-file-format>.

source: This tells rsync to print a verbose set of statistics on the file transfer, allowing you to tell how effective rsync's delta-transfer algorithm is for your data. This option is equivalent to B<--info=stats2> if combined with 0 or 1 B<-v> options, or B<--info=stats3> if combined with 2 or more B<-v> options.
uk: Наказує rsync виводити докладний набір статистики щодо передавання файлів. Це надасть вам змогу визначити, наскільки ефективним є алгоритм дельта-передавання rsync для ваших даних. Цей параметр є тотожним до B<--info=stats2>, якщо його поєднано із 0 або 1 параметром B<-v>, або B<--info=stats3>, якщо поєднано із 2 або декількома параметрами B<-v>.

source: The current statistics are as follows:
uk: Поточна статистика є такою:

source: B<Number\ of\ files> is the count of all "files" (in the generic sense), which includes directories, symlinks, etc. The total count will be followed by a list of counts by filetype (if the total is non-zero). For example: "(reg: 5, dir: 3, link: 2, dev: 1, special: 1)" lists the totals for regular files, directories, symlinks, devices, and special files. If any of value is 0, it is completely omitted from the list.
uk: B<Number\ of\ files> — кількість усіх «файлів» (у загальному сенсі), до якої включено каталоги, символічні посилання тощо. За загальною кількістю буде вказано список кількостей за типом файлів (якщо загальна кількість є ненульовою). Приклад: «(reg: 5, dir: 3, link: 2, dev: 1, special: 1)» є даними щодо звичайних файлів, каталогів, символічних посилань, пристроїв та особливих файлів. Якщо якесь зі значень є нульовим, його у списку буде пропущено.

source: B<Number\ of\ created\ files> is the count of how many "files" (generic sense) were created (as opposed to updated). The total count will be followed by a list of counts by filetype (if the total is non-zero).
uk: B<Number\ of\ created\ files> — кількість «файлів» (у загальному сенсі), які було створено (а не оновлено). Після загальної кількості буде вказано список кількостей за типами файлів (якщо загальна кількість є ненульовою).

source: B<Number\ of\ deleted\ files> is the count of how many "files" (generic sense) were deleted. The total count will be followed by a list of counts by filetype (if the total is non-zero). Note that this line is only output if deletions are in effect, and only if protocol 31 is being used (the default for rsync 3.1.x).
uk: B<Number\ of\ deleted\ files> — кількість «файлів» (у загальному сенсі), які було вилучено. Після загальної кількості буде вказано список кількостей за типами файлів (якщо загальна кількість є ненульовою). Зауважте, що цей рядок буде виведено, лише якщо задіяно вилучення, і лише якщо використано протокол 31 (типовий протокол для версій, починаючи з rsync 3.1.x).

source: B<Number\ of\ regular\ files\ transferred> is the count of normal files that were updated via rsync's delta-transfer algorithm, which does not include dirs, symlinks, etc. Note that rsync 3.1.0 added the word "regular" into this heading.
uk: B<Number\ of\ regular\ files\ transferred> — кількість звичайних файлів, які було оновлено за алгоритмом дельта-передавання rsync, до якого не буде включено каталоги, символічні посилання тощо. Зауважте, що у rsync 3.1.0 додано слово «regular» до цього заголовка.

source: B<Total\ file\ size> is the total sum of all file sizes in the transfer. This does not count any size for directories or special files, but does include the size of symlinks.
uk: B<Total\ file\ size> — загальна сума розмірів усіх файлів у передаванні. Сюди не буде включено розміри каталогів та особливих файлів, але включено розмір символічних посилань.

source: B<Total\ transferred\ file\ size> is the total sum of all files sizes for just the transferred files.
uk: B<Total\ transferred\ file\ size> — загальна сума розмірів усіх файлів для щойно переданих файлів.
