Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: Force an older protocol version to be used. This is useful for creating a batch file that is compatible with an older version of rsync. For instance, if rsync 2.6.4 is being used with the B<--write-batch> option, but rsync 2.6.3 is what will be used to run the B<--read-batch> option, you should use "--protocol=28" when creating the batch file to force the older protocol version to be used in the batch file (assuming you can't upgrade the rsync on the reading system).
uk: Примусово застосувати застарілу версію протоколу. Корисно для створення пакетного файла, який є сумісним із застарілими версіями rsync. Наприклад, якщо використано rsync 2.6.4 із параметром B<--write-batch>, а для запуску з параметром B<--read-batch> буде використано версію 2.6.3, вам слід використати «--protocol=28» при створенні пакетного файла для застарілих версій протоколу, які буде використано у пакетному файлі (припускаємо, що ви не можете оновити rsync на системі читання).

source: B<--iconv=CONVERT_SPEC>
uk: B<--iconv=СПЕЦИФІКАЦІЯ_ПЕРЕТВОРЕННЯ>

source: Rsync can convert filenames between character sets using this option. Using a CONVERT_SPEC of "." tells rsync to look up the default character-set via the locale setting. Alternately, you can fully specify what conversion to do by giving a local and a remote charset separated by a comma in the order B<--iconv=LOCAL,REMOTE>, e.g. B<--iconv=utf8,iso88591>. This order ensures that the option will stay the same whether you're pushing or pulling files. Finally, you can specify either B<--no-iconv> or a CONVERT_SPEC of "-" to turn off any conversion. The default setting of this option is site-specific, and can also be affected via the B<RSYNC_ICONV> environment variable.
uk: Rsync може перетворювати назви між кодуваннями за допомогою цього параметра. За допомогою встановлення значення CONVERT_SPEC «.» можна наказати rsync шукати типове кодування на основі встановленої локалі. Крім того, ви можете повністю вказати, яке перетворення слід виконати, заданням локального і віддаленого кодування через кому у порядку B<--iconv=ЛОКАЛЬЕН,ВІДДАЛЕНЕ>, наприклад B<--iconv=utf8,iso88591>. Цей порядок забезпечує незмінність запису параметра, незалежно від того, надсилаєте ви файли чи отримуєте їх. Нарешті, ви можете вказати або B<--no-iconv>, або значення CONVERT_SPEC «-», щоб вимкнути перетворення взагалі. Типове значення цього параметра залежить від операційної системи, на нього може вплинути змінна середовища B<RSYNC_ICONV>.

source: For a list of what charset names your local iconv library supports, you can run "B<iconv\ --list>".
uk: Щоб отримати список назв кодувань, підтримку яких передбачено у вашій локальній бібліотеці iconv, ви можете скористатися командою «B<iconv\ --list>».

source: If you specify the B<--protect-args> (B<-s>) option, rsync will translate the filenames you specify on the command-line that are being sent to the remote host. See also the B<--files-from> option.
uk: Якщо ви вкажете параметр B<--protect-args> (B<-s>), rsync виконає перетворення назв файлів, які ви вкажете у рядку команди, який буде надіслано на віддалений вузол. Див. також параметр B<--files-from>.

source: Note that rsync does not do any conversion of names in filter files (including include/exclude files). It is up to you to ensure that you're specifying matching rules that can match on both sides of the transfer. For instance, you can specify extra include/exclude rules if there are filename differences on the two sides that need to be accounted for.
uk: Зауважте, що rsync не виконує ніяких перетворень назв у файлах фільтрування (включно з файлами включення/виключення). Забезпечити відповідність вказаних правил на обох кінцях ланцюжка передавання даних маєте ви. Наприклад, ви можете вказати додаткові правила включення/виключення, якщо є відмінності на кінцях з'єднання, які слід врахувати.

source: When you pass an B<--iconv> option to an rsync daemon that allows it, the daemon uses the charset specified in its "charset" configuration parameter regardless of the remote charset you actually pass. Thus, you may feel free to specify just the local charset for a daemon transfer (e.g. B<--iconv=utf8>).
uk: Якщо ви передаєте параметр B<--iconv> фоновій службі rsync, яка може з ним працювати, фонова служба використає кодування, вказане у її параметрі налаштування «charset», незалежно від віддаленого кодування, яке ви насправді передаєте. Таким чином, ви можете вказати лише локальне кодування для передавання до фонової служби (наприклад B<--iconv=utf8>).

source: B<--ipv4>, B<-4> or B<--ipv6>, B<-6>
uk: B<--ipv4>, B<-4> або B<--ipv6>, B<-6>

source: Tells rsync to prefer IPv4/IPv6 when creating sockets or running ssh. This affects sockets that rsync has direct control over, such as the outgoing socket when directly contacting an rsync daemon, as well as the forwarding of the B<-4> or B<-6> option to ssh when rsync can deduce that ssh is being used as the remote shell. For other remote shells you'll need to specify the "B<--rsh\ SHELL\ -4>" option directly (or whatever IPv4/IPv6 hint options it uses).
uk: Вказує rsync, що слід надати перевагу IPv4/IPv6 при створенні сокетів чи запуску ssh. Це стосується сокетів, над якими має безпосереднє керування rsync, зокрема вихідного сокета при безпосередньому контакті із фоновою службою rsync, а також переспрямування параметра B<-4> або B<-6> до ssh, якщо rsync може визначити, що використано ssh, як віддалену оболонку. Для інших віддалених оболонок вам слід вказати параметр «B<--rsh\ ОБОЛОНКА\ -4>» безпосередньо (або будь-які параметри-підказки IPv4/IPv6, які вони використовують).

source: See also the daemon version of these options.
uk: Див. також версії для фонової служби цих параметрів.

source: If rsync was compiled without support for IPv6, the B<--ipv6> option will have no effect. The B<rsync\ --version> output will contain "B<no\ IPv6>" if is the case.
uk: Якщо rsync було зібрано без підтримки IPv6, параметр B<--ipv6> не працюватиме. Виведення B<rsync\ --version> міститиме рядок «B<no\ IPv6>», якщо це так.

source: B<--checksum-seed=NUM>
uk: B<--checksum-seed=ЧИСЛО>

source: Set the checksum seed to the integer NUM. This 4 byte checksum seed is included in each block and MD4 file checksum calculation (the more modern MD5 file checksums don't use a seed). By default the checksum seed is generated by the server and defaults to the current B<time>(). This option is used to set a specific checksum seed, which is useful for applications that want repeatable block checksums, or in the case where the user wants a more random checksum seed. Setting NUM to 0 causes rsync to use the default of B<time>() for checksum seed.
uk: Встановити початкове число контрольної суми у значення ЧИСЛО. Це базове число контрольної суми, що має складатися з байтів, буде використано під ас обчислення всіх контрольних сум MD4 для блоків і файлів (сучасніші контрольні суми файлів MD5 не використовують базового значення). Типово, початкове число контрольної суми буде створено сервером на основі даних про поточний час, B<time>(). Цим параметром можна скористатися для встановлення певного початкового значення для обчислення контрольних сум, що корисно, якщо ви користуєтеся програмами, яким потрібні сталі значення контрольних сум блоків, або у випадках, коли потрібне якесь зовсім випадкове початкове значення. Встановлення значення ЧИСЛО=0 призведе до використання rsync типового початкового значення контрольної суми, отриманого за допомогою команди функції B<time>().

source: DAEMON OPTIONS
uk: ПАРАМЕТРИ ФОНОВОЇ СЛУЖБИ

source: The options allowed when starting an rsync daemon are as follows:
uk: Параметри, якими можна скористатися при запуску фонової служби rsync, є такими:

source: This tells rsync that it is to run as a daemon. The daemon you start running may be accessed using an rsync client using the B<host::module> or B<rsync://host/module/> syntax.
uk: Цей параметр наказує rsync запуститися у режимі фонової служби. Доступ до запущеної фонової служби можна буде здійснювати за допомогою клієнта rsync з використанням синтаксису B<вузол::модуль> або B<rsync://вузол/модуль/>.

source: If standard input is a socket then rsync will assume that it is being run via inetd, otherwise it will detach from the current terminal and become a background daemon. The daemon will read the config file (rsyncd.conf) on each connect made by a client and respond to requests accordingly.
uk: Якщо стандартним джерелом вхідних даних є сокет, rsync припускатиме, що програму запущено за допомогою inetd, інакше програма від'єднається від поточного термінала і стане фоновою службою. Фонова служба читатиме файл налаштувань (rsyncd.conf) при кожному з'єднанні, яке встановлюватиме клієнт, і відповідатиме на запити відповідним чином.

source: See the B<rsyncd.conf>(5) manpage for more details.
uk: Щоб дізнатися більше, ознайомтеся зі сторінкою підручника B<rsyncd.conf>(5).

source: By default rsync will bind to the wildcard address when run as a daemon with the B<--daemon> option. The B<--address> option allows you to specify a specific IP address (or hostname) to bind to. This makes virtual hosting possible in conjunction with the B<--config> option.
uk: Типово, rsync прив'язуватиметься до вказаної символами-замінниками адреси при запуску в формі служби з параметром B<--daemon>. Параметр B<--address> надає вам змогу вказати певну IP-адресу (або назву вузла), до якого слід прив'язатися. Це, у поєднанні із параметром B<--config>, надає змогу створювати віртуальні провідні вузли.

source: See also the address global option in the rsyncd.conf manpage and the client version of the B<--address> option.
uk: Див. також загальний параметр адреси на сторінці підручника rsyncd.conf і клієнтську версію параметра B<--address>.

source: This option allows you to specify the maximum transfer rate for the data the daemon sends over the socket. The client can still specify a smaller B<--bwlimit> value, but no larger value will be allowed.
uk: За допомогою цього параметра ви можете вказати максимальну швидкість передавання для даних, які фонова служба надсилає крізь сокет. Втім, клієнт може вказати менше значення B<--bwlimit>, але більші значення буде заборонено.

source: See the client version of the B<--bwlimit> option for some extra details.
uk: Див. версію для клієнта параметра B<--bwlimit>, щоб ознайомитися із додатковими подробицями.

source: B<--config=FILE>
uk: B<--config=ФАЙЛ>

source: This specifies an alternate config file than the default. This is only relevant when B<--daemon> is specified. The default is /etc/rsyncd.conf unless the daemon is running over a remote shell program and the remote user is not the super-user; in that case the default is rsyncd.conf in the current directory (typically $HOME).
uk: Цей параметр вказує альтернативний файл налаштувань, відмінний від типового. Діє, лише якщо вказано B<--daemon>. Типовим файлом є /etc/rsyncd.conf, якщо фонову службу не запущено за допомогою програми віддаленої командної оболонки і віддалений користувач не є надкористувачем; якщо це не так, типовим є файл rsyncd.conf у поточному каталозі (типово, $HOME).

source: B<--dparam=OVERRIDE>, B<-M>
uk: B<--dparam=ПЕРЕВИЗНАЧЕННЯ>, B<-M>

source: This option can be used to set a daemon-config parameter when starting up rsync in daemon mode. It is equivalent to adding the parameter at the end of the global settings prior to the first module's definition. The parameter names can be specified without spaces, if you so desire. For instance:
uk: Цим параметром можна скористатися для встановлення параметра налаштувань фонової служби при запуску rsync у режимі фонової служби. Він тотожний додаванню параметра наприкінці загальний параметрів до визначення першого модуля. Назви параметрів можна вказувати без пробілів, якщо ви цього хочете. Приклад:

source: rsync --daemon -M pidfile=/path/rsync.pid
uk: rsync --daemon -M pidfile=/шлях/rsync.pid

source: When running as a daemon, this option instructs rsync to not detach itself and become a background process. This option is required when running as a service on Cygwin, and may also be useful when rsync is supervised by a program such as B<daemontools> or AIX's B<System\ Resource\ Controller>. B<--no-detach> is also recommended when rsync is run under a debugger. This option has no effect if rsync is run from inetd or sshd.
uk: У режимі роботи фонової служби цей параметр наказує rsync не від'єднуватися і стати фоновим процесом. Цей параметр потрібен, коли програма працює як служба у Cygwin, а також може бути корисним, якщо супервізором rsync є програма, подібна до B<daemontools> чи B<System\ Resource\ Controller> в AIX. Також рекомендуємо скористатися B<--no-detach>, якщо rsync запущено під керування засобу діагностики. Цей параметр не працюватиме, якщо rsync запущено з inetd або sshd.

source: This specifies an alternate TCP port number for the daemon to listen on rather than the default of 873.
uk: Цей параметри визначає альтернативний номер порту TCP, на якому має очікувати на дані фонова служба, замість типового порту 873.

source: See also the client version of the B<--port> option and the port global setting in the rsyncd.conf manpage.
uk: Див. також версію для клієнта параметра B<--port> і загальний параметр порту на сторінці підручника щодо rsyncd.conf.

source: This option tells the rsync daemon to use the given log-file name instead of using the "B<log\ file>" setting in the config file.
uk: Використання цього параметра наказує фоновій службі rsync використовувати файл журналу із вказаною назвою, замість значення параметра «B<log\ file>» у файлі налаштувань.

source: See also the client version of the B<--log-file> option.
uk: Див. також версію для клієнта параметра B<--log-file>.

source: This option tells the rsync daemon to use the given FORMAT string instead of using the "B<log\ format>" setting in the config file. It also enables "B<transfer\ logging>" unless the string is empty, in which case transfer logging is turned off.
uk: Використання цього параметра наказує фоновій службі rsync використовувати вказаний рядок ФОРМАТ, замість використання значення параметра «B<log\ format>» у файлі налаштувань. Також буде увімкнено «B<transfer\ logging>», якщо рядок не є порожнім; якщо ж це не так, записування журналу передавання буде вимкнено.

source: See also the client version of the B<--log-file-format> option.
uk: Див. також версію для клієнта параметра B<--log-file-format>.

source: This overrides the B<socket\ options> setting in the rsyncd.conf file and has the same syntax.
uk: Цей параметр перевизначає параметр B<socket\ options> у файлі rsyncd.conf і має такий самий синтаксис.

source: See also the client version of the B<--sockopts> option.
uk: Див. також версію для клієнта параметра B<--sockopts>.

source: This option increases the amount of information the daemon logs during its startup phase. After the client connects, the daemon's verbosity level will be controlled by the options that the client used and the "B<max\ verbosity>" setting in the module's config section.
uk: Використання цього параметра збільшує обсяг інформації, яку фонова служба запису до журналу під час фази запуску. Після встановлення з'єднання із клієнтом рівнем докладності журналу керуватимуть параметри роботи клієнта та параметр «B<max\ verbosity>» у розділі налаштувань модуля.

source: See also the client version of the B<--verbose> option.
uk: Див. також версію для клієнта параметра B<--verbose>.

source: Tells rsync to prefer IPv4/IPv6 when creating the incoming sockets that the rsync daemon will use to listen for connections. One of these options may be required in older versions of Linux to work around an IPv6 bug in the kernel (if you see an "address already in use" error when nothing else is using the port, try specifying B<--ipv6> or B<--ipv4> when starting the daemon).
uk: Наказує rsync віддавати перевагу IPv4/IPv6 при створенні вхідних сокетів, які фонова служба rsync використовуватиме для очікування на з'єднання. Один з цих параметрів може бути обов'язковим у застарілих версіях Linux для того, щоб обійти ваду IPv6 у ядрі системи (якщо ви бачите помилку «адресу вже використано», коли нічого не може використовувати порт спробуйте вказати B<--ipv6> або B<--ipv4> при запуску фонової служби).

source: See also the client version of these options.
uk: Див. також версії для клієнта цих параметрів.

source: When specified after B<--daemon>, print a short help page describing the options available for starting an rsync daemon.
uk: Якщо вказано після B<--daemon>, вивести коротку довідкову сторінку із описом параметрів, якими можна скористатися для запуску фонової служби rsync.

source: FILTER RULES
uk: ПРАВИЛА ФІЛЬТРУВАННЯ

source: The filter rules allow for flexible selection of which files to transfer (include) and which files to skip (exclude). The rules either directly specify include/exclude patterns or they specify a way to acquire more include/exclude patterns (e.g. to read them from a file).
uk: Правила фільтрування дозволяють скористатися гнучким вибором того, які файли передавати (включати), а які файли пропускати (виключати). Правила або безпосередньо вказують взірці включення-виключення, або визначають спосіб отримати додаткові взірці включення-виключення (наприклад, прочитати ці взірці з файла).

source: As the list of files/directories to transfer is built, rsync checks each name to be transferred against the list of include/exclude patterns in turn, and the first matching pattern is acted on: if it is an exclude pattern, then that file is skipped; if it is an include pattern then that filename is not skipped; if no matching pattern is found, then the filename is not skipped.
uk: При побудові списку файлів та каталогів для передавання rsync виконує перевірку кожної назви за взірцями включення/виключення. Задіяно буде перший відповідний взірець: якщо це взірець виключення, файл буде пропущено; якщо це взірець включення, файл не буде пропущено; якщо не буде знайдено відповідного взірця, файл не буде пропущено.

source: Aside: because the interactions of filter rules can be complex, it is useful to use the B<--debug=FILTER> option if things aren't working the way you expect. The level-1 output (the default if no level number is specified) mentions the filter rule that is first matched by each file in the transfer. It also warns if a filter rule has trailing whitespace. The level-2 output mentions a lot more filter events, including the definition of each rule and the handling of per-directory filter files.
uk: Відступ: оскільки взаємодія правил фільтрування може бути складною, корисно скористатися параметром B<--debug=ФІЛЬТР>, якщо щось працює не так, як ви б хотіли. Виведення на рівні-1 (типовий рівень, якщо номер рівня не вказано) включає правило фільтрування, яке спершу використовується для кожного файла у передаванні. Також програма попереджає, якщо у правилі фільтрування є кінцевий пробіл. На рівні 2 виведення використовує набагато більше подій фільтрування, включно із визначенням кожного правила і обробкою фільтрування файлів на рівні каталогів.

source: Rsync builds an ordered list of filter rules as specified on the command-line. Filter rules have the following syntax:
uk: Rsync будує упорядкований список правил фільтрування, як їх вказано у рядку команди. Для правил фільтрування передбачено такий синтаксис:

source: RULE [PATTERN_OR_FILENAME] RULE,MODIFIERS [PATTERN_OR_FILENAME]
uk: ПРАВИЛО [ВЗІРЕЦЬ_АБО_НАЗВА_ФАЙЛА] ПРАВИЛО,МОДИФІКАТОРИ [ВЗІРЕЦЬ_АБО_НАЗВА_ФАЙЛА]

source: You have your choice of using either short or long RULE names, as described below. If you use a short-named rule, the ',' separating the RULE from the MODIFIERS is optional. The PATTERN or FILENAME that follows (when present) must come after either a single space or an underscore (_). Here are the available rule prefixes:
uk: Ви можете вибрати між використання коротких або довгих назв ПРАВИЛ, як це описано нижче. Якщо ви скористаєтеся короткими назвами правил, відокремлення «,» ПРАВИЛА від МОДИФІКАТОРІВ є необов'язковим. Наступний ВЗІРЕЦЬ або наступна НАЗВА_ФАЙЛА (якщо їх вказано) має бути вказано після одинарного пробілу або символу підкреслення (_). Ось доступні префікси правил:

source: specifies an exclude pattern.
uk: визначає взірець для виключення.

source: specifies an include pattern.
uk: визначає взірець для включення.

source: specifies a merge-file to read for more rules.
uk: вказує файл об'єднання для читання додаткових правил.

source: specifies a per-directory merge-file.
uk: вказує файл об'єднання на рівні каталогу.

source: specifies a pattern for hiding files from the transfer.
uk: визначає взірець для приховування файлів від перенесення.

source: files that match the pattern are not hidden.
uk: файли, які відповідають взірцю, не приховано.

source: specifies a pattern for protecting files from deletion.
uk: визначає взірець для захисту файлів від вилучення.

source: files that match the pattern are not protected.
uk: файли, які відповідають взірцю, не захищено.

source: clears the current include/exclude list (takes no arg)
uk: спорожнює поточний список включення/виключення (не приймає аргументів)

source: When rules are being read from a file, empty lines are ignored, as are whole-line comments that start with a 'B<#>' (filename rules that contain a hash are unaffected).
uk: Якщо правила буде прочитано з файла, порожні рядки буде проігноровано, як і цілорядкові коментарі, які починаються з «B<#>» (правила щодо назв файлів, які містять символ решітки не буде проігноровано).

source: Note that the B<--include> & B<--exclude> command-line options do not allow the full range of rule parsing as described above\ -- they only allow the specification of include / exclude patterns plus a "B<!>" token to clear the list (and the normal comment parsing when rules are read from a file). If a pattern does not begin with "B<-\ >" (dash, space) or "B<+\ >" (plus, space), then the rule will be interpreted as if "B<+\ >" (for an include option) or "B<-\ >" (for an exclude option) were prefixed to the string. A B<--filter> option, on the other hand, must always contain either a short or long rule name at the start of the rule.
uk: Зауважте, що параметри командного рядка B<--include> і B<--exclude> не дозволяють скористатися повним діапазоном обробки правил, як це описано вище\ — вони лише дозволяють вказати специфікацію взірців включення/виключення і символ «B<!>» для очищення списку (і звичайна обробка коментарів, якщо правила буде прочитано з файла). Якщо взірець не починається з «B<-\ >» (дефіс, пробіл) або «B<+\ >» (плюс, пробіл), правило буде оброблено так, наче до рядка було дописано префікс «B<+\ >» (для правила включення) або «B<-\ >» (для правила виключення). Параметр B<--filter>, з іншого боку, має завжди містить коротку або довгу назву правила на початку запису правила.

source: Note also that the B<--filter>, B<--include>, and B<--exclude> options take one rule/pattern each. To add multiple ones, you can repeat the options on the command-line, use the merge-file syntax of the B<--filter> option, or the B<--include-from> / B<--exclude-from> options.
uk: Зауважте, що параметри B<--filter>, B<--include> і B<--exclude> приймають по одному правилу/взірцю. Щоб додати декілька правил, ви можете повторити параметри у рядку команди, скористатися синтаксисом об'єднання файлів у параметрі B<--filter> або параметрами B<--include-from> / B<--exclude-from>.

source: INCLUDE/EXCLUDE PATTERN RULES
uk: ПРАВИЛА ВКЛЮЧЕННЯ/ВИКЛЮЧЕННЯ ЗА ВЗІРЦЯМИ
