Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: In a modern rsync, the B<-v> option is equivalent to the setting of groups of B<--info> and B<--debug> options. You can choose to use these newer options in addition to, or in place of using B<--verbose>, as any fine-grained settings override the implied settings of B<-v>. Both B<--info> and B<--debug> have a way to ask for help that tells you exactly what flags are set for each increase in verbosity.
uk: У сучасних версіях rsync параметр B<-v> є еквівалентним до встановлення груп для параметрів B<--info> і B<--debug>. Ви можете додатково скористатися цими новішими параметрами на додачу до використання B<--verbose> або замість нього, як і будь-якими параметрами тонкого керування для перевизначення неявно визначених параметрів B<-v>. Для обох параметрів, B<--info> і B<--debug>, передбачено спосіб отримання довідкових даних щодо того, які прапорці встановлено для кожного рівня докладності.

source: However, do keep in mind that a daemon's "B<max\ verbosity>" setting will limit how high of a level the various individual flags can be set on the daemon side. For instance, if the max is 2, then any info and/or debug flag that is set to a higher value than what would be set by B<-vv> will be downgraded to the B<-vv> level in the daemon's logging.
uk: Втім, слід пам'ятати, що параметр «B<максимальна докладність>» фонової служби обмежить рівень різноманітних окремих прапорців, які може бути встановлено на боці фонової служби. Наприклад, якщо максимумом є 2, будь-який прапорець відомостей і/або діагностики, який встановлено на вище значення, чим встановлений параметром B<-vv>, буде знижено до рівня B<-vv> у журналюванні фонової служби.

source: B<--info=FLAGS>
uk: B<--info=ПРАПОРЦІ>

source: This option lets you have fine-grained control over the information output you want to see. An individual flag name may be followed by a level number, with 0 meaning to silence that output, 1 being the default output level, and higher numbers increasing the output of that flag (for those that support higher levels). Use B<--info=help> to see all the available flag names, what they output, and what flag names are added for each increase in the verbose level. Some examples:
uk: Цей параметр надає у ваше розпорядження тонке керування над виведенням відомостей, які ви хочете побачити. За назвою окремого прапорця може бути вказано номер рівня. 0 означає «придушити виведення», 1 — типовий рівень виведення, а більші значення збільшують докладність виведення для відповідного прапорця (там, де передбачено підтримку вищих рівнів). Скористайтеся B<--info=help>, щоб переглянути доступні назви прапорців, дані, які буде виведено, якщо їх буде використано, і які назви прапорців буде додано для кожного збільшення рівня докладності. Деякі приклади:

source: rsync -a --info=progress2 src/ dest/ rsync -avv --info=stats2,misc1,flist0 src/ dest/
uk: rsync -a --info=progress2 джерело/ призначення/ rsync -avv --info=stats2,misc1,flist0 джерело/ призначення/

source: Note that B<--info=name>'s output is affected by the B<--out-format> and B<--itemize-changes> (B<-i>) options. See those options for more information on what is output and when.
uk: Зауважте, що на виведення B<--info=назва> впливатимуть параметри B<--out-format> і B<--itemize-changes> (B<-i>). Див. ці параметри, щоб дізнатися більше про те, що буде виведено, і коли.

source: This option was added to 3.1.0, so an older rsync on the server side might reject your attempts at fine-grained control (if one or more flags needed to be send to the server and the server was too old to understand them). See also the "B<max\ verbosity>" caveat above when dealing with a daemon.
uk: Цей параметр було додано у версії 3.1.0, отже, у старіших версіях rsync на боці сервера може бути відмовлено у ваших спробах точнішого налаштовування (якщо потрібно надіслати на сервер один або декілька прапорців, а сервер є надто старим, щоб зрозуміти їх). Див. також проблему із «B<максимальною докладністю>» вище при роботі з фоновою службою.

source: B<--debug=FLAGS>
uk: B<--debug=ПРАПОРЦІ>

source: This option lets you have fine-grained control over the debug output you want to see. An individual flag name may be followed by a level number, with 0 meaning to silence that output, 1 being the default output level, and higher numbers increasing the output of that flag (for those that support higher levels). Use B<--debug=help> to see all the available flag names, what they output, and what flag names are added for each increase in the verbose level. Some examples:
uk: Цей параметр надає у ваше розпорядження тонке керування над виведенням діагностичних даних, які ви хочете побачити. За назвою окремого прапорця може бути вказано номер рівня. 0 означає «придушити виведення», 1 — типовий рівень виведення, а більші значення збільшують докладність виведення для відповідного прапорця (там, де передбачено підтримку вищих рівнів). Скористайтеся B<--debug=help>, щоб переглянути доступні назви прапорців, дані, які буде виведено, якщо їх буде використано, і які назви прапорців буде додано для кожного збільшення рівня докладності. Деякі приклади:

source: rsync -avvv --debug=none src/ dest/ rsync -avA --del --debug=del2,acl src/ dest/
uk: rsync -avvv --debug=none джерело/ призначення/ rsync -avA --del --debug=del2,acl джерело/ призначення/

source: Note that some debug messages will only be output when the B<--stderr=all> option is specified, especially those pertaining to I/O and buffer debugging.
uk: Зауважте, що деякі діагностичні повідомлення буде виведено, лише якщо вказано параметр B<--stderr=all>, особливо повідомлення, які пов'язано із введенням-виведенням і діагностикою буфера.

source: Beginning in 3.2.0, this option is no longer auto-forwarded to the server side in order to allow you to specify different debug values for each side of the transfer, as well as to specify a new debug option that is only present in one of the rsync versions. If you want to duplicate the same option on both sides, using brace expansion is an easy way to save you some typing. This works in zsh and bash:
uk: Починаючи з версії 3.2.0, цей параметр більше не переспрямовується автоматично на бік сервера з метою уможливити для вас визначення різних діагностичних значень для обох боків передавання даних, а також вказати новий параметр діагностики, який передбачено лише в одній з версій rsync. Якщо ви хочете здублювати параметр на обох кінцях з'єднання, використання розгортання фігурних дужок є простим способом заощадити деякий час на введенні команд. Це працює у zsh і bash:

source: rsync -aiv {-M,}--debug=del2 src/ dest/
uk: rsync -aiv {-M,}--debug=del2 джерело/ призначення/

source: This option controls which processes output to stderr and if info messages are also changed to stderr. The mode strings can be abbreviated, so feel free to use a single letter value. The 3 possible choices are:
uk: Цей параметр керує тим, які процеси виводитимуть дані до stderr, і чи буде переспрямовано інформаційні повідомлення до stderr. Рядки режимів може бути скорочено, тому можете скористатися однолітерним значенням. 3 можливими варіантами є такі:

source: B<errors> - (the default) causes all the rsync processes to send an error directly to stderr, even if the process is on the remote side of the transfer. Info messages are sent to the client side via the protocol stream. If stderr is not available (i.e. when directly connecting with a daemon via a socket) errors fall back to being sent via the protocol stream.
uk: B<errors> — (типовий варіант) наказує усім процесам rsync надсилати повідомлення про помилки безпосередньо stderr, навіть якщо процес перебуває на віддаленому боці передавання даних. Інформаційні повідомлення буде надіслано на бік клієнта за допомогою потоку даних протоколу. Якщо stderr виявиться недоступним (тобто недоступним на момент безпосереднього з'єднання з фоновою службою за допомогою сокета), резервним місцем для повідомлень про помилки буде потік даних протоколу.

source: B<all> - causes all rsync messages (info and error) to get written directly to stderr from all (possible) processes. This causes stderr to become line-buffered (instead of raw) and eliminates the ability to divide up the info and error messages by file handle. For those doing debugging or using several levels of verbosity, this option can help to avoid clogging up the transfer stream (which should prevent any chance of a deadlock bug hanging things up). It also allows B<--debug> to enable some extra I/O related messages.
uk: B<all> — наказує записувати усі повідомлення rsync (інформаційні і повідомлення про помилки) безпосередньо до stderr з усіх (можливих) процесів. Це спричиняє буферизацію stderr за рядками (а не вимикання будь-якої обробки) і усуває можливість ділити інформаційні повідомлення та повідомлення про помилки за дескриптором файла. Для тих, хто виконує діагностику або використовує декілька рівнів докладності, цей параметр може допомогти уникнути засмічування потоку даних передавання (це має запобігти будь-якому блокуванню усього потоку). Це також уможливлює вмикання за допомогою B<--debug> деяких додаткових повідомлень, які пов'язано із введенням-виведенням.

source: B<client> - causes all rsync messages to be sent to the client side via the protocol stream. One client process outputs all messages, with errors on stderr and info messages on stdout. This B<was> the default in older rsync versions, but can cause error delays when a lot of transfer data is ahead of the messages. If you're pushing files to an older rsync, you may want to use B<--stderr=all> since that idiom has been around for several releases.
uk: B<client> — наказує надсилати усі повідомлення rsync на бік клієнта за допомогою потоку даних протоколу. Один клієнтський процес виводить усі повідомлення із помилками до stderr, а інформаційні повідомлення — до stdout. Це B<була> типова поведінка у застарілих версіях rsync. Втім, вона могла спричиняти затримки у виведенні повідомлень про помилки, якщо повідомленням передували значні блоки переданих даних. Якщо ви надсилаєте файли до застарілої версії rsync, вам варто скористатися B<--stderr=all>, оскільки ця ідіома вже використовується протягом низки випусків.

source: This option was added in rsync 3.2.3. This version also began the forwarding of a non-default setting to the remote side, though rsync uses the backward-compatible options B<--msgs2stderr> and B<--no-msgs2stderr> to represent the B<all> and B<client> settings, respectively. A newer rsync will continue to accept these older option names to maintain compatibility.
uk: Цей варіант було додано у rsync 3.2.3. У цій версії також було розпочато переспрямовування нетипових параметрів на віддалений бік з'єднання, хоча rsync використовує зворотно сумісні параметри B<--msgs2stderr> і B<--no-msgs2stderr> для відтворення варіантів B<all> і B<client>, відповідно. Новіші версії rsync продовжуватимуть приймати ці старі назви варіантів для забезпечення сумісності.

source: This option decreases the amount of information you are given during the transfer, notably suppressing information messages from the remote server. This option is useful when invoking rsync from cron.
uk: Цей параметр зменшує обсяг відомостей, які буде надано під час передавання даних, зокрема придушує надсилання інформаційних повідомлень з віддаленого сервера. Цей параметр є корисним, якщо виклик rsync відбувається з cron.

source: This option affects the information that is output by the client at the start of a daemon transfer. This suppresses the message-of-the-day (MOTD) text, but it also affects the list of modules that the daemon sends in response to the "rsync host::" request (due to a limitation in the rsync protocol), so omit this option if you want to request the list of modules from the daemon.
uk: Цей параметр впливає на відомості, які буде виведено клієнтом на початку передавання з використанням фонової служби. Він придушує виведення тексту повідомлення дня (MOTD), а також вимикає виведення списку модулів, який фонова служба надсилає у відповідь на запит «rsync host::» (через обмеження протоколу rsync), тому не використовуйте цей параметр, якщо ви хочете надіслати запит щодо списку модулів до фонової служби.

source: Normally rsync will skip any files that are already the same size and have the same modification timestamp. This option turns off this "quick check" behavior, causing all files to be updated.
uk: Зазвичай, rsync пропускає при передавання усі файли, які мають такий самий розмір та ту саму часову позначку внесення змін. За допомогою цього параметра можна вимкнути таку поведінку із «швидкою перевіркою» і наказати програмі виконати оновлення усіх файлів.

source: This option can be confusing compared to B<--ignore-existing> and B<--ignore-non-existing> in that that they cause rsync to transfer fewer files, while this option causes rsync to transfer more files.
uk: Цей параметр можна сплутати з B<--ignore-existing> і B<--ignore-non-existing>, але вказані параметри зменшують кількість файлів, які передає rsync, а цей параметр наказує rsync передати більше файлів.

source: This modifies rsync's "quick check" algorithm for finding files that need to be transferred, changing it from the default of transferring files with either a changed size or a changed last-modified time to just looking for files that have changed in size. This is useful when starting to use rsync after using another mirroring system which may not preserve timestamps exactly.
uk: Змінює алгоритм «швидкої перевірки» rsync для пошуку файлів, які має бути передано, від типового перенесення файлів із зміненим розміром або часом внесення змін до алгоритму, який шукає лише файли, розмір яких змінено. Корисно, якщо ви розпочинаєте користування rsync після користування іншою системою віддзеркалення даних, яка могла не зберігати точні часові позначки файлів.

source: When comparing two timestamps, rsync treats the timestamps as being equal if they differ by no more than the modify-window value. The default is 0, which matches just integer seconds. If you specify a negative value (and the receiver is at least version 3.1.3) then nanoseconds will also be taken into account. Specifying 1 is useful for copies to/from MS Windows FAT filesystems, because FAT represents times with a 2-second resolution (allowing times to differ from the original by up to 1 second).
uk: При порівняння двох часових позначок rsync вважає позначки однаковими, якщо вони відрізняються не більше, ніж на значення modify-window. Типовим є значення 0, що означає, що значення мають бути рівним із точністю до цілих секунд. Якщо вами буде вказано від'ємне значення (і на боці отримувача даних буде встановлено принаймні версію 3.1.3), буде враховано позначки з точністю до наносекунд. Значення 1 може бути корисним для копіювання на файлові системи FAT MS Windows та з таких файлових систем, оскільки FAT зберігає часові дані з 2-секундною точністю (тобто записи часу можуть відрізнятися від початкових аж до 1 секунди).

source: If you want all your transfers to default to comparing nanoseconds, you can create a B<~/.popt> file and put these lines in it:
uk: Якщо вам потрібно, щоб під час усіх передавань даних типово порівняння виконувалося із точністю до наносекунд, ви можете створити файл B<~/.popt> і записати до нього такі рядки:

source: With that as the default, you'd need to specify B<--modify-window=0> (aka B<-@0>) to override it and ignore nanoseconds, e.g. if you're copying between ext3 and ext4, or if the receiving rsync is older than 3.1.3.
uk: Коли такі налаштування є типовими, вам слід вказати B<--modify-window=0> (або B<-@0>), щоб перевизначити їх і ігнорувати наносекунди, наприклад, якщо копіювання відбувається між ext3 і ext4, або якщо rsync на боці отримувача є старішим за 3.1.3.

source: This changes the way rsync checks if the files have been changed and are in need of a transfer. Without this option, rsync uses a "quick check" that (by default) checks if each file's size and time of last modification match between the sender and receiver. This option changes this to compare a 128-bit checksum for each file that has a matching size. Generating the checksums means that both sides will expend a lot of disk I/O reading all the data in the files in the transfer, so this can slow things down significantly (and this is prior to any reading that will be done to transfer changed files)
uk: Змінює спосіб, у який rsync перевіряє, чи було змінено файли і чи слід переносити їхні дані. Без цього параметра rsync використовує «швидку перевірку», тобто (типово) перевіряє, чи збігається розмір і час останнього внесення змін на боці відправника і отримувача. За допомогою цього параметра можна змінити перевірку на порівняння 128-бітових контрольних сум для кожного файлів та рівності розмірів файлів. Створення контрольних сум потребуватиме на обох кінцях з'єднання значних потоків введення-виведення для читання усіх даних файлів, які буде передано, отже значно уповільнить процедуру (читання буде виконано до читання даних для передавання змінених файлів).

source: The sending side generates its checksums while it is doing the file-system scan that builds the list of the available files. The receiver generates its checksums when it is scanning for changed files, and will checksum any file that has the same size as the corresponding sender's file: files with either a changed size or a changed checksum are selected for transfer.
uk: На боці надсилання створення контрольних сум буде виконано під час сканування файлової системи для побудови списку доступних файлів. На боці отримувача контрольні суми буде створено під час пошуку змінених файлів — контрольні суми буде створено для файлів, розмір яких збігається із відповідними файлами на боці відправника — для перенесення буде вибрано файли, розмір або контрольна сума яких є різними на кінцях з'єднання.

source: Note that rsync always verifies that each I<transferred> file was correctly reconstructed on the receiving side by checking a whole-file checksum that is generated as the file is transferred, but that automatic after-the-transfer verification has nothing to do with this option's before-the-transfer "Does this file need to be updated?" check.
uk: Зауважте, що rsync завжди перевіряє, чи правильно I<перенесений> файл було відтворено на боці отримувача шляхом перевірки контрольної суми усього файла, яку буде створено після перенесення файла, але цю автоматичну перевірку після перенесення ніяким чином не пов'язано із цією перевіркою до перенесення з метою відповісти на питання «Чи має бути оновлено той чи інший файл?».

source: The checksum used is auto-negotiated between the client and the server, but can be overridden using either the B<--checksum-choice> (B<--cc>) option or an environment variable that is discussed in that option's section.
uk: Контрольну суму буде використано під час автоматичного узгодження між клієнтом та сервером, але таку поведінку може бути перевизначено за допомогою або параметра B<--checksum-choice> (B<--cc>) або змінної середовища, обговорення щодо якої наведено у розділі щодо відповідного параметра.

source: This is equivalent to B<-rlptgoD>. It is a quick way of saying you want recursion and want to preserve almost everything. Be aware that it does B<not> include preserving ACLs (B<-A>), xattrs (B<-X>), atimes (B<-U>), crtimes (B<-N>), nor the finding and preserving of hardlinks (B<-H>).
uk: Еквівалент B<-rlptgoD>. Це швидкий спосіб вказати, що вам потрібна рекурсія, і ви хочете зберегти майже усе. Зауважте, що це B<не> стосується збереження ACL (B<-A>), xattr (B<-X>), atime (B<-U>), crtime (B<-N>), а також пошуку і збереження жорстких посилань (B<-H>).

source: The only exception to the above equivalence is when B<--files-from> is specified, in which case B<-r> is not implied.
uk: Єдиними виключенням із наведеної вище еквівалентності є визначення B<--files-from>, яке не встановлює неявним чином B<-r>.

source: B<--no-OPTION>
uk: B<--no-ПАРАМЕТР>

source: You may turn off one or more implied options by prefixing the option name with "no-". Not all positive options have a negated opposite, but a lot do, including those that can be used to disable an implied option (e.g. B<--no-D>, B<--no-perms>) or have different defaults in various circumstances (e.g. B<--no-whole-file>, B<--no-blocking-io>, B<--no-dirs>). Every valid negated option accepts both the short and the long option name after the "no-" prefix (e.g. B<--no-R> is the same as B<--no-relative>).
uk: Ви можете вимкнути один або декілька неявно заданих параметрів, додавши до назви параметра префікс «no-». Негативні варіанти є не в усіх параметрів, але у багатьох є, включно з тими, якими можна скористатися для вимикання неявно заданих параметрів (наприклад, B<--no-D>, B<--no-perms>) або встановлення інших типових значень за різних обставин (наприклад, B<--no-whole-file>, B<--no-blocking-io>, B<--no-dirs>). Кожен коректний негативний параметр можна використати для короткої і довгої версії назви після префікса «no-» (наприклад, B<--no-R> є тим самим, що і B<--no-relative>).

source: As an example, if you want to use B<--archive> (B<-a>) but don't want B<--owner> (B<-o>), instead of converting B<-a> into B<-rlptgD>, you can specify B<-a\ --no-o> (aka B<--archive\ --no-owner>).
uk: Наприклад, якщо ви хочете скористатися B<--archive> (B<-a>), але не хочете B<--owner> (B<-o>), замість перетворення B<-a> на B<-rlptgD>, ви можете вказати B<-a\ --no-o> (або B<--archive\ --no-owner>).

source: The order of the options is important: if you specify B<--no-r\ -a>, the B<-r> option would end up being turned on, the opposite of B<-a\ --no-r>. Note also that the side-effects of the B<--files-from> option are NOT positional, as it affects the default state of several options and slightly changes the meaning of B<-a> (see the B<--files-from> option for more details).
uk: Порядок параметрів є важливим: якщо ви вкажете B<--no-r\ -a>, параметр B<-r> буде увімкнено, і навпаки, якщо вказати B<-a\ --no-r>. Зауважте також, що побіжні результати застосування параметра B<--files-from> НЕ є позиційними, оскільки параметр змінює типовий стан декількох параметрів і дещо змінює значення B<-a> (див. параметр B<--files-from>, щоб дізнатися більше).

source: This tells rsync to copy directories recursively. See also B<--dirs> (B<-d>) for an option that allows the scanning of a single directory.
uk: Наказує rsync копіювати каталоги рекурсивно. Див. також B<--dirs> (B<-d>), щоб дізнатися про параметр, який уможливлює сканування окремого каталогу.

source: See the B<--inc-recursive> option for a discussion of the incremental recursion for creating the list of files to transfer.
uk: Див. опис параметра B<--inc-recursive>, де наведено обговорення нарощувальної рекурсії для створення списку файлів для передавання.

source: This option explicitly enables on incremental recursion when scanning for files, which is enabled by default when using the B<--recursive> option and both sides of the transfer are running rsync 3.0.0 or newer.
uk: Цей параметр явним чином вмикає нарощувальну рекурсію при пошуку файлів. Таку рекурсію буде типово увімкнено, якщо використано параметр B<--recursive> і на обох кінцях з'єднання запущено rsync 3.0.0 або новішу версію.

source: Incremental recursion uses much less memory than non-incremental, while also beginning the transfer more quickly (since it doesn't need to scan the entire transfer hierarchy before it starts transferring files). If no recursion is enabled in the source files, this option has no effect.
uk: Для нарощувальної рекурсії буде використано набагато менше пам'яті, ніж для ненарощувальної, а передавання буде розпочато швидше (оскільки є непотрібним сканування усіх ієрархії передавання до того, як буде розпочато передавання файлів). Якщо рекурсію не увімкнено для файлів джерела, цей параметр ні на що не вплине.
