Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: This environment variable sets an allocation maximum as if you had used the B<--max-alloc> option.
uk: Ця змінна середовища встановлює максимум отримання пам'яті, подібний до того, який встановлює використання параметра B<--max-alloc>.

source: This environment variable is used to find the user's default .cvsignore file.
uk: Цю змінну середовища використовують для пошуку типового файла .cvsignore користувача.

source: This environment variable is mainly used in debug setups to set the program to use when making a daemon connection. See CONNECTING TO AN RSYNC DAEMON for full details.
uk: Цю змінну середовища, в основному, використовують у конфігураціях для діагностики для встановлення програми, яку слід використовувати при встановленні з'єднання із фоновою службою. Див. розділ З'ЄДНАННЯ ІЗ ФОНОВОЮ СЛУЖБОЮ RSYNC, щоб ознайомитися з усіма подробицями.

source: This environment variable is mainly used in debug setups to set the program to use to run the program specified by [B<RSYNC_CONNECT_PROG>]. See CONNECTING TO AN RSYNC DAEMON for full details.
uk: Цю змінну середовища, в основному, використовують у конфігураціях для діагностики для встановлення програми, яку слід використовувати для запуску програми, яку вказано за допомогою [B<RSYNC_CONNECT_PROG>]. Див. розділ З'ЄДНАННЯ ІЗ ФОНОВОЮ СЛУЖБОЮ RSYNC, щоб ознайомитися з усіма подробицями.

source: FILES
uk: ФАЙЛИ

source: /etc/rsyncd.conf or rsyncd.conf
uk: /etc/rsyncd.conf або rsyncd.conf

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: BUGS
uk: ВАДИ

source: Times are transferred as *nix time_t values.
uk: Часові значення передаються як значення *nix time_t.

source: When transferring to FAT filesystems rsync may re-sync unmodified files. See the comments on the B<--modify-window> option.
uk: При передавання даних до файлових систем FAT rsync може повторно синхронізувати незмінені файли. Див. коментарі щодо параметра B<--modify-window>.

source: File permissions, devices, etc. are transferred as native numerical values.
uk: Права доступу до файлів, пристроїв тощо передаються як природні для системи числові значення.

source: See also the comments on the B<--delete> option.
uk: Див. також коментарі щодо параметра B<--delete>.

source: Please report bugs! See the web site at https://rsync.samba.org/.
uk: Будь ласка, повідомляйте про вади! Див. сайт на https://rsync.samba.org/.

source: VERSION
uk: ВЕРСІЯ

source: This manpage is current for version 3.2.4 of rsync.
uk: Ця сторінка підручника є актуальною для версії 3.2.4 rsync.

source: INTERNAL OPTIONS
uk: ВНУТРІШНІ ПАРАМЕТРИ

source: CREDITS
uk: ПОДЯКИ

source: Rsync is distributed under the GNU General Public License. See the file COPYING for details.
uk: Поширення rsync відбувається за умов дотримання GNU General Public License. Див. файл COPYING, щоб дізнатися більше.

source: An rsync web site is available at https://rsync.samba.org/. The site includes an FAQ-O-Matic which may cover questions unanswered by this manual page.
uk: Сайтом rsync є https://rsync.samba.org/. На сайті є FAQ-O-Matic, де можуть бути відповіді на питання, яких немає на цій сторінці підручника.

source: The rsync github project is https://github.com/WayneD/rsync.
uk: Проєкт rsync на github має адресу https://github.com/WayneD/rsync.

source: We would be delighted to hear from you if you like this program. Please contact the mailing-list at rsync@lists.samba.org.
uk: Ми будемо раді почути від вас про те, що вам подобається ця програма. Будь ласка, зв'яжіться з нами за допомогою списку листування rsync@lists.samba.org.

source: This program uses the excellent zlib compression library written by Jean-loup Gailly and Mark Adler.
uk: У цій програмі використано чудову бібліотеку для стискання zlib, яку написано Jean-loup Gailly і Mark Adler.

source: THANKS
uk: ПОДЯКИ

source: Special thanks go out to: John Van Essen, Matt McCutchen, Wesley W. Terpstra, David Dykstra, Jos Backus, Sebastian Krahmer, Martin Pool, and our gone-but-not-forgotten compadre, J.W. Schultz.
uk: Особливі подяки John Van Essen, Matt McCutchen, Wesley W. Terpstra, David Dykstra, Jos Backus, Sebastian Krahmer, Martin Pool і нашому другу, який полишив нас, але якого ми не забули, J.W. Schultz.

source: Thanks also to Richard Brent, Brendan Mackay, Bill Waite, Stephen Rothwell and David Bell. I've probably missed some people, my apologies if I have.
uk: Дякуємо також Richard Brent, Brendan Mackay, Bill Waite, Stephen Rothwell і David Bell. Ймовірно, ми когось забули. Вибачте, якщо це так.

source: AUTHOR
uk: АВТОР

source: Rsync was originally written by Andrew Tridgell and Paul Mackerras. Many people have later contributed to it. It is currently maintained by Wayne Davison.
uk: Першу версію rsync було написано Andrew Tridgell і Paul Mackerras. З того часу участь у розробці взяло багато людей. Поточний супровід програми здійснює Wayne Davison.

source: Mailing lists for support and development are available at https://lists.samba.org/.
uk: Списки листування для підтримки та розробників наведено на сторінці https://lists.samba.org/.
