Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: B<Literal\ data> is how much unmatched file-update data we had to send to the receiver for it to recreate the updated files.
uk: B<Literal\ data> — об'єм невідповідних даних щодо оновлення файлів, які довелося надіслати на бік отримання, щоб відтворити оновлені файли.

source: B<Matched\ data> is how much data the receiver got locally when recreating the updated files.
uk: B<Matched\ data> — об'єм даних, який отримувача отримав локально при відтворенні оновлених файлів.

source: B<File\ list\ size> is how big the file-list data was when the sender sent it to the receiver. This is smaller than the in-memory size for the file list due to some compressing of duplicated data when rsync sends the list.
uk: B<File\ list\ size> — наскільки великим був об'єм даних списку файлів при надсиланні з відправника до отримувача. Цей об'єм є меншим за розмір списку файлів у пам'яті через певне стискання дубльованих даних при надсиланні списку за допомогою rsynct.

source: B<File\ list\ generation\ time> is the number of seconds that the sender spent creating the file list. This requires a modern rsync on the sending side for this to be present.
uk: B<File\ list\ generation\ time> — кількість секунд, які відправник витратив на створення списку файлів. Це потребує сучасного rsync на боці відправника, щоб цей рядок було показано.

source: B<File\ list\ transfer\ time> is the number of seconds that the sender spent sending the file list to the receiver.
uk: B<File\ list\ transfer\ time> — кількість секунд, які відправник витратив на надсилання списку файлів до отримувача.

source: B<Total\ bytes\ sent> is the count of all the bytes that rsync sent from the client side to the server side.
uk: B<Total\ bytes\ sent> — кількість усіх байтів, які програма rsync надіслала з боку клієнта на бік сервера.

source: B<Total\ bytes\ received> is the count of all non-message bytes that rsync received by the client side from the server side. "Non-message" bytes means that we don't count the bytes for a verbose message that the server sent to us, which makes the stats more consistent.
uk: B<Total\ bytes\ received> — кількість байтів, не пов'язаних із повідомленнями, які програма rsync отримана на боці клієнта з боку сервера. «Не пов'язані із повідомленнями» означає, що до цього числа не буде включено байти з докладних повідомлень, які сервер надсилає отримувачу. Це робить статистику узгодженішою.

source: This tells rsync to leave all high-bit characters unescaped in the output instead of trying to test them to see if they're valid in the current locale and escaping the invalid ones. All control characters (but never tabs) are always escaped, regardless of this option's setting.
uk: Наказує rsync не екранувати усі високобітові символи у виведенні, замість спроби перевірити їх на коректність у поточній локалі і екранування некоректних. Усі керівні символи (але не табуляції) буде екрановано завжди, незалежно від того, чи встановлено цей параметр.

source: The escape idiom that started in 2.6.7 is to output a literal backslash (B<\e>) and a hash (B<#>), followed by exactly 3 octal digits. For example, a newline would output as "B<\e#012>". A literal backslash that is in a filename is not escaped unless it is followed by a hash and 3 digits (0-9).
uk: Ідіома екранування, яку було започатковано у версії 2.6.7, є виведенням самого символу зворотної похилої риски (B<\e>) і решітки (B<#>), після яких має бути вказано 3 вісімкових цифри. Наприклад, символ нового рядка буде виведено як «B<\e#012>». Сам символ зворотної похилої риски, який є частиною назви файла, не екранується, якщо після нього не вказано символу решітки і 3 цифр (0-9).

source: Output numbers in a more human-readable format. There are 3 possible levels:
uk: Виводити числа у зручнішому для читання форматі. Передбачено 3 можливі рівні:

source: output numbers with a separator between each set of 3 digits (either a comma or a period, depending on if the decimal point is represented by a period or a comma).
uk: виводити числа із роздільником між кожним набором з 3 цифр (комою або крапкою, залежно від того, яким є десятковий розділювач, крапкою чи комою).

source: output numbers in units of 1000 (with a character suffix for larger units\ -- see below).
uk: виводити числа у одиницях 1000 (із символьним суфіксом для більших одиниць\ -- див. нижче).

source: output numbers in units of 1024.
uk: виводити числа у одиницях 1024.

source: The default is human-readable level 1. Each B<-h> option increases the level by one. You can take the level down to 0 (to output numbers as pure digits) by specifying the B<--no-human-readable> (B<--no-h>) option.
uk: Типовим є рівень зручності читання 1. Кожен параметр B<-h> збільшує рівень на одиницю. Ви можете знизити рівень до 0 (щоб числа було виведено як звичайні цифри), вказавши параметр B<--no-human-readable> (B<--no-h>).

source: The unit letters that are appended in levels 2 and 3 are: B<K> (kilo), B<M> (mega), B<G> (giga), B<T> (tera), or B<P> (peta). For example, a 1234567-byte file would output as 1.23M in level-2 (assuming that a period is your local decimal point).
uk: Літерами одиниць, які буде дописано на рівнях 2 і 3, є такими: B<K> (кіло), B<M> (мега), B<G> (гіга), B<T> (тера) або B<P> (пета). Наприклад, для файла розміром у 1234567 байтів може бути виведено 1.23M на рівні 2 (припускаючи, що крапка є десятковим розділювачем вашої локалі).

source: Backward compatibility note: versions of rsync prior to 3.1.0 do not support human-readable level 1, and they default to level 0. Thus, specifying one or two B<-h> options will behave in a comparable manner in old and new versions as long as you didn't specify a B<--no-h> option prior to one or more B<-h> options. See the B<--list-only> option for one difference.
uk: Зауваження щодо зворотної сумісності: у версіях rsync до 3.1.0 не передбачено підтримки рівня зручності читання 1, у них типовим є рівень 0. Отже, використання одного або двох параметрів B<-h> призведе до подібної поведінки у старих і нових версіях, якщо вами не було вказано параметр B<--no-h> до одного або декількох параметрів B<-h>. Див. B<--list-only>, щоб дізнатися більше про одну відмінність.

source: By default, rsync will delete any partially transferred file if the transfer is interrupted. In some circumstances it is more desirable to keep partially transferred files. Using the B<--partial> option tells rsync to keep the partial file which should make a subsequent transfer of the rest of the file much faster.
uk: Типово, у разі переривання перенесення даних rsync вилучатиме всі частково перенесені файли. За певних обставин може виникнути потреба у збереженні цих частково перенесених файлів. За допомогою параметра B<--partial> ви можете наказати rsync зберігати частково перенесені файли. Це пришвидшить перенесення файлів під час наступної спроби.

source: B<--partial-dir=DIR>
uk: B<--partial-dir=КАТАЛОГ>

source: This option modifies the behavior of the B<--partial> option while also implying that it be enabled. This enhanced partial-file method puts any partially transferred files into the specified I<DIR> instead of writing the partial file out to the destination file. On the next transfer, rsync will use a file found in this dir as data to speed up the resumption of the transfer and then delete it after it has served its purpose.
uk: Цей параметр змінює поведінку у відповідь на використання параметра B<--partial> з неявним припущенням, що його увімкнено. Цей удосконалений спосіб часткового передавання файлів призводить до розташування частково переданих файлів у вказаному I<КАТАЛОЗІ>, замість запису частково переданих файлів до файла призначення. При наступному передаванні rsync використає файл, знайдений у цьому каталозі як дані для пришвидшення відновлення передавання, а потім вилучить його після того, як він виконає своє завдання.

source: Note that if B<--whole-file> is specified (or implied), any partial-dir files that are found for a file that is being updated will simply be removed (since rsync is sending files without using rsync's delta-transfer algorithm).
uk: Зауважте, що якщо вказано B<--whole-file> (або встановлено неявним чином), будь-які файли, які буде знайдено у каталозі часткових даних і які має бути оновлено, буде просто вилучено (оскільки rsync надсилає файли без використання алгоритму дельта-передавання rsync).

source: Rsync will create the I<DIR> if it is missing, but just the last dir\ -- not the whole path. This makes it easy to use a relative path (such as "B<--partial-dir=.rsync-partial>") to have rsync create the partial-directory in the destination file's directory when it is needed, and then remove it again when the partial file is deleted. Note that this directory removal is only done for a relative pathname, as it is expected that an absolute path is to a directory that is reserved for partial-dir work.
uk: Rsync створить I<КАТАЛОГ>, якщо його ще немає, але лише останній каталог в ієрархії\ -- не увесь шлях. Це спрощує використання відносного шляху (зокрема «B<--partial-dir=.rsync-partial>») для створення rsync каталогу часткових даних у каталозі файла призначення, якщо це потрібно, а потім вилучення цього каталогу, коли буде вилучено частковий файл. Зауважте, що це вилучення каталогу буде виконано для відносного шляху, оскільки вважається, що абсолютний шлях призначено для каталогу, який зарезервовано для обробки partial-dir.

source: If the partial-dir value is not an absolute path, rsync will add an exclude rule at the end of all your existing excludes. This will prevent the sending of any partial-dir files that may exist on the sending side, and will also prevent the untimely deletion of partial-dir items on the receiving side. An example: the above B<--partial-dir> option would add the equivalent of this "perishable" exclude at the end of any other filter rules: B<-f\ '-p\ .rsync-partial/'>
uk: Якщо значенням partial-dir не є абсолютний шлях, rsync додасть правило виключення наприкінці усіх ваших наявних виключень. Це правило запобігатиме надсиланню будь-яких файлів у partial-dir, які можуть міститися на боці надсилання, а також запобігатиме невчасному вилученню записів partial-dir на боці отримання. Приклад: наведений вище параметр B<--partial-dir> додасть еквівалент цього «тимчасового» виключення наприкінці усіх інших правил фільтрування: B<-f\ '-p\ .rsync-partial/'>

source: If you are supplying your own exclude rules, you may need to add your own exclude/hide/protect rule for the partial-dir because:
uk: Якщо ви надаєте ваші власні правила виключення, вам, можливо, варто додати ваше власне правило виключення, приховування або захисту для partial-dir через такі причини:

source: the auto-added rule may be ineffective at the end of your other rules, or
uk: автоматично додане правило може не спрацювати наприкінці ваших інших правил або

source: you may wish to override rsync's exclude choice.
uk: вам знадобиться перевизначення варіантів виключення, встановлених rsync.

source: For instance, if you want to make rsync clean-up any left-over partial-dirs that may be lying around, you should specify B<--delete-after> and add a "risk" filter rule, e.g. B<-f\ 'R\ .rsync-partial/'>. Avoid using B<--delete-before> or B<--delete-during> unless you don't need rsync to use any of the left-over partial-dir data during the current run.
uk: Наприклад, якщо ви хочете, щоб програма rsync вилучала усі лишки часткових каталогів, вам слід вказати B<--delete-after> і додати правило фільтрування «risk», наприклад, B<-f\ 'R\ .rsync-partial/'>. Уникайте використання B<--delete-before> або B<--delete-during>, якщо ви не хочете, щоб програма rsync використовувала лишки даних у каталозі часткових даних під час поточного запуску.

source: IMPORTANT: the B<--partial-dir> should not be writable by other users or it is a security risk! E.g. AVOID "/tmp"!
uk: ВАЖЛИВО: B<--partial-dir> має бути непридатним до запису для інших користувачів, інакше це завадить безпеці у системі! Наприклад, УНИКАЙТЕ «/tmp»!

source: You can also set the partial-dir value the B<RSYNC_PARTIAL_DIR> environment variable. Setting this in the environment does not force B<--partial> to be enabled, but rather it affects where partial files go when B<--partial> is specified. For instance, instead of using B<--partial-dir=.rsync-tmp> along with B<--progress>, you could set B<RSYNC_PARTIAL_DIR=.rsync-tmp> in your environment and then use the B<-P> option to turn on the use of the .rsync-tmp dir for partial transfers. The only times that the B<--partial> option does not look for this environment value are:
uk: Ви також можете встановити значення partial-dir за допомогою змінної середовища B<RSYNC_PARTIAL_DIR>. Встановлення цієї змінної у середовищі не призведе до примусового вмикання B<--partial>, а лише впливає на те, ще зберігатимуться часткові файли, якщо вказано B<--partial>. Наприклад, замість використання B<--partial-dir=.rsync-tmp> разом із B<--progress>, ви можете встановити B<RSYNC_PARTIAL_DIR=.rsync-tmp> у вашому середовищі, а потім скористатися параметром B<-P> для вмикання використання каталогу .rsync-tmp для часткових передавань. Єдиними випадками, коли використання параметра B<--partial> не призведе до пошуку цього значення середовища, є такі:

source: when B<--inplace> was specified (since B<--inplace> conflicts with B<--partial-dir>), and
uk: якщо було вказано B<--inplace> (оскільки B<--inplace> конфліктує з B<--partial-dir>) і

source: when B<--delay-updates> was specified (see below).
uk: якщо було вказано B<--delay-updates> (див. нижче).

source: When a modern rsync resumes the transfer of a file in the partial-dir, that partial file is now updated in-place instead of creating yet another tmp-file copy (so it maxes out at dest + tmp instead of dest + partial + tmp). This requires both ends of the transfer to be at least version 3.2.0.
uk: Коли сучасна версія rsync відновлює передавання файла у каталозі часткових даних, цей частковий файл буде оновлено на місці замість створення ще однієї копії тимчасового файла (отже, максимально матимемо призначення + тимчасовий, замість призначення + частковий + тимчасовий). Це потребує, щоб на обох кінцях з'єднання було встановлено принаймні версію 3.2.0.

source: For the purposes of the daemon-config's "B<refuse\ options>" setting, B<--partial-dir> does I<not> imply B<--partial>. This is so that a refusal of the B<--partial> option can be used to disallow the overwriting of destination files with a partial transfer, while still allowing the safer idiom provided by B<--partial-dir>.
uk: Для параметра «B<refuse\ options>» у налаштуваннях фонової служби B<--partial-dir> I<не> встановлює явним чином B<--partial>. Таким чином, відмовою від використання параметра B<--partial> можна скористатися для заборони перезапису файлів призначення за допомогою часткового передавання, але з уможливленням безпечнішої ідіоми, яка надається параметром B<--partial-dir>.

source: This option puts the temporary file from each updated file into a holding directory until the end of the transfer, at which time all the files are renamed into place in rapid succession. This attempts to make the updating of the files a little more atomic. By default the files are placed into a directory named B<.~tmp~> in each file's destination directory, but if you've specified the B<--partial-dir> option, that directory will be used instead. See the comments in the B<--partial-dir> section for a discussion of how this B<.~tmp~> dir will be excluded from the transfer, and what you can do if you want rsync to cleanup old B<.~tmp~> dirs that might be lying around. Conflicts with B<--inplace> and B<--append>.
uk: Використання цього параметра призводить до зберігання тимчасового файла для кожного оновлено файла до каталогу зберігання до кінця передавання даних із наступним перейменовуванням файлів до нового місця. Це робить оновлення файлів дещо більше атомарним. Типово, файли буде розташовано у підкаталозі із назвою B<.~tmp~> у кожному з каталогів призначення, але якщо вами було вказано параметр B<--partial-dir>, буде використано вказаний в аргументі до цього параметра каталог. Див. коментарі у розділі щодо B<--partial-dir>, щоб ознайомитися із тим, як цей каталог B<.~tmp~> буде виключено з передавання даних, і тим, що ви можете зробити, якщо хочете, щоб програма rsync вилучала застарілі зайві каталоги B<.~tmp~>. Параметр не можна використовувати разом із B<--inplace> і B<--append>.

source: This option implies B<--no-inc-recursive> since it needs the full file list in memory in order to be able to iterate over it at the end.
uk: Цей параметр неявним чином встановлює B<--no-inc-recursive>, оскільки він потребує повного списку файлів у пам'яті, щоб мати змогу виконувати ітерацію списком.

source: This option uses more memory on the receiving side (one bit per file transferred) and also requires enough free disk space on the receiving side to hold an additional copy of all the updated files. Note also that you should not use an absolute path to B<--partial-dir> unless:
uk: Використання цього параметра призводить до збільшення споживання пам'яті на боці отримання (на один біт для кожного переданого файла), а також потребує достатньо вільного місця на боці отримання для зберігання додаткової копії усіх оновлених файлів. Також зауважте, що вам не слід використовувати абсолютний шлях до B<--partial-dir>, якщо не виконуються такі умови:

source: there is no chance of any of the files in the transfer having the same name (since all the updated files will be put into a single directory if the path is absolute), and
uk: у наборі файлів передавання немає файлів із однаковими назвами (оскільки усі оновлені файли буде збережено до одного каталогу, якщо шлях є абсолютним);

source: there are no mount points in the hierarchy (since the delayed updates will fail if they can't be renamed into place).
uk: у ієрархії каталогів немає точок монтування (оскільки відкладені оновлення зазнають невдачі, якщо їх не можна буде перейменувати до остаточного місця зберігання).

source: See also the "atomic-rsync" python script in the "support" subdir for an update algorithm that is even more atomic (it uses B<--link-dest> and a parallel hierarchy of files).
uk: Див. також скрипт мовою Python «atomic-rsync» у підкаталозі «support», щоб ознайомитися із алгоритмом оновлення, який є ще атомарнішим (у ньому використано B<--link-dest> і паралельну ієрархію файлів).

source: This option tells the receiving rsync to get rid of empty directories from the file-list, including nested directories that have no non-directory children. This is useful for avoiding the creation of a bunch of useless directories when the sending rsync is recursively scanning a hierarchy of files using include/exclude/filter rules.
uk: Використання цього параметра наказує rsync на боці отримання позбутися порожніх каталогів зі списку файлів, включно із вкладеними каталогами, у яких немає дочірніх об'єктів, які не є каталогами. Корисно для уникнення створення низки непотрібних каталогів при рекурсивному сканування каталогів rsync відправника в ієрархії файлів за допомогою правил включення, виключення і фільтрування.

source: Note that the use of transfer rules, such as the B<--min-size> option, does not affect what goes into the file list, and thus does not leave directories empty, even if none of the files in a directory match the transfer rule.
uk: Зауважте, що використання правил передавання, зокрема параметра B<--min-size>, не впливає на вміст списку файлів, а отже, не лишає каталоги порожніми, навіть якщо жоден з файлів у каталозі не відповідає правилу передавання.

source: Because the file-list is actually being pruned, this option also affects what directories get deleted when a delete is active. However, keep in mind that excluded files and directories can prevent existing items from being deleted due to an exclude both hiding source files and protecting destination files. See the perishable filter-rule option for how to avoid this.
uk: Оскільки програма насправді виконує спрощення списку файлів, цей параметр також впливає на те, які каталоги буде вилучено, якщо увімкнено вилучення. Втім, слід пам'ятати, що виключені файли і каталоги можуть заважати вилученню наявних об'єктів через те, що одночасно приховують файли джерела і захищають файли призначення. Див. параметр тимчасового правила фільтрування, щоб дізнатися про те, як уникнути цього.

source: You can prevent the pruning of certain empty directories from the file-list by using a global "protect" filter. For instance, this option would ensure that the directory "emptydir" was kept in the file-list:
uk: Ви можете запобігти оптимізаційному вилученню певних порожніх каталогів зі списку файлів за допомогою загального фільтра «protect». Наприклад, цей параметр забезпечить збереження каталогу «порожній_каталог» у списку файлів:

source: --filter 'protect emptydir/'
uk: --filter 'protect порожній_каталог/'

source: Here's an example that copies all .pdf files in a hierarchy, only creating the necessary destination directories to hold the .pdf files, and ensures that any superfluous files and directories in the destination are removed (note the hide filter of non-directories being used instead of an exclude):
uk: Нижче наведено приклад копіювання усіх файлів .pdf в ієрархії, створить лише потрібні каталоги призначення для зберігання файлів .pdf і забезпечить вилучення зайвих файлів і каталогів у призначенні (зауважте, що використано фільтр приховування для об'єктів, які не є каталогами, а не виключення цих об'єктів):

source: rsync -avm --del --include='*.pdf' -f 'hide,! */' src/ dest
uk: rsync -avm --del --include='*.pdf' -f 'hide,! */' джерело/ призначення

source: If you didn't want to remove superfluous destination files, the more time-honored options of B<--include='*/'\ --exclude='*'> would work fine in place of the hide-filter (if that is more natural to you).
uk: Якщо ви не хочете вилучати зайві файли призначення, замість фільтра приховування можуть спрацювати традиційніші параметри B<--include='*/'\ --exclude='*'> (якщо ви вважаєте їх природнішими).

source: This option tells rsync to print information showing the progress of the transfer. This gives a bored user something to watch. With a modern rsync this is the same as specifying B<--info=flist2,name,progress>, but any user-supplied settings for those info flags takes precedence (e.g. B<--info=flist0\ --progress>).
uk: Використання цього параметра наказує rsync вивести відомості щодо поступу передавання даних. Таким чином, знудьгований користувач матиме за чим спостерігати. У сучасному rsync це те саме, що і зазначення B<--info=flist2,name,progress>, але будь-які вказані користувачем параметри для цих прапорців відомостей матимуть вищий пріоритет (наприклад, B<--info=flist0\ --progress>).

source: While rsync is transferring a regular file, it updates a progress line that looks like this:
uk: Під час передавання rsync звичайного файла програма оновлює рядок поступу, який виглядає ось так:

source: In this example, the receiver has reconstructed 782448 bytes or 63% of the sender's file, which is being reconstructed at a rate of 110.64 kilobytes per second, and the transfer will finish in 4 seconds if the current rate is maintained until the end.
uk: У цьому прикладі отримувач відтворив 782448 байтів або 63% файла відправника, який відтворюється зі швидкістю 110,64 кілобайтів за секунду, а передавання буде завершено за 4 секунд, якщо вдасться підтримувати поточну швидкість до кінця передавання.
