Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: Beginning in 3.2.3 the SIZE can be specified with a suffix as detailed in the B<--max-size> option. Older versions only accepted a byte count.
uk: Починаючи з версії 3.2.3, РОЗМІР може бути вказано з суфіксом, як це докладно описано для параметра B<--max-size>. У старіших версіях передбачено встановлення значення лише у байтах.

source: B<--rsh=COMMAND>, B<-e>
uk: B<--rsh=КОМАНДА>, B<-e>

source: This option allows you to choose an alternative remote shell program to use for communication between the local and remote copies of rsync. Typically, rsync is configured to use ssh by default, but you may prefer to use rsh on a local network.
uk: За допомогою цього параметра ви можете вибрати альтернативну віддалену програму командної оболонки, якою слід скористатися для обміну даними між локальною і віддаленою копіями rsync. Типово, rsync налаштовано на використання ssh, але у локальній мережі ви можете віддати перевагу користуванню rsh.

source: If this option is used with B<[user@]host::module/path>, then the remote shell I<COMMAND> will be used to run an rsync daemon on the remote host, and all data will be transmitted through that remote shell connection, rather than through a direct socket connection to a running rsync daemon on the remote host. See the USING RSYNC-DAEMON FEATURES VIA A REMOTE-SHELL CONNECTION section above.
uk: Якщо цей параметр використано з B<[користувач@]вузол::модуль/шлях>, для запуску фонової служби rsync на віддаленому вузлі буде використано віддалену оболонку I<КОМАНДА>, а усі дані буде передано за допомогою з'єднання із віддаленою оболонкою, а не через безпосереднє з'єднання із сокетом до запущеної фонової служби rsync на віддаленому вузлі. Див. розділ ВИКОРИСТАННЯ МОЖЛИВОСТЕЙ ФОНОВОЇ СЛУЖБИ RSYNC-ЗА ДОПОМОГОЮ З'ЄДНАННЯ ІЗ ВІДДАЛЕНОЮ ОБОЛОНКОЮ вище.

source: Beginning with rsync 3.2.0, the B<RSYNC_PORT> environment variable will be set when a daemon connection is being made via a remote-shell connection. It is set to 0 if the default daemon port is being assumed, or it is set to the value of the rsync port that was specified via either the B<--port> option or a non-empty port value in an B<rsync://> URL. This allows the script to discern if a non-default port is being requested, allowing for things such as an SSL or stunnel helper script to connect to a default or alternate port.
uk: Починаючи з версії rsync 3.2.0, при встановленні з'єднання із фоновою службою за допомогою віддаленої оболонки буде встановлено змінну середовища B<RSYNC_PORT>. Її значенням буде 0, якщо слід використовувати типовий порт фонової служби, або буде встановлено значення порту rsync, який було вказано або за допомогою параметра B<--port>, або непорожнього значення в адресі B<rsync://>. Це надає змогу скрипту визначати, чи було надіслано запит щодо нетипового порту, забезпечуючи працездатність таких речей, як SSL або допоміжного скрипту stunnel, для встановлення з'єднання із типовим або альтернативним портом.

source: Command-line arguments are permitted in COMMAND provided that COMMAND is presented to rsync as a single argument. You must use spaces (not tabs or other whitespace) to separate the command and args from each other, and you can use single- and/or double-quotes to preserve spaces in an argument (but not backslashes). Note that doubling a single-quote inside a single-quoted string gives you a single-quote; likewise for double-quotes (though you need to pay attention to which quotes your shell is parsing and which quotes rsync is parsing). Some examples:
uk: У КОМАНДІ можна використовувати аргументи, якщо КОМАНДУ подано до rsync як єдиний аргумент. Вам слід використовувати звичайні пробіли (не табуляції або спеціалізовані пробіли) для відокремлення команди та аргументів одне від одного. Ви також можете використовувати одинарні і/або подвійні лапки для екранування пробілів в аргументі (але не символи зворотної похилої риски). Зауважте, що подвоєння одинарних лапок усередині взятого в одинарні лапки рядка дасть вам одинарні лапки; те саме стосується подвійних лапок (хоча вам слід звернути увагу на те, які лапки обробляє командна оболонка, а які — rsync). Декілька прикладів:

source: (Note that ssh users can alternately customize site-specific connect options in their .ssh/config file.)
uk: (Зауважте, що користувачі ssh можуть налаштувати специфічні параметри з'єднання у своєму файлі .ssh/config.)

source: You can also choose the remote shell program using the B<RSYNC_RSH> environment variable, which accepts the same range of values as B<-e>.
uk: Ви також можете вибрати програму для віддаленої оболонки за допомогою змінної середовища B<RSYNC_RSH>, яка приймає той самий діапазон значень, що і B<-e>.

source: See also the B<--blocking-io> option which is affected by this option.
uk: Див. також параметр B<--blocking-io>, на роботу якого впливає цей параметр.

source: B<--rsync-path=PROGRAM>
uk: B<--rsync-path=ПРОГРАМА>

source: Use this to specify what program is to be run on the remote machine to start-up rsync. Often used when rsync is not in the default remote-shell's path (e.g. B<--rsync-path=/usr/local/bin/rsync>). Note that PROGRAM is run with the help of a shell, so it can be any program, script, or command sequence you'd care to run, so long as it does not corrupt the standard-in & standard-out that rsync is using to communicate.
uk: Скористайтеся цим параметром, щоб вказати програму, яку слід запустити на віддаленому комп'ютері для запуску rsync. Часто використовують, якщо rsync не зберігається у типовому шляху віддаленої оболонки (наприклад, B<--rsync-path=/usr/local/bin/rsync>). Зауважте, що ПРОГРАМУ буде запущено за допомогою командної оболонки, тому це може бути будь-яка програма, скрипт або послідовність команд, які вам потрібно запустити, якщо не порушено стандартний вхід і стандартний вихід, якими rsync користується для обміну даними.

source: One tricky example is to set a different default directory on the remote machine for use with the B<--relative> option. For instance:
uk: Одним із цікавих прикладів є встановлення іншого типового каталогу на віддаленому комп'ютері для використання з параметром B<--relative>. Приклад:

source: B<--remote-option=OPTION>, B<-M>
uk: B<--remote-option=ПАРАМЕТР>, B<-M>

source: This option is used for more advanced situations where you want certain effects to be limited to one side of the transfer only. For instance, if you want to pass B<--log-file=FILE> and B<--fake-super> to the remote system, specify it like this:
uk: Цей параметр використовують у складніших ситуаціях, де вам потрібно обмежити певні речі лише одним кінцем ланцюжка передавання даних. Наприклад, якщо ви хочете передати B<--log-file=ФАЙЛ> і B<--fake-super> на віддалену систему, вкажіть його так:

source: rsync -av -M --log-file=foo -M--fake-super src/ dest/
uk: rsync -av -M --log-file=foo -M--fake-super джерело/ призначення/

source: If you want to have an option affect only the local side of a transfer when it normally affects both sides, send its negation to the remote side. Like this:
uk: Якщо вам потрібно, щоб параметр впливав лише на локальний кінець ланцюжка передавання, якщо зазвичай він впливає на обидва кінці, надішліть його заперечення на віддалений кінець. Ось так:

source: rsync -av -x -M--no-x src/ dest/
uk: rsync -av -x -M--no-x джерело/ призначення/

source: Be cautious using this, as it is possible to toggle an option that will cause rsync to have a different idea about what data to expect next over the socket, and that will make it fail in a cryptic fashion.
uk: Будьте з цим обережні, оскільки можна перемкнути параметр, який накаже rsync змінити обробку даних, які потраплять до сокета, а це може призвести до незрозумілих помилок у роботі програми.

source: Note that you should use a separate B<-M> option for each remote option you want to pass. On older rsync versions, the presence of any spaces in the remote-option arg could cause it to be split into separate remote args, but this requires the use of B<--old-args> in a modern rsync.
uk: Зауважте, що вам слід скористатися окремим параметром B<-M> для кожного віддаленого параметра, який ви хочете передати. У застарілих версіях rsync наявність будь-яких пробілів в аргументах віддаленого параметра може спричинити їхній поділ на окремі віддалені аргументи, а у сучасних версіях rsync для відтворення такої поведінки потрібно вказати параметр B<--old-args>.

source: When performing a local transfer, the "local" side is the sender and the "remote" side is the receiver.
uk: При виконанні локального передавання даних «локальним» кінцем є кінець відправника, а «віддаленим» — кінець отримувача.

source: Note some versions of the popt option-parsing library have a bug in them that prevents you from using an adjacent arg with an equal in it next to a short option letter (e.g. B<-M--log-file=/tmp/foo>). If this bug affects your version of popt, you can use the version of popt that is included with rsync.
uk: Зауважте, що у деяких версіях бібліотеки для обробки параметрів popt є вада, яка заважає правильній обробці аргументу параметра у форматі короткої літери після знаку «дорівнює» (наприклад, B<-M--log-file=/tmp/щось>). Якщо ви маєте справу із такою версією popt у системі, ви можете скористатися версією popt, яку включено до складу rsync.

source: This is a useful shorthand for excluding a broad range of files that you often don't want to transfer between systems. It uses a similar algorithm to CVS to determine if a file should be ignored.
uk: Використання цього параметра буде корисним для виключення широкого діапазону файлів, які зазвичай не потрібно переносити між системами. Під час роботи з цим параметром програма використовуватиме той самий алгоритм, який допомагає CVS визначати файли, які слід ігнорувати.

source: The exclude list is initialized to exclude the following items (these initial items are marked as perishable\ -- see the FILTER RULES section):
uk: Список виключення буде ініціалізовано для виключення вказаних нижче записів (ці початкові записи буде позначено як придатні до вилучення — див. розділ ПРАВИЛА ФІЛЬТРУВАННЯ):

source: then, files listed in a $HOME/.cvsignore are added to the list and any files listed in the CVSIGNORE environment variable (all cvsignore names are delimited by whitespace).
uk: далі, до списку буде додано файли зі списку у $HOME/.cvsignore і усі файли зі списку у змінній середовища CVSIGNORE (усі назви у cvsignore буде відокремлено пробілами).

source: Finally, any file is ignored if it is in the same directory as a .cvsignore file and matches one of the patterns listed therein. Unlike rsync's filter/exclude files, these patterns are split on whitespace. See the B<cvs>(1) manual for more information.
uk: Нарешті, будь-який файл буде проігноровано, якщо він перебуває у тому самому каталозі, що і файл .cvsignore, і відповідає одному із взірців зі списку у файлі. На відміну від файлів фільтрування/виключення rsync, ці взірці буде поділено за пробілами. Див. підручник з B<cvs>(1), щоб дізнатися більше.

source: If you're combining B<-C> with your own B<--filter> rules, you should note that these CVS excludes are appended at the end of your own rules, regardless of where the B<-C> was placed on the command-line. This makes them a lower priority than any rules you specified explicitly. If you want to control where these CVS excludes get inserted into your filter rules, you should omit the B<-C> as a command-line option and use a combination of B<--filter=:C> and B<--filter=-C> (either on your command-line or by putting the ":C" and "-C" rules into a filter file with your other rules). The first option turns on the per-directory scanning for the .cvsignore file. The second option does a one-time import of the CVS excludes mentioned above.
uk: Якщо ви поєднуєте B<-C> із вашими власними правилами B<--filter>, вам слід зауважити, що ці виключення CVS буде дописано наприкінці ваших власних правил, незалежно від того, де розташовано B<-C> у рядку команди. Це робить їхній пріоритет нижчим за будь-які правила, які ви вкажете явним чином. Якщо ви хочете керувати тим, де ці виключення CVS буде вставлено до ваших правил фільтрування, вам слід уникати B<-C> як параметра командного рядка і скористатися поєднанням B<--filter=:C> і B<--filter=-C> (або у вашому рядку команди, або додаванням правил «:C» і «-C» до файла фільтрування із вашими іншими правилами). Перший варіант вмикає сканування для окремих каталогів для файла .cvsignore. Другий варіант виконує одноразове імпортування згаданих вище виключень CVS.

source: B<--filter=RULE>, B<-f>
uk: B<--filter=ПРАВИЛО>, B<-f>

source: This option allows you to add rules to selectively exclude certain files from the list of files to be transferred. This is most useful in combination with a recursive transfer.
uk: За допомогою цього параметра ви зможете додавати правила для вибіркового виключення певних файлів зі списку для перенесення. Вам варто використовувати цей параметр разом з параметром рекурсивного перенесення.

source: You may use as many B<--filter> options on the command line as you like to build up the list of files to exclude. If the filter contains whitespace, be sure to quote it so that the shell gives the rule to rsync as a single argument. The text below also mentions that you can use an underscore to replace the space that separates a rule from its arg.
uk: Ви можете скористатися у одному рядку команди довільною кількість параметрів B<--filter>, якщо хочете побудувати список файлів, які слід виключити. Якщо у фільтрі міститься пробіл, його має бути взято у лапки, щоб командна оболонка передала правило до rsync, як єдиний аргумент. У тексті нижче також згадується, що ви можете скористатися символом підкреслювання, щоб замінити пробіл, який відокремлює правило від його аргументу.

source: See the FILTER RULES section for detailed information on this option.
uk: Докладний опис цього параметра можна знайти у розділі ПРАВИЛА ФІЛЬТРУВАННЯ.

source: The B<-F> option is a shorthand for adding two B<--filter> rules to your command. The first time it is used is a shorthand for this rule:
uk: Параметр B<-F> є скороченням для додавання двох правил B<--filter> до вашої команди. Перше використання цього параметра є скороченням для такого правила:

source: This tells rsync to look for per-directory .rsync-filter files that have been sprinkled through the hierarchy and use their rules to filter the files in the transfer. If B<-F> is repeated, it is a shorthand for this rule:
uk: За допомогою цього параметра можна наказати rsync шукати у кожному з каталогів файли rsync-filter, розкидані ієрархією каталогів, і використовувати визначені у них правила для фільтрування списку файлів для перенесення. Якщо B<-F> повторено у команді, він вважається скороченням для такого правила:

source: This filters out the .rsync-filter files themselves from the transfer.
uk: За допомогою цього параметра можна увімкнути фільтрування самих файлів .rsync-filter під час перенесення даних.

source: See the FILTER RULES section for detailed information on how these options work.
uk: Докладний опис того, як ці параметри працюють, можна знайти у розділі ПРАВИЛА ФІЛЬТРУВАННЯ.

source: B<--exclude=PATTERN>
uk: B<--exclude=ВЗІРЕЦЬ>

source: This option is a simplified form of the B<--filter> option that defaults to an exclude rule and does not allow the full rule-parsing syntax of normal filter rules.
uk: Цей параметр є спрощеним різновидом параметра --filter, за якого використовується одне правило виключення, програма не виконуватиме повної обробки синтаксису звичайних правил фільтрування.

source: B<--exclude-from=FILE>
uk: B<--exclude-from=ФАЙЛ>

source: This option is related to the B<--exclude> option, but it specifies a FILE that contains exclude patterns (one per line). Blank lines in the file are ignored, as are whole-line comments that start with 'B<;>' or 'B<#>' (filename rules that contain those characters are unaffected).
uk: Цей параметр пов'язано із параметром B<--exclude>, але він визначає ФАЙЛ, у якому містяться взірці виключення (по одному на рядок). Порожні рядки у файлі буде проігноровано, як і коментарі на увесь рядок, які починаються з «B<;>» або «B<#>» (правила для назв файлів, які містять ці символи не буде проігноровано).

source: If I<FILE> is 'B<->', the list will be read from standard input.
uk: Якщо значенням I<ФАЙЛ> є «B<->», список буде прочитано зі стандартного джерела вхідних даних.

source: B<--include=PATTERN>
uk: B<--include=ВЗІРЕЦЬ>

source: This option is a simplified form of the B<--filter> option that defaults to an include rule and does not allow the full rule-parsing syntax of normal filter rules.
uk: Цей параметр є спрощеним різновидом параметра B<--filter>, за якого використовується одне правило включення, програма не виконуватиме повної обробки синтаксису звичайних правил фільтрування.

source: B<--include-from=FILE>
uk: B<--include-from=ФАЙЛ>

source: This option is related to the B<--include> option, but it specifies a FILE that contains include patterns (one per line). Blank lines in the file are ignored, as are whole-line comments that start with 'B<;>' or 'B<#>' (filename rules that contain those characters are unaffected).
uk: Цей параметр пов'язано із параметром B<--include>, але він визначає ФАЙЛ, у якому містяться взірці включення (по одному на рядок). Порожні рядки у файлі буде проігноровано, як і коментарі на увесь рядок, які починаються з «B<;>» або «B<#>» (правила для назв файлів, які містять ці символи не буде проігноровано).

source: B<--files-from=FILE>
uk: B<--files-from=ФАЙЛ>

source: Using this option allows you to specify the exact list of files to transfer (as read from the specified FILE or 'B<->' for standard input). It also tweaks the default behavior of rsync to make transferring just the specified files and directories easier:
uk: За допомогою цього параметра можна вказати точний список файлів для передавання (як його прочитано із вказаного ФАЙЛА або «B<->», замінника стандартного джерела вхідних даних). Він також коригує типову поведінку rsync так, щоб спростити передавання вказаних файлів і каталогів:

source: The B<--relative> (B<-R>) option is implied, which preserves the path information that is specified for each item in the file (use B<--no-relative> or B<--no-R> if you want to turn that off).
uk: Параметр B<--relative> (B<-R>) буде встановлено неявним чином. Цей параметр зберігає дані щодо шляху, які вказано для кожного запису у файлі (скористайтеся B<--no-relative> або B<--no-R>, якщо хочете вимкнути цю поведінку).

source: The B<--dirs> (B<-d>) option is implied, which will create directories specified in the list on the destination rather than noisily skipping them (use B<--no-dirs> or B<--no-d> if you want to turn that off).
uk: Параметр B<--dirs> (B<-d>) буде встановлено неявним чином. Використання цього параметра призведе до створення каталогів, які вказано у списку, на боці призначення, замість пропускання їх без повідомлень (скористайтеся B<--no-dirs> або B<--no-d>, якщо хочете вимкнути цю поведінку).

source: The B<--archive> (B<-a>) option's behavior does not imply B<--recursive> (B<-r>), so specify it explicitly, if you want it.
uk: Параметр B<--archive> (B<-a>) не встановлює неявним чином B<--recursive> (B<-r>), тому, якщо вам це потрібно, встановіть цей параметр явно.

source: These side-effects change the default state of rsync, so the position of the B<--files-from> option on the command-line has no bearing on how other options are parsed (e.g. B<-a> works the same before or after B<--files-from>, as does B<--no-R> and all other options).
uk: Ці побіжні ефекти змінюють типовий стан rsync. Отже, розташування параметра B<--files-from> у рядку команди не впливає на те, які буде оброблено інші параметри (наприклад, B<-a> працює однаково перед і після B<--files-from>, як і B<--no-R> та усі інші параметри).

source: The filenames that are read from the FILE are all relative to the source dir\ -- any leading slashes are removed and no ".." references are allowed to go higher than the source dir. For example, take this command:
uk: Назви файлів, які буде прочитано з файла ФАЙЛ, вважатимуться відносними щодо каталогу джерела — будь-які початкові символи похилої риски буде вилучено, а посилання «..» на каталог, який перебуває вище у ієрархії за каталог джерела, буде заборонено. Наприклад, ось така команда:

source: rsync -a --files-from=/tmp/foo /usr remote:/backup
uk: rsync -a --files-from=/tmp/щось /usr remote:/backup

source: If /tmp/foo contains the string "bin" (or even "/bin"), the /usr/bin directory will be created as /backup/bin on the remote host. If it contains "bin/" (note the trailing slash), the immediate contents of the directory would also be sent (without needing to be explicitly mentioned in the file\ -- this began in version 2.6.4). In both cases, if the B<-r> option was enabled, that dir's entire hierarchy would also be transferred (keep in mind that B<-r> needs to be specified explicitly with B<--files-from>, since it is not implied by B<-a>. Also note that the effect of the (enabled by default) B<-r> option is to duplicate only the path info that is read from the file\ -- it does not force the duplication of the source-spec path (/usr in this case).
uk: Якщо у /tmp/щось міститься рядок «bin» (або навіть «/bin»), каталог /usr/bin буде створено на віддаленому вузлі як /backup/bin. Якщо у ньому міститься «bin/» (зверніть увагу на кінцевий символ похилої риски), буде надіслано також миттєвий вміст каталогу (без потреби у явній згадці у файлі — від версії 2.6.4). В обох випадках, якщо було увімкнено параметр B<-r>, буде передано усю ієрархію каталогу (пам'ятайте, що B<-r> слід явним чином з B<--files-from>, оскільки його не встановлює неявним чином B<-a>. Також зауважте, що у результаті використання (типово увімкненого) параметра B<-r> буде здубльовано дані щодо шляху, які буде прочитано з файла — примусового дублювання специфічного для джерела шляху (у нашому прикладі /usr) не буде.

source: In addition, the B<--files-from> file can be read from the remote host instead of the local host if you specify a "host:" in front of the file (the host must match one end of the transfer). As a short-cut, you can specify just a prefix of ":" to mean "use the remote end of the transfer". For example:
uk: Крім того, файл B<--files-from> може бути прочитано з віддаленого вузла, замість локального вузла, якщо вами вказано «вузол:» перед записом файла (вузол має відповідати одним із кінців ланцюжка передавання даних). Ви можете скористатися скороченням, вказавши префікс «:», який означає «скористатися віддаленим кінцем ланцюжка передавання даних». Приклад:

source: rsync -a --files-from=:/path/file-list src:/ /tmp/copy
uk: rsync -a --files-from=:/шлях/список-файлів джерело:/ /tmp/копія

source: This would copy all the files specified in the /path/file-list file that was located on the remote "src" host.
uk: Ця команда скопіює усі файли, які вказано у файлі /шлях/список-файлів, який збережено на віддаленому вузлі «джерело».

source: If the B<--iconv> and B<--protect-args> options are specified and the B<--files-from> filenames are being sent from one host to another, the filenames will be translated from the sending host's charset to the receiving host's charset.
uk: Якщо вказано параметри B<--iconv> і B<--protect-args>, і назви файлів B<--files-from> надсилають з одного вузла на інший, назви файлів буде перетворено з набору символів вузла відправника до набору символів вузла отримувача.
