Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: It is sometimes useful to use various features of an rsync daemon (such as named modules) without actually allowing any new socket connections into a system (other than what is already required to allow remote-shell access). Rsync supports connecting to a host using a remote shell and then spawning a single-use "daemon" server that expects to read its config file in the home dir of the remote user. This can be useful if you want to encrypt a daemon-style transfer's data, but since the daemon is started up fresh by the remote user, you may not be able to use features such as chroot or change the uid used by the daemon. (For another way to encrypt a daemon transfer, consider using ssh to tunnel a local port to a remote machine and configure a normal rsync daemon on that remote host to only allow connections from "localhost".)
uk: Іноді корисно скористатися різноманітними можливостями фонової служби rsync (зокрема іменованими модулями) без уможливлення якихось нових з'єднань із сокетами у системі (окрім тих, які вже потрібні для уможливлення доступу до віддаленої оболонки). У rsync передбачено підтримку з'єднання із вузлом за допомогою віддаленої оболонки із наступним породженням одноразового сервера «фонової служби», який прочитає свій файл налаштувань у домашньому каталозі віддаленого користувача. Це може бути корисним, якщо ви хочете шифрувати передані дані у стилі фонової служби, але оскільки фонову службу запущено наново віддаленим користувачем, ви не можете скористатися можливостями зміни кореневої теки або зміни uid, використаного фоновою службою. (Іншим способом шифрування переданих даних фонової служби є використання ssh для тунелювання локального порту до віддаленого комп'ютера і налаштовування звичайної фонової служби rsync на віддаленому вузлі так, щоб вона приймала лише з'єднання з вузла «localhost».)

source: From the user's perspective, a daemon transfer via a remote-shell connection uses nearly the same command-line syntax as a normal rsync-daemon transfer, with the only exception being that you must explicitly set the remote shell program on the command-line with the B<--rsh=COMMAND> option. (Setting the RSYNC_RSH in the environment will not turn on this functionality.) For example:
uk: З точки зору користувача при передаванні даних фоновою службою за допомогою з'єднання із віддаленою оболонкою використовують майже такий самий синтаксис командного рядка, що і при звичайному передаванні даних фоновою службою rsync. Єдиним винятком є те, що вам доведеться явним чином встановити програму віддаленої оболонки у командному рядку за допомогою параметра B<--rsh=КОМАНДА>. (Встановлення RSYNC_RSH у середовищі не увімкне цю функціональну можливість.) Приклад:

source: rsync -av --rsh=ssh host::module /dest
uk: rsync -av --rsh=ssh вузол::модуль /призначення

source: If you need to specify a different remote-shell user, keep in mind that the user@ prefix in front of the host is specifying the rsync-user value (for a module that requires user-based authentication). This means that you must give the '-l user' option to ssh when specifying the remote-shell, as in this example that uses the short version of the B<--rsh> option:
uk: Якщо вам потрібно вказати іншого користувача віддаленої оболонки, зверніть увагу на те, що префікс «користувач@» перед записом вузла вказує значення користувача rsync (для модуля, який потребує розпізнавання на рівні користувачів). Це означає, що вам слід вказати параметр «-l користувач» для ssh при визначенні віддаленої оболонки, як у цьому прикладі, де використано коротку версію параметра B<--rsh>:

source: rsync -av -e "ssh -l ssh-user" rsync-user@host::module /dest
uk: rsync -av -e "ssh -l користувач-ssh" користувач-rsync@вузол::модуль /призначення

source: The "ssh-user" will be used at the ssh level; the "rsync-user" will be used to log-in to the "module".
uk: Запис «користувач-ssh» буде використано на рівні ssh; запис «користувач-rsync» буде використано для входу до «модуля».

source: STARTING AN RSYNC DAEMON TO ACCEPT CONNECTIONS
uk: ЗАПУСК ФОНОВОЇ СЛУЖБИ RSYNC ДЛЯ ПРИЙНЯТТЯ З'ЄДНАНЬ

source: In order to connect to an rsync daemon, the remote system needs to have a daemon already running (or it needs to have configured something like inetd to spawn an rsync daemon for incoming connections on a particular port). For full information on how to start a daemon that will handling incoming socket connections, see the B<rsyncd.conf>(5) manpage\ -- that is the config file for the daemon, and it contains the full details for how to run the daemon (including stand-alone and inetd configurations).
uk: Для встановлення з'єднання із фоновою службою rsync на віддаленій системі вже має бути запущено фонову службу (або там має бути налаштовано щось, подібне до inetd для породження фонової служби rsync для вхідних з'єднань на певному порту). Щоб дізнатися про те, як запустити фонову службу, яка оброблятиме вхідні з'єднання на сокеті, ознайомтеся зі сторінкою підручника щодо B<rsyncd.conf>(5)\ -- сторінку присвячено файлу налаштувань фонової служби, він містить усі подробиці щодо того, як запустити фонову службу (включно із самодостатніми налаштуваннями та налаштуваннями для inetd).

source: If you're using one of the remote-shell transports for the transfer, there is no need to manually start an rsync daemon.
uk: Якщо ви користуєтеся одним із каналів передавання віддаленої оболонки, у запуску фонової служби rsync вручну немає потреби.

source: SORTED TRANSFER ORDER
uk: ПОРЯДОК СОРТУВАННЯ ПЕРЕДАВАНЬ ДАНИХ

source: Rsync always sorts the specified filenames into its internal transfer list. This handles the merging together of the contents of identically named directories, makes it easy to remove duplicate filenames, and may confuse someone when the files are transferred in a different order than what was given on the command-line.
uk: Rsync завжди упорядковує вказані назви файлів у власному вбудованому списку передавань. Це стосується об'єднання вмісту каталогів із однаковими назвами, спрощення вилучення дублікатів назв файлів і може спричинити непорозуміння: файли буде передано не у тому порядку, у якому їх було вказано у рядку команди.

source: If you need a particular file to be transferred prior to another, either separate the files into different rsync calls, or consider using B<--delay-updates> (which doesn't affect the sorted transfer order, but does make the final file-updating phase happen much more rapidly).
uk: Якщо вам потрібно, щоб певний файл було передано перед іншими, або розділіть файли між різними викликами rsync, або скористайтеся параметром B<--delay-updates> (який не впливає на порядок сортування передавань, але значно пришвидшує настання остаточної фази оновлення файлів).

source: EXAMPLES
uk: ПРИКЛАДИ

source: Here are some examples of how I use rsync.
uk: Нижче наведено декілька прикладів використання rsync.

source: To backup my wife's home directory, which consists of large MS Word files and mail folders, I use a cron job that runs
uk: Для резервного копіювання домашнього каталогу жінки автора, де містяться великі файли MS Word і поштові теки, автор користується завданням cron, яке віддає команду

source: each night over a PPP connection to a duplicate directory on my machine "arvidsjaur".
uk: кожної ночі за з'єднанням PPP до каталогу дублікатів на комп'ютері автора «arvidsjaur».

source: To synchronize my samba source trees I use the following Makefile targets:
uk: Щоб синхронізувати ієрархії файлів початкового коду samba, автор використовує такі цілі у Makefile:

source: This allows me to sync with a CVS directory at the other end of the connection. I then do CVS operations on the remote machine, which saves a lot of time as the remote CVS protocol isn't very efficient.
uk: Це уможливлює синхронізацію з каталогом CVS версіями на іншому боці з'єднання. Далі, автор виконує дії із CVS на віддаленому комп'ютері, що заощаджує багато часу, оскільки протокол віддаленої роботи з CVS не є аж надто ефективним.

source: I mirror a directory between my "old" and "new" ftp sites with the command:
uk: Автор віддзеркалює каталог «old» і «new» сайтів ftp за допомогою такою команди:

source: This is launched from cron every few hours.
uk: Це запускається з cron кожні декілька годин.

source: OPTION SUMMARY
uk: РЕЗЮМЕ ПАРАМЕТРІВ

source: Here is a short summary of the options available in rsync. Each option also has its own detailed description later in this manpage.
uk: Тут наведено коротке резюме параметрів, які доступні у rsync. Кожен параметр докладно описано нижче на цій сторінці підручника.
