Repository: yurchor/uk-man-firewalld
Catalog: rsync/*.po
Languages: uk

source: Note that some older rsync versions (prior to 3.2.0) may have been built with a pre-release B<--atimes> patch that does not imply B<--open-noatime> when this option is repeated.
uk: Зауважте, що деякі застарілі версії rsync (до версії 3.2.0) може бути зібрано із використаною до випуску латкою B<--atimes>, яка не встановлює неявним чином B<--open-noatime>, якщо цей параметр повторено у команді.

source: This tells rsync to open files with the O_NOATIME flag (on systems that support it) to avoid changing the access time of the files that are being transferred. If your OS does not support the O_NOATIME flag then rsync will silently ignore this option. Note also that some filesystems are mounted to avoid updating the atime on read access even without the O_NOATIME flag being set.
uk: Використання цього параметра наказує rsync відкривати файли з прапорцем O_NOATIME (у системах, де передбачено його підтримку), щоб уникнути зміни часу доступу до файлів, які передаються. Якщо у вашій системі не передбачено підтримки прапорця O_NOATIME, rsync без повідомлень проігнорує такий параметр. Зауважте також, що деякі файлові системи монтують так, щоб уникнути оновлення часу доступу при доступі для читання, навіть без встановлення прапорця O_NOATIME.

source: This tells rsync to set the create times (newness) of the destination files to the same value as the source files.
uk: Наказує rsync встановити часи створення (новизни) для файлів призначення такі самі, як для файлів джерела.

source: This tells rsync to omit directories when it is preserving modification, access, and create times. If NFS is sharing the directories on the receiving side, it is a good idea to use B<-O>. This option is inferred if you use B<--backup> without B<--backup-dir>.
uk: Використання цього параметра наказує rsync уникати каталогів при збереженні часу внесення змін, доступу та створення. Якщо NFS поширюється на каталоги на боці отримання, варто скористатися B<-O>. Цей параметр буде неявно встановлено, якщо ви скористаєтеся B<--backup> без B<--backup-dir>.

source: This option also has the side-effect of avoiding early creation of missing sub-directories when incremental recursion is enabled, as discussed in the B<--inc-recursive> section.
uk: Використання цього параметра також має побіжний ефект уникнення раннього створення підкаталогів, яких не існує, якщо увімкнено нарощувальну рекурсію, як це обговорено у розділі щодо параметра B<--inc-recursive>.

source: This tells rsync to omit symlinks when it is preserving modification, access, and create times.
uk: Використання цього параметра наказує rsync уникати символічних посилань при збереженні часу внесення змін, доступу та створення.

source: This tells the receiving side to attempt super-user activities even if the receiving rsync wasn't run by the super-user. These activities include: preserving users via the B<--owner> option, preserving all groups (not just the current user's groups) via the B<--group> option, and copying devices via the B<--devices> option. This is useful for systems that allow such activities without being the super-user, and also for ensuring that you will get errors if the receiving side isn't being run as the super-user. To turn off super-user activities, the super-user can use B<--no-super>.
uk: Використання цього параметра наказує кінцю отримувача спробувати виконати дії надкористувача, навіть якщо rsync на боці отримувача запущено не від імені надкористувача. Серед цих дій такі: збереження користувачів-власників з використанням параметра B<--owner>, збереження усіх груп (не лише груп поточного користувача) з використанням параметра B<--group> і копіювання пристроїв з використанням параметра B<--devices>. Це корисно для систем, які дозволяють такі дії без набуття прав надкористувача та забезпечення отримання повідомлень про помилки, якщо на боці отримання програму запущено не від імені надкористувача. Щоб вимкнути дії від імені надкористувача, надкористувач може скористатися параметром B<--no-super>.

source: When this option is enabled, rsync simulates super-user activities by saving/restoring the privileged attributes via special extended attributes that are attached to each file (as needed). This includes the file's owner and group (if it is not the default), the file's device info (device & special files are created as empty text files), and any permission bits that we won't allow to be set on the real file (e.g. the real file gets u-s,g-s,o-t for safety) or that would limit the owner's access (since the real super-user can always access/change a file, the files we create can always be accessed/changed by the creating user). This option also handles ACLs (if B<--acls> was specified) and non-user extended attributes (if B<--xattrs> was specified).
uk: Якщо увімкнено цей параметр, rsync імітуватиме дії від імені надкористувача, зберігаючи/відновлюючи привілейовані атрибути за допомогою спеціальних розширених атрибутів, які буде долучено до кожного файла (якщо потрібно). Серед цих атрибутів дані щодо власника і групи файла (якщо вони не є типовими), відомості щодо пристрою файла (файли пристроїв і особливі файли буде створено як порожні текстові файли) та усі біти прав доступу, які було б заборонено встановлювати у справжній системі (наприклад, звичайний файл отримує u-s,g-s,o-t для безпеки), або які обмежували б доступ власнику (оскільки справжній надкористувач завжди може отримувати доступ і змінювати файл, доступ до зміни створених нами файлів завжди відкрито для користувача, який їх створив). Цей параметр також обробляє ACL (якщо було вказано B<--acls>) і розширені атрибути поза простором назв користувача (якщо вказано B<--xattrs>).

source: This is a good way to backup data without using a super-user, and to store ACLs from incompatible systems.
uk: Це добрий спосіб створення резервних копій даних без використання прав надкористувача і зберігання ALC із несумісних систем.

source: The B<--fake-super> option only affects the side where the option is used. To affect the remote side of a remote-shell connection, use the B<--remote-option> (B<-M>) option:
uk: Параметр B<--fake-super> стосується лише того кінця з'єднання, де його використано. Щоб вплинути на віддалений бік з'єднання із віддаленою оболонкою, скористайтеся параметром B<--remote-option> (B<-M>):

source: rsync -av -M--fake-super /src/ host:/dest/
uk: rsync -av -M--fake-super /джерело/ вузол:/призначення/

source: For a local copy, this option affects both the source and the destination. If you wish a local copy to enable this option just for the destination files, specify B<-M--fake-super>. If you wish a local copy to enable this option just for the source files, combine B<--fake-super> with B<-M--super>.
uk: При локальному копіюванні цей параметр стосуватиметься і джерела, і призначення. Якщо ви хочете при локальному копіюванні увімкнути цей параметр лише для файлів призначення, вкажіть B<-M--fake-super>. Якщо ви хочете при локальному копіюванні увімкнути цей параметр лише для файлів джерела, поєднайте B<--fake-super> із B<-M--super>.

source: This option is overridden by both B<--super> and B<--no-super>.
uk: Цей параметр буде перевизначено обома параметрами, B<--super> і B<--no-super>.

source: See also the B<fake\ super> setting in the daemon's rsyncd.conf file.
uk: Див. також параметр B<fake\ super> у файлі rsyncd.conf фонової служби.

source: Try to handle sparse files efficiently so they take up less space on the destination. If combined with B<--inplace> the file created might not end up with sparse blocks with some combinations of kernel version and/or filesystem type. If B<--whole-file> is in effect (e.g. for a local copy) then it will always work because rsync truncates the file prior to writing out the updated version.
uk: Спробувати обробляти розріджені файли ефективно, щоб вони займали менше місця у системі призначення. Якщо поєднано із B<--inplace>, створений файл може бути і не складатися із розріджених блоків у деяких комбінаціях версії ядра і/або типу файлової системи. Якщо використано B<--whole-file> (наприклад, для локального копіювання), працює завжди, оскільки rsync обрізає файл до запису оновленої версії.

source: Note that versions of rsync older than 3.1.3 will reject the combination of B<--sparse> and B<--inplace>.
uk: Зауважте, що версії rsync, які є старішими за 3.1.3, відмовлятимуть у одночасному використанні B<--sparse> і B<--inplace>.

source: This tells the receiver to allocate each destination file to its eventual size before writing data to the file. Rsync will only use the real filesystem-level preallocation support provided by Linux's B<fallocate>(2) system call or Cygwin's B<posix_fallocate>(3), not the slow glibc implementation that writes a null byte into each block.
uk: Наказує отримувачу розмістити на диску кожен файл призначення із його кінцевим розміром до запису даних до файла. Rsync використовуватиме лише підтримку справжнього попереднього отримання пам'яті на рівні файлової системи, яку надає системний виклик Linux B<fallocate>(2) або B<posix_fallocate>(3) у Cygwin, а не повільну реалізацію glibc, яка записує нуль-байт для кожного блоку.

source: Without this option, larger files may not be entirely contiguous on the filesystem, but with this option rsync will probably copy more slowly. If the destination is not an extent-supporting filesystem (such as ext4, xfs, NTFS, etc.), this option may have no positive effect at all.
uk: Без цього параметра запис великих файлів може бути не зовсім неперервним у файловій системі, але з цим параметром rsync, ймовірно, копіюватиме дані дещо повільніше. Якщо у призначенні використано систему без підтримки розширення (зокрема ext4, xfs, NTFS тощо), використання цього параметра взагалі може не мати жодних позитивних наслідків.

source: If combined with B<--sparse>, the file will only have sparse blocks (as opposed to allocated sequences of null bytes) if the kernel version and filesystem type support creating holes in the allocated data.
uk: Якщо поєднано із B<--sparse>, у файлі будуть лише розріджені блоки (на відміну від записаних на диск послідовностей нуль-байтів), якщо у версії ядра системи та типі файлової системи передбачено створення «дірок» у записаних на диск даних.

source: This makes rsync perform a trial run that doesn't make any changes (and produces mostly the same output as a real run). It is most commonly used in combination with the B<--verbose> (B<-v>) and/or B<--itemize-changes> (B<-i>) options to see what an rsync command is going to do before one actually runs it.
uk: Наказує rsync виконати тестовий запуск, без внесення змін (із виведенням майже тих самих даних, що і при справжньому запуску). Найчастіше використовують у поєднанні з параметрами B<--verbose> (B<-v>) і/або B<--itemize-changes> (B<-i>), щоб переглянути, які дії буде виконано командою rsync, перш ніж її буде насправді виконано.

source: The output of B<--itemize-changes> is supposed to be exactly the same on a dry run and a subsequent real run (barring intentional trickery and system call failures); if it isn't, that's a bug. Other output should be mostly unchanged, but may differ in some areas. Notably, a dry run does not send the actual data for file transfers, so B<--progress> has no effect, the "bytes sent", "bytes received", "literal data", and "matched data" statistics are too small, and the "speedup" value is equivalent to a run where no file transfers were needed.
uk: Виведення B<--itemize-changes> має бути точно таким самим, як і при тестовому запуску і наступному справжньому запуску (показуючи навмисні трюки та помилки системних викликів); якщо це не так, це вада. Інші виведені повідомлення мають бути здебільшого тими самим, але можуть відрізнятися у деяких областях. Зокрема, тестовий запуск не надсилає справжні дані для передавання файлів, отже B<--progress> не працюватиме, статистика «надіслано байтів», «отримано байтів», «буквальні дані» і «відповідні дані» буде заниженою, а значення «пришвидшення» буде рівним значенню при запуску, де не виконується жодного передавання даних.

source: This option disables rsync's delta-transfer algorithm, which causes all transferred files to be sent whole. The transfer may be faster if this option is used when the bandwidth between the source and destination machines is higher than the bandwidth to disk (especially when the "disk" is actually a networked filesystem). This is the default when both the source and destination are specified as local paths, but only if no batch-writing option is in effect.
uk: Використання цього параметра вимикає алгоритм дельта-передавання rsync, який спричиняє цілісне надсилання усіх переданих файлів. Цей параметр може пришвидшити передавання, якщо канал передавання даних між комп'ютером джерела та призначення є ширшим за канал передавання даних на диск (особливо, якщо «диском» є насправді мережева файлова система). Це типовий режим, якщо джерело і призначення вказано як локальні шляхи, але лише якщо не увімкнено параметр пакетного запису.

source: Disable whole-file updating when it is enabled by default for a local transfer. This usually slows rsync down, but it can be useful if you are trying to minimize the writes to the destination file (if combined with B<--inplace>) or for testing the checksum-based update algorithm.
uk: Вимкнути оновлення цілих файлів, якщо типово увімкнено для локального передавання даних. Зазвичай, уповільнює роботу rsync, але може бути корисним, якщо ви намагаєтеся мінімізувати запис до файла призначення (якщо поєднано із B<--inplace>), або для тестування алгоритму оновлення на основі контрольних сум.

source: B<--checksum-choice=STR>, B<--cc=STR>
uk: B<--checksum-choice=РЯДОК>, B<--cc=РЯДОК>

source: This option overrides the checksum algorithms. If one algorithm name is specified, it is used for both the transfer checksums and (assuming B<--checksum> is specified) the pre-transfer checksums. If two comma-separated names are supplied, the first name affects the transfer checksums, and the second name affects the pre-transfer checksums (B<-c>).
uk: За допомогою цього параметра можна перевизначити алгоритм обчислення контрольної суми. Якщо вказано одну назву алгоритму, його буде використано для обчислення контрольних сум передавання даних і (якщо вказано B<--checksum>) обчислення контрольних сум перед передаванням даних. Якщо вказано дві назви, які відокремлено комою, першу назву буде використано для контрольних сум передавання даних, а другу — для контрольних сум перед передаванням даних (B<-c>).

source: The checksum options that you may be able to use are:
uk: Параметри контрольних сум, якими ви можете скористатися, є такими:

source: B<auto> (the default automatic choice)
uk: B<auto> (типовий автоматичний вибір)

source: B<xxh64> (aka B<xxhash>)
uk: B<xxh64> (або B<xxhash>)

source: Run B<rsync\ --version> to see the default checksum list compiled into your version (which may differ from the list above).
uk: Віддайте команду B<rsync\ --version>, щоб переглянути список типових контрольних сум, підтримку яких було зібрано у вашій версії (список може відрізнятися від наведеного вище).

source: If "none" is specified for the first (or only) name, the B<--whole-file> option is forced on and no checksum verification is performed on the transferred data. If "none" is specified for the second (or only) name, the B<--checksum> option cannot be used.
uk: Якщо вказано «none» для першої (або єдиної) назви, буде примусово встановлено параметр B<--whole-file>, перевірка контрольних сум при передаванні даних не виконуватиметься. Якщо «none» вказано для другої (або єдиної) назви, не можна буде скористатися параметром B<--checksum>.

source: The "auto" option is the default, where rsync bases its algorithm choice on a negotiation between the client and the server as follows:
uk: Типовим є варіант «auto», коли вибір алгоритму в rsync буде засновано на узгодженні між клієнтом і сервером ось так:

source: When both sides of the transfer are at least 3.2.0, rsync chooses the first algorithm in the client's list of choices that is also in the server's list of choices. If no common checksum choice is found, rsync exits with an error. If the remote rsync is too old to support checksum negotiation, a value is chosen based on the protocol version (which chooses between MD5 and various flavors of MD4 based on protocol age).
uk: Якщо на обох кінцях ланцюжка передавання даних встановлено принаймні версію 3.2.0, rsync вибирає перший алгоритму у списку варіантів клієнта, який є також у списку варіантів сервера. Якщо спільних варіантів не буде виявлено, rsync завершить роботу із повідомленням про помилку. Якщо віддалений rsync є надто давнім, і у ньому не передбачено підтримки узгодження контрольних сум, значення буде вибрано на основі версії протоколу (вибір між MD5 і різноманітними варіантами MD4 на основі віку протоколу).

source: The default order can be customized by setting the environment variable B<RSYNC_CHECKSUM_LIST> to a space-separated list of acceptable checksum names. If the string contains a "B<&>" character, it is separated into the "client string & server string", otherwise the same string applies to both. If the string (or string portion) contains no non-whitespace characters, the default checksum list is used. This method does not allow you to specify the transfer checksum separately from the pre-transfer checksum, and it discards "auto" and all unknown checksum names. A list with only invalid names results in a failed negotiation.
uk: Типовий порядок можна налаштувати встановленням для змінної середовища B<RSYNC_CHECKSUM_LIST> значення списку відокремлених пробілами прийнятних назв контрольних сум. Якщо рядок містить «B<&>», його буде розділено на «рядок клієнта & рядок сервера», інакше той самий рядок буде застосовано до обох. Якщо рядок (або частина рядка) містить непробільні символи, буде використано типовий список контрольних сум. Цей спосіб не дозволить вам вказати контрольну суму, яку буде застосовано до передавання даних, окремо від контрольної суми, яку буде використано перед передаванням даних, а «auto» і усі невідомі назви контрольних сум буде просто відкинуто. Список, який міститиме лише некоректні назви, призведе до помилки під час узгодження.

source: The use of the B<--checksum-choice> option overrides this environment list.
uk: Використання параметра B<--checksum-choice> призводить до перевизначення цього списку середовища.

source: This tells rsync to avoid crossing a filesystem boundary when recursing. This does not limit the user's ability to specify items to copy from multiple filesystems, just rsync's recursion through the hierarchy of each directory that the user specified, and also the analogous recursion on the receiving side during deletion. Also keep in mind that rsync treats a "bind" mount to the same device as being on the same filesystem.
uk: За допомогою позначення цього пункту можна наказати rsync уникати перетинання меж файлових систем під час рекурсивного перегляду каталогів. Використання цього параметра не обмежує можливості користувача щодо копіювання з декількох файлових систем, просто обмежує рекурсивний перегляд rsync ієрархії кожної з вказаних користувачем тек, а також аналогічного рекурсивного перегляду на стороні отримання даних під час вилучення файлів. Крім того, вам слід пам’ятати, що rsync вважає точки монтування, «зав'язані» на один пристрій, однією файловою системою.

source: If this option is repeated, rsync omits all mount-point directories from the copy. Otherwise, it includes an empty directory at each mount-point it encounters (using the attributes of the mounted directory because those of the underlying mount-point directory are inaccessible).
uk: Якщо повторити цей параметр в одній команді, rsync при копіюванні пропустить усі каталоги, які є точками монтування. Якщо ж параметр не повторювати, програма включить порожній каталог для кожної виявленої точки монтування (з використанням атрибутів змонтованого каталогу, оскільки атрибути базового каталогу точки монтування є недоступними).

source: If rsync has been told to collapse symlinks (via B<--copy-links> or B<--copy-unsafe-links>), a symlink to a directory on another device is treated like a mount-point. Symlinks to non-directories are unaffected by this option.
uk: Якщо rsync наказано згорнути символічні посилання (за допомогою B<--copy-links> або B<--copy-unsafe-links>), символічне посилання на каталог на іншому пристрої вважатиметься точкою монтування. Цей параметр не впливатиме на символічні посилання на записи, які не є каталогами.

source: This tells rsync to skip creating files (including directories) that do not exist yet on the destination. If this option is combined with the B<--ignore-existing> option, no files will be updated (which can be useful if all you want to do is delete extraneous files).
uk: За допомогою цього параметра можна наказати rsync пропустити етап створення файлів (і каталогів), яких ще немає на стороні призначення. Якщо поєднати цей параметр з параметром B<--ignore-existing>, файли не оновлюватимуться взагалі (корисно, якщо вам потрібно просто вилучити зайві файли).

source: This tells rsync to skip updating files that already exist on the destination (this does I<not> ignore existing directories, or nothing would get done). See also B<--ignore-non-existing>.
uk: За допомогою цього параметра можна наказати rsync пропускати крок оновлення файлів, які вже існують у файловій системі призначення (наявні каталоги I<не> буде проігноровано, інакше нічого не буде виконано). Див. також B<--ignore-non-existing>.

source: This option can be useful for those doing backups using the B<--link-dest> option when they need to continue a backup run that got interrupted. Since a B<--link-dest> run is copied into a new directory hierarchy (when it is used properly), using [B<--ignore-existing> will ensure that the already-handled files don't get tweaked (which avoids a change in permissions on the hard-linked files). This does mean that this option is only looking at the existing files in the destination hierarchy itself.
uk: Цей параметр може бути корисним для тих, хто створює резервні копії з використанням параметра B<--link-dest>, якщо їм потрібно потрібно продовжити процедуру створення резервної копії, яку було перервано. Оскільки виконання B<--link-dest> передбачає копіювання до нової ієрархії каталогів (якщо його використано належним чином), використання B<--ignore-existing> забезпечить усування коригування вже оброблених файлів (тобто програма уникатиме зміни прав доступу до файлів, для яких використано жорсткі посилання). Це означає, що цей параметр призведе до пошуку лише наявних файлів у самій ієрархії призначення.

source: When B<--info=skip2> is used rsync will output "FILENAME exists (INFO)" messages where the INFO indicates one of "type change", "sum change" (requires B<-c>), "file change" (based on the quick check), "attr change", or "uptodate". Using B<--info=skip1> (which is also implied by 2 B<-v> options) outputs the exists message without the INFO suffix.
uk: Якщо використано B<--info=skip2>, rsync виводитиме повідомлення «НАЗВА_ФАЙЛА exists (ВІДОМОСТІ)», де ВІДОМОСТІ будуть одним з рядків: «type change» («змінено тип»), «sum change» (змінено суму», потребує B<-c>), «file change» («змінено файл», на основі швидкої перевірки), «attr change» («змінено атрибути») або «uptodate» («є актуальним»). Якщо використано B<--info=skip1> (тобто також неявним чином встановлено 2 параметри B<-v>), програма виведе повідомлення про існування, але без суфікса ВІДОМОСТІ.
